[Killed] ArithmeticOperator
packages/adr-kit/src/index-table.ts:89:28
 }
 
 function pad(text: string, width: number): string {
-  return text + ' '.repeat(width - text.length);
+  return text + ' '.repeat(width + text.length);
 }
 
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected 157 to be 123 // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/index-table.ts:92:72
   return text + ' '.repeat(width - text.length);
 }
 
-export function renderIndexTable(rows: readonly AdrIndexRow[]): string {
-  const headerCells = ['Number', 'Title', 'Status'];
-  const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
-  const widths = headerCells.map((header, col) =>
-    Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
-  );
-  const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
-  const separator = `| ${widths.map((width) => '-'.repeat(width)).join(' | ')} |`;
-  return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
-}
+export function renderIndexTable(rows: readonly AdrIndexRow[]): string {}
 
 export function upsertIndexRow(markdown: string, row: AdrIndexRow): string {
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] StringLiteral
packages/adr-kit/src/index-table.ts:93:43
 }
 
 export function renderIndexTable(rows: readonly AdrIndexRow[]): string {
-  const headerCells = ['Number', 'Title', 'Status'];
+  const headerCells = ['Number', 'Title', ""];
   const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
   const widths = headerCells.map((header, col) =>
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [] to have a length of 2 but got +0

[Killed] StringLiteral
packages/adr-kit/src/index-table.ts:93:34
 }
 
 export function renderIndexTable(rows: readonly AdrIndexRow[]): string {
-  const headerCells = ['Number', 'Title', 'Status'];
+  const headerCells = ['Number', "", 'Status'];
   const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
   const widths = headerCells.map((header, col) =>
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:94:34
 
 export function renderIndexTable(rows: readonly AdrIndexRow[]): string {
   const headerCells = ['Number', 'Title', 'Status'];
-  const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
+  const bodyCellsList = rows.map(() => undefined);
   const widths = headerCells.map((header, col) =>
     Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:95:34
 export function renderIndexTable(rows: readonly AdrIndexRow[]): string {
   const headerCells = ['Number', 'Title', 'Status'];
   const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
-  const widths = headerCells.map((header, col) =>
-    Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
+  const widths = headerCells.map(() => undefined,
   );
   const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected 27 to be 10 // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/index-table.ts:96:5
   const headerCells = ['Number', 'Title', 'Status'];
   const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
   const widths = headerCells.map((header, col) =>
-    Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
+    Math.min(header.length, ...bodyCellsList.map(cells => cells[col].length)),
   );
   const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: Invalid count value: -38

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:96:50
   const headerCells = ['Number', 'Title', 'Status'];
   const bodyCellsList = rows.map((row) => [numberCellText(row), row.title, row.status]);
   const widths = headerCells.map((header, col) =>
-    Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
+    Math.max(header.length, ...bodyCellsList.map(() => undefined)),
   );
   const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected 27 to be 10 // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:98:66
   const widths = headerCells.map((header, col) =>
     Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
   );
-  const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
+  const renderRow = (cells: readonly string[]) => `| ${cells.map(() => undefined).join(' | ')} |`;
   const separator = `| ${widths.map((width) => '-'.repeat(width)).join(' | ')} |`;
   return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected 10 to be 123 // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:98:21
   const widths = headerCells.map((header, col) =>
     Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
   );
-  const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
+  const renderRow = () => undefined;
   const separator = `| ${widths.map((width) => '-'.repeat(width)).join(' | ')} |`;
   return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected +0 to be 123 // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:99:37
     Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
   );
   const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
-  const separator = `| ${widths.map((width) => '-'.repeat(width)).join(' | ')} |`;
+  const separator = `| ${widths.map(() => undefined).join(' | ')} |`;
   return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
 }
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected 123 to be 10 // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/index-table.ts:99:48
     Math.max(header.length, ...bodyCellsList.map((cells) => cells[col].length)),
   );
   const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
-  const separator = `| ${widths.map((width) => '-'.repeat(width)).join(' | ')} |`;
+  const separator = `| ${widths.map((width) => "".repeat(width)).join(' | ')} |`;
   return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
 }
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: expected 123 to be 10 // Object.is equality

[Killed] ArrayDeclaration
packages/adr-kit/src/index-table.ts:100:10
   );
   const renderRow = (cells: readonly string[]) => `| ${cells.map((cell, col) => pad(cell, widths[col])).join(' | ')} |`;
   const separator = `| ${widths.map((width) => '-'.repeat(width)).join(' | ')} |`;
-  return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
+  return [].join('\n');
 }
 
killedBy: renderIndexTable pads columns to match Prettier output
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
packages/adr-kit/src/index-table.ts:103:76
   return [renderRow(headerCells), separator, ...bodyCellsList.map(renderRow)].join('\n');
 }
 
-export function upsertIndexRow(markdown: string, row: AdrIndexRow): string {
-  const eol = markdown.includes('\r\n') ? '\r\n' : '\n';
-  const lines = markdown.split(/\r?\n/);
-  const bounds = findTable(lines);
-  if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
-
-  const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
-  const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
-    (a, b) => a.number - b.number,
-  );
-  const renderedTable = renderIndexTable(mergedRows).split('\n');
-
-  const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
-  let result = newLines.join('\n');
-  if (eol === '\r\n') result = result.replace(/\n/g, '\r\n');
-  return result;
-}
+export function upsertIndexRow(markdown: string, row: AdrIndexRow): string {}
 
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BooleanLiteral
packages/adr-kit/src/index-table.ts:107:7
   const eol = markdown.includes('\r\n') ? '\r\n' : '\n';
   const lines = markdown.split(/\r?\n/);
   const bounds = findTable(lines);
-  if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
+  if (bounds) throw new AdrKitError('no ADR index table found', 'index');
 
   const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: no ADR index table found

[Killed] ConditionalExpression
packages/adr-kit/src/index-table.ts:107:7
   const eol = markdown.includes('\r\n') ? '\r\n' : '\n';
   const lines = markdown.split(/\r?\n/);
   const bounds = findTable(lines);
-  if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
+  if (false) throw new AdrKitError('no ADR index table found', 'index');
 
   const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
killedBy: upsertIndexRow throws AdrKitError with code index when there is no table
statusReason: expected error to be instance of AdrKitError

[Killed] ArithmeticOperator
packages/adr-kit/src/index-table.ts:109:50
   const bounds = findTable(lines);
   if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
 
-  const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
+  const existingRows = parseBodyRows(lines.slice(bounds.headerIdx - 2, bounds.endIdx));
   const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
     (a, b) => a.number - b.number,
killedBy: upsertIndexRow inserts a new row in ascending order when the number is between existing rows
statusReason: expected [ 2, 3 ] to deeply equal [ 1, 2, 3 ]

[Survived] MethodExpression
packages/adr-kit/src/index-table.ts:109:38
   const bounds = findTable(lines);
   if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
 
-  const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
+  const existingRows = parseBodyRows(lines);
   const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
     (a, b) => a.number - b.number,

[Killed] ConditionalExpression
packages/adr-kit/src/index-table.ts:110:60
   if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
 
   const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
-  const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
+  const mergedRows = [...existingRows.filter((existing) => false), row].sort(
     (a, b) => a.number - b.number,
   );
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [ { number: 1, …(3) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
packages/adr-kit/src/index-table.ts:110:60
   if (!bounds) throw new AdrKitError('no ADR index table found', 'index');
 
   const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
-  const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
+  const mergedRows = [...existingRows.filter((existing) => true), row].sort(
     (a, b) => a.number - b.number,
   );
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [ { number: 1, …(3) }, …(2) ] to have a length of 2 but got 3

[Killed] ArrowFunction
packages/adr-kit/src/index-table.ts:111:5
 
   const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
   const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
-    (a, b) => a.number - b.number,
+    () => undefined,
   );
   const renderedTable = renderIndexTable(mergedRows).split('\n');
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected 'Structured logging via the existing e…' to be 'Renamed decision' // Object.is equality

[Killed] ArithmeticOperator
packages/adr-kit/src/index-table.ts:111:15
 
   const existingRows = parseBodyRows(lines.slice(bounds.headerIdx + 2, bounds.endIdx));
   const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
-    (a, b) => a.number - b.number,
+    (a, b) => a.number + b.number,
   );
   const renderedTable = renderIndexTable(mergedRows).split('\n');
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected 'Structured logging via the existing e…' to be 'Renamed decision' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/index-table.ts:113:60
   const mergedRows = [...existingRows.filter((existing) => existing.number !== row.number), row].sort(
     (a, b) => a.number - b.number,
   );
-  const renderedTable = renderIndexTable(mergedRows).split('\n');
+  const renderedTable = renderIndexTable(mergedRows).split("");
 
   const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
packages/adr-kit/src/index-table.ts:115:24
   );
   const renderedTable = renderIndexTable(mergedRows).split('\n');
 
-  const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
+  const newLines = [...lines, ...renderedTable, ...lines.slice(bounds.endIdx)];
   let result = newLines.join('\n');
   if (eol === '\r\n') result = result.replace(/\n/g, '\r\n');
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected 'Boss–worker–checker pipeline with per…' to be 'Renamed decision' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/index-table.ts:115:79
   );
   const renderedTable = renderIndexTable(mergedRows).split('\n');
 
-  const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
+  const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines];
   let result = newLines.join('\n');
   if (eol === '\r\n') result = result.replace(/\n/g, '\r\n');
killedBy: upsertIndexRow inserts a new row in ascending order when the number is between existing rows
statusReason: expected [ 1, 2, 3, 1, 3 ] to deeply equal [ 1, 2, 3 ]

[Killed] StringLiteral
packages/adr-kit/src/index-table.ts:116:30
   const renderedTable = renderIndexTable(mergedRows).split('\n');
 
   const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
-  let result = newLines.join('\n');
+  let result = newLines.join("");
   if (eol === '\r\n') result = result.replace(/\n/g, '\r\n');
   return result;
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [] to have a length of 2 but got +0

[Survived] ConditionalExpression
packages/adr-kit/src/index-table.ts:117:7
 
   const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
   let result = newLines.join('\n');
-  if (eol === '\r\n') result = result.replace(/\n/g, '\r\n');
+  if (true) result = result.replace(/\n/g, '\r\n');
   return result;
 }

[Survived] ConditionalExpression
packages/adr-kit/src/index-table.ts:117:7
 
   const newLines = [...lines.slice(0, bounds.headerIdx), ...renderedTable, ...lines.slice(bounds.endIdx)];
   let result = newLines.join('\n');
-  if (eol === '\r\n') result = result.replace(/\n/g, '\r\n');
+  if (false) result = result.replace(/\n/g, '\r\n');
   return result;
 }
