[Killed] BlockStatement
packages/adr-kit/src/numbering.ts:3:67
 // src/numbering.ts — ADR number/filename/slug helpers (#467).
 
-export function formatAdrNumber(value: number, width = 4): string {
-  return String(value).padStart(width, '0');
-}
+export function formatAdrNumber(value: number, width = 4): string {}
 
 export function adrNumberFromFilename(filename: string): number | undefined {
killedBy: upsertIndexRow replaces a row with a matching number in place
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
packages/adr-kit/src/numbering.ts:7:77
   return String(value).padStart(width, '0');
 }
 
-export function adrNumberFromFilename(filename: string): number | undefined {
-  const basename = filename.split(/[/\\]/).pop() ?? '';
-  const match = /^(\d+)[-.]/.exec(basename);
-  return match ? Number(match[1]) : undefined;
-}
+export function adrNumberFromFilename(filename: string): number | undefined {}
 
 export function nextAdrNumber(existing: readonly number[]): number {
killedBy: parseAdr — leniency and edge cases falls back to the filename for the number when the H1 carries none
statusReason: expected undefined to be 42 // Object.is equality

[Killed] LogicalOperator
packages/adr-kit/src/numbering.ts:8:20
 }
 
 export function adrNumberFromFilename(filename: string): number | undefined {
-  const basename = filename.split(/[/\\]/).pop() ?? '';
+  const basename = filename.split(/[/\\]/).pop() && '';
   const match = /^(\d+)[-.]/.exec(basename);
   return match ? Number(match[1]) : undefined;
killedBy: parseAdr — leniency and edge cases falls back to the filename for the number when the H1 carries none
statusReason: expected undefined to be 42 // Object.is equality

[NoCoverage] StringLiteral
packages/adr-kit/src/numbering.ts:8:53
 }
 
 export function adrNumberFromFilename(filename: string): number | undefined {
-  const basename = filename.split(/[/\\]/).pop() ?? '';
+  const basename = filename.split(/[/\\]/).pop() ?? "Stryker was here!";
   const match = /^(\d+)[-.]/.exec(basename);
   return match ? Number(match[1]) : undefined;

[Killed] Regex
packages/adr-kit/src/numbering.ts:9:17
 
 export function adrNumberFromFilename(filename: string): number | undefined {
   const basename = filename.split(/[/\\]/).pop() ?? '';
-  const match = /^(\d+)[-.]/.exec(basename);
+  const match = /^(\d+)[^-.]/.exec(basename);
   return match ? Number(match[1]) : undefined;
 }
killedBy: parseAdr — leniency and edge cases falls back to the filename for the number when the H1 carries none
statusReason: expected 4 to be 42 // Object.is equality

[Survived] Regex
packages/adr-kit/src/numbering.ts:9:17
 
 export function adrNumberFromFilename(filename: string): number | undefined {
   const basename = filename.split(/[/\\]/).pop() ?? '';
-  const match = /^(\d+)[-.]/.exec(basename);
+  const match = /(\d+)[-.]/.exec(basename);
   return match ? Number(match[1]) : undefined;
 }

[Killed] BlockStatement
packages/adr-kit/src/numbering.ts:13:68
   return match ? Number(match[1]) : undefined;
 }
 
-export function nextAdrNumber(existing: readonly number[]): number {
-  return existing.length ? Math.max(...existing) + 1 : 1;
-}
+export function nextAdrNumber(existing: readonly number[]): number {}
 
 export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {
killedBy: nextAdrNumber returns 1 for an empty list
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/numbering.ts:14:28
 }
 
 export function nextAdrNumber(existing: readonly number[]): number {
-  return existing.length ? Math.max(...existing) + 1 : 1;
+  return existing.length ? Math.min(...existing) + 1 : 1;
 }
 
killedBy: nextAdrNumber returns one past the max
statusReason: expected 2 to be 4 // Object.is equality

[Killed] ArithmeticOperator
packages/adr-kit/src/numbering.ts:14:28
 }
 
 export function nextAdrNumber(existing: readonly number[]): number {
-  return existing.length ? Math.max(...existing) + 1 : 1;
+  return existing.length ? Math.max(...existing) - 1 : 1;
 }
 
killedBy: nextAdrNumber returns one past the max
statusReason: expected 2 to be 4 // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/numbering.ts:17:82
   return existing.length ? Math.max(...existing) + 1 : 1;
 }
 
-export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {
-  const numbers = filenames
-    .map((filename) => adrNumberFromFilename(filename))
-    .filter((value): value is number => value !== undefined);
-  return nextAdrNumber(numbers);
-}
+export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {}
 
 export function adrSlug(title: string): string {
killedBy: nextAdrNumberFromFilenames ignores files with no leading number
statusReason: expected undefined to be 4 // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/numbering.ts:18:19
 }
 
 export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {
-  const numbers = filenames
-    .map((filename) => adrNumberFromFilename(filename))
-    .filter((value): value is number => value !== undefined);
+  const numbers = filenames.map(filename => adrNumberFromFilename(filename));
   return nextAdrNumber(numbers);
 }
killedBy: nextAdrNumberFromFilenames ignores files with no leading number
statusReason: expected NaN to be 4 // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/numbering.ts:19:10
 
 export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {
   const numbers = filenames
-    .map((filename) => adrNumberFromFilename(filename))
+    .map(() => undefined)
     .filter((value): value is number => value !== undefined);
   return nextAdrNumber(numbers);
killedBy: nextAdrNumberFromFilenames ignores files with no leading number
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/numbering.ts:20:13
 export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {
   const numbers = filenames
     .map((filename) => adrNumberFromFilename(filename))
-    .filter((value): value is number => value !== undefined);
+    .filter(() => undefined);
   return nextAdrNumber(numbers);
 }
killedBy: nextAdrNumberFromFilenames ignores files with no leading number
statusReason: expected 1 to be 4 // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/numbering.ts:20:41
 export function nextAdrNumberFromFilenames(filenames: readonly string[]): number {
   const numbers = filenames
     .map((filename) => adrNumberFromFilename(filename))
-    .filter((value): value is number => value !== undefined);
+    .filter((value): value is number => value === undefined);
   return nextAdrNumber(numbers);
 }
killedBy: nextAdrNumberFromFilenames ignores files with no leading number
statusReason: expected NaN to be 4 // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/numbering.ts:24:48
   return nextAdrNumber(numbers);
 }
 
-export function adrSlug(title: string): string {
-  const dashed = title.toLowerCase().replace(/[^a-z0-9]+/g, '-');
-  let start = 0;
-  while (start < dashed.length && dashed[start] === '-') start++;
-  let end = dashed.length;
-  while (end > start && dashed[end - 1] === '-') end--;
-  return dashed.slice(start, end);
-}
+export function adrSlug(title: string): string {}
 
 export function adrFilename(value: number, title: string, width = 4): string {
killedBy: adrSlug lowercases and dasherizes
statusReason: expected undefined to be 'use-x-instead-of-y' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/numbering.ts:25:18
 }
 
 export function adrSlug(title: string): string {
-  const dashed = title.toLowerCase().replace(/[^a-z0-9]+/g, '-');
+  const dashed = title.toUpperCase().replace(/[^a-z0-9]+/g, '-');
   let start = 0;
   while (start < dashed.length && dashed[start] === '-') start++;
killedBy: adrSlug lowercases and dasherizes
statusReason: expected '' to be 'use-x-instead-of-y' // Object.is equality

[Killed] Regex
packages/adr-kit/src/numbering.ts:25:46
 }
 
 export function adrSlug(title: string): string {
-  const dashed = title.toLowerCase().replace(/[^a-z0-9]+/g, '-');
+  const dashed = title.toLowerCase().replace(/[^a-z0-9]/g, '-');
   let start = 0;
   while (start < dashed.length && dashed[start] === '-') start++;
killedBy: adrSlug collapses runs of non-alphanumerics and trims edges
statusReason: expected 'hello--world' to be 'hello-world' // Object.is equality

[Killed] UpdateOperator
packages/adr-kit/src/numbering.ts:27:58
 export function adrSlug(title: string): string {
   const dashed = title.toLowerCase().replace(/[^a-z0-9]+/g, '-');
   let start = 0;
-  while (start < dashed.length && dashed[start] === '-') start++;
+  while (start < dashed.length && dashed[start] === '-') start--;
   let end = dashed.length;
   while (end > start && dashed[end - 1] === '-') end--;
killedBy: adrSlug collapses runs of non-alphanumerics and trims edges
statusReason: expected '' to be 'hello-world' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/numbering.ts:27:10
 export function adrSlug(title: string): string {
   const dashed = title.toLowerCase().replace(/[^a-z0-9]+/g, '-');
   let start = 0;
-  while (start < dashed.length && dashed[start] === '-') start++;
+  while (false) start++;
   let end = dashed.length;
   while (end > start && dashed[end - 1] === '-') end--;
killedBy: adrSlug collapses runs of non-alphanumerics and trims edges
statusReason: expected '-hello-world' to be 'hello-world' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/numbering.ts:29:10
   let start = 0;
   while (start < dashed.length && dashed[start] === '-') start++;
   let end = dashed.length;
-  while (end > start && dashed[end - 1] === '-') end--;
+  while (false) end--;
   return dashed.slice(start, end);
 }
killedBy: adrSlug collapses runs of non-alphanumerics and trims edges
statusReason: expected 'hello-world-' to be 'hello-world' // Object.is equality

[Killed] UpdateOperator
packages/adr-kit/src/numbering.ts:29:50
   let start = 0;
   while (start < dashed.length && dashed[start] === '-') start++;
   let end = dashed.length;
-  while (end > start && dashed[end - 1] === '-') end--;
+  while (end > start && dashed[end - 1] === '-') end++;
   return dashed.slice(start, end);
 }
killedBy: adrSlug collapses runs of non-alphanumerics and trims edges
statusReason: expected 'hello-world-' to be 'hello-world' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/numbering.ts:30:10
   while (start < dashed.length && dashed[start] === '-') start++;
   let end = dashed.length;
   while (end > start && dashed[end - 1] === '-') end--;
-  return dashed.slice(start, end);
+  return dashed;
 }
 
killedBy: adrSlug collapses runs of non-alphanumerics and trims edges
statusReason: expected '-hello-world-' to be 'hello-world' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/numbering.ts:33:78
   return dashed.slice(start, end);
 }
 
-export function adrFilename(value: number, title: string, width = 4): string {
-  return `${formatAdrNumber(value, width)}-${adrSlug(title)}.md`;
-}
+export function adrFilename(value: number, title: string, width = 4): string {}
 
killedBy: adrFilename combines the padded number and slug
statusReason: expected undefined to be '0005-use-x.md' // Object.is equality
