[Killed] BlockStatement
packages/adr-kit/src/parse.ts:8:59
 import { NYGARD_CONVENTION } from './convention.js';
 import { adrNumberFromFilename } from './numbering.js';
 
-function trimBlankEdges(lines: readonly string[]): string {
-  let start = 0;
-  let end = lines.length;
-  while (start < end && lines[start].trim() === '') start++;
-  while (end > start && lines[end - 1].trim() === '') end--;
-  return lines.slice(start, end).join('\n');
-}
+function trimBlankEdges(lines: readonly string[]): string {}
 
 interface ParsedSection {
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] LogicalOperator
packages/adr-kit/src/parse.ts:11:10
 function trimBlankEdges(lines: readonly string[]): string {
   let start = 0;
   let end = lines.length;
-  while (start < end && lines[start].trim() === '') start++;
+  while (start < end || lines[start].trim() === '') start++;
   while (end > start && lines[end - 1].trim() === '') end--;
   return lines.slice(start, end).join('\n');
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] UpdateOperator
packages/adr-kit/src/parse.ts:11:53
 function trimBlankEdges(lines: readonly string[]): string {
   let start = 0;
   let end = lines.length;
-  while (start < end && lines[start].trim() === '') start++;
+  while (start < end && lines[start].trim() === '') start--;
   while (end > start && lines[end - 1].trim() === '') end--;
   return lines.slice(start, end).join('\n');
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] UpdateOperator
packages/adr-kit/src/parse.ts:12:55
   let start = 0;
   let end = lines.length;
   while (start < end && lines[start].trim() === '') start++;
-  while (end > start && lines[end - 1].trim() === '') end--;
+  while (end > start && lines[end - 1].trim() === '') end++;
   return lines.slice(start, end).join('\n');
 }
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:12:10
   let start = 0;
   let end = lines.length;
   while (start < end && lines[start].trim() === '') start++;
-  while (end > start && lines[end - 1].trim() === '') end--;
+  while (end <= start && lines[end - 1].trim() === '') end--;
   return lines.slice(start, end).join('\n');
 }
killedBy: parseAdr — CLASSIC_NYGARD reads the number from the numbered-dot H1, status from its section, and date from the bare preamble line
statusReason: expected 'Accepted\n' to be 'Accepted' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/parse.ts:13:10
   let end = lines.length;
   while (start < end && lines[start].trim() === '') start++;
   while (end > start && lines[end - 1].trim() === '') end--;
-  return lines.slice(start, end).join('\n');
+  return lines.join('\n');
 }
 
killedBy: parseAdr — CLASSIC_NYGARD reads the number from the numbered-dot H1, status from its section, and date from the bare preamble line
statusReason: expected '\nAccepted\n' to be 'Accepted' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/parse.ts:13:39
   let end = lines.length;
   while (start < end && lines[start].trim() === '') start++;
   while (end > start && lines[end - 1].trim() === '') end--;
-  return lines.slice(start, end).join('\n');
+  return lines.slice(start, end).join("");
 }
 
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected [ { …(2) } ] to have a length of 2 but got 1

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:22:69
   body: string;
 }
 
-function parseReferenceLine(line: string): AdrReference | undefined {
-  let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
-  if (m) return { text: m[2], url: m[3], marker: m[1] };
-  m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
-  if (m) return { text: m[2], url: m[2], marker: m[1] };
-  m = /^\s*([-*])\s+(.+)$/.exec(line);
-  if (m) return { text: m[2], marker: m[1] };
-  return undefined;
-}
+function parseReferenceLine(line: string): AdrReference | undefined {}
 
 interface ParseInternalResult {
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected [] to have a length of 2 but got +0

[Killed] Regex
packages/adr-kit/src/parse.ts:23:11
 }
 
 function parseReferenceLine(line: string): AdrReference | undefined {
-  let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
+  let m = /^\s([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
   if (m) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be defined

[Killed] Regex
packages/adr-kit/src/parse.ts:23:11
 }
 
 function parseReferenceLine(line: string): AdrReference | undefined {
-  let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
+  let m = /^\s*([-*])\s+\[([^\]])]\(([^)]+)\)\s*$/.exec(line);
   if (m) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:24:7
 
 function parseReferenceLine(line: string): AdrReference | undefined {
   let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
-  if (m) return { text: m[2], url: m[3], marker: m[1] };
+  if (true) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
killedBy: parseAdr — unstructured references leaves references empty and files the section as extra when a body line matches no bullet form
statusReason: Cannot read properties of null (reading '2')

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:24:7
 
 function parseReferenceLine(line: string): AdrReference | undefined {
   let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
-  if (m) return { text: m[2], url: m[3], marker: m[1] };
+  if (false) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be defined

[Survived] Regex
packages/adr-kit/src/parse.ts:25:7
 function parseReferenceLine(line: string): AdrReference | undefined {
   let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
   if (m) return { text: m[2], url: m[3], marker: m[1] };
-  m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
+  m = /^\S*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
   m = /^\s*([-*])\s+(.+)$/.exec(line);

[Survived] Regex
packages/adr-kit/src/parse.ts:25:7
 function parseReferenceLine(line: string): AdrReference | undefined {
   let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
   if (m) return { text: m[2], url: m[3], marker: m[1] };
-  m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
+  m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
   m = /^\s*([-*])\s+(.+)$/.exec(line);

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:26:7
   let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
   if (m) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
-  if (m) return { text: m[2], url: m[2], marker: m[1] };
+  if (true) return { text: m[2], url: m[2], marker: m[1] };
   m = /^\s*([-*])\s+(.+)$/.exec(line);
   if (m) return { text: m[2], marker: m[1] };
killedBy: serializeAdr — byte-stable round trip reproduces UNSTRUCTURED_REFERENCES exactly
statusReason: Cannot read properties of null (reading '2')

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:26:7
   let m = /^\s*([-*])\s+\[([^\]]+)]\(([^)]+)\)\s*$/.exec(line);
   if (m) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
-  if (m) return { text: m[2], url: m[2], marker: m[1] };
+  if (false) return { text: m[2], url: m[2], marker: m[1] };
   m = /^\s*([-*])\s+(.+)$/.exec(line);
   if (m) return { text: m[2], marker: m[1] };
killedBy: serializeAdr — byte-stable round trip normalizes a bare angle-bracketed URL reference to a clean markdown link, per the serialize contract, instead of corrupting it with embedded brackets
statusReason: expected '# ADR-0012: Angle-bracket bare URL re…' to contain '- [https://example.com/foo](https://e…'

[Survived] Regex
packages/adr-kit/src/parse.ts:27:7
   if (m) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
-  m = /^\s*([-*])\s+(.+)$/.exec(line);
+  m = /^\s([-*])\s+(.+)$/.exec(line);
   if (m) return { text: m[2], marker: m[1] };
   return undefined;

[Survived] Regex
packages/adr-kit/src/parse.ts:27:7
   if (m) return { text: m[2], url: m[3], marker: m[1] };
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
-  m = /^\s*([-*])\s+(.+)$/.exec(line);
+  m = /^\S*([-*])\s+(.+)$/.exec(line);
   if (m) return { text: m[2], marker: m[1] };
   return undefined;

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:28:7
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
   m = /^\s*([-*])\s+(.+)$/.exec(line);
-  if (m) return { text: m[2], marker: m[1] };
+  if (true) return { text: m[2], marker: m[1] };
   return undefined;
 }
killedBy: serializeAdr — byte-stable round trip reproduces UNSTRUCTURED_REFERENCES exactly
statusReason: Cannot read properties of null (reading '2')

[Survived] ConditionalExpression
packages/adr-kit/src/parse.ts:28:7
   m = /^\s*([-*])\s+<?(https?:\/\/[^\s>]+)>?\s*$/.exec(line);
   if (m) return { text: m[2], url: m[2], marker: m[1] };
   m = /^\s*([-*])\s+(.+)$/.exec(line);
-  if (m) return { text: m[2], marker: m[1] };
+  if (false) return { text: m[2], marker: m[1] };
   return undefined;
 }

[Killed] StringLiteral
packages/adr-kit/src/parse.ts:38:46
 }
 
 function parseInternal(source: string, options?: { filename?: string }): ParseInternalResult {
-  const eol: '\n' | '\r\n' = source.includes('\r\n') ? '\r\n' : '\n';
+  const eol: '\n' | '\r\n' = source.includes("") ? '\r\n' : '\n';
   const trailingNewline = source.endsWith('\n');
   const lines = source.split(/\r?\n/);
killedBy: inferConvention infers the Nygard convention from ACCEPTED_NYGARD
statusReason: expected '\r\n' to be '\n' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/parse.ts:39:27
 
 function parseInternal(source: string, options?: { filename?: string }): ParseInternalResult {
   const eol: '\n' | '\r\n' = source.includes('\r\n') ? '\r\n' : '\n';
-  const trailingNewline = source.endsWith('\n');
+  const trailingNewline = source.startsWith('\n');
   const lines = source.split(/\r?\n/);
 
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:44:27
 
   let idx = 0;
   let frontmatter: Record<string, string> | undefined;
-  if (lines[0] === '---') {
-    frontmatter = {};
-    idx = 1;
-    while (idx < lines.length && lines[idx] !== '---') {
-      const line = lines[idx];
-      const colon = line.indexOf(':');
-      if (colon !== -1 && line.trim() !== '') {
-        const key = line.slice(0, colon).trim().toLowerCase();
-        const value = line.slice(colon + 1).trim();
-        frontmatter[key] = value;
-      }
-      idx++;
-    }
-    idx++; // skip the closing '---'
-  }
+  if (lines[0] === '---') {}
 
   while (idx < lines.length && !/^#\s+/.test(lines[idx])) idx++;
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '# Use fixture-based testing for the A…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:44:7
 
   let idx = 0;
   let frontmatter: Record<string, string> | undefined;
-  if (lines[0] === '---') {
+  if (lines[0] !== '---') {
     frontmatter = {};
     idx = 1;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: adr has no H1 title

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:47:34
   if (lines[0] === '---') {
     frontmatter = {};
     idx = 1;
-    while (idx < lines.length && lines[idx] !== '---') {
+    while (idx < lines.length && true) {
       const line = lines[idx];
       const colon = line.indexOf(':');
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: adr has no H1 title

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:47:34
   if (lines[0] === '---') {
     frontmatter = {};
     idx = 1;
-    while (idx < lines.length && lines[idx] !== '---') {
+    while (idx < lines.length && lines[idx] === '---') {
       const line = lines[idx];
       const colon = line.indexOf(':');
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected '' to be 'accepted' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:50:11
     while (idx < lines.length && lines[idx] !== '---') {
       const line = lines[idx];
       const colon = line.indexOf(':');
-      if (colon !== -1 && line.trim() !== '') {
+      if (colon === -1 && line.trim() !== '') {
         const key = line.slice(0, colon).trim().toLowerCase();
         const value = line.slice(colon + 1).trim();
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\n---\n\n# Use fixture-based testi…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:50:47
     while (idx < lines.length && lines[idx] !== '---') {
       const line = lines[idx];
       const colon = line.indexOf(':');
-      if (colon !== -1 && line.trim() !== '') {
-        const key = line.slice(0, colon).trim().toLowerCase();
-        const value = line.slice(colon + 1).trim();
-        frontmatter[key] = value;
-      }
+      if (colon !== -1 && line.trim() !== '') {}
       idx++;
     }
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\n---\n\n# Use fixture-based testi…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/parse.ts:51:21
       const line = lines[idx];
       const colon = line.indexOf(':');
       if (colon !== -1 && line.trim() !== '') {
-        const key = line.slice(0, colon).trim().toLowerCase();
+        const key = line.slice(0, colon).trim().toUpperCase();
         const value = line.slice(colon + 1).trim();
         frontmatter[key] = value;
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected '' to be 'accepted' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/parse.ts:51:21
       const line = lines[idx];
       const colon = line.indexOf(':');
       if (colon !== -1 && line.trim() !== '') {
-        const key = line.slice(0, colon).trim().toLowerCase();
+        const key = line.trim().toLowerCase();
         const value = line.slice(colon + 1).trim();
         frontmatter[key] = value;
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected '' to be 'accepted' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/parse.ts:52:23
       const colon = line.indexOf(':');
       if (colon !== -1 && line.trim() !== '') {
         const key = line.slice(0, colon).trim().toLowerCase();
-        const value = line.slice(colon + 1).trim();
+        const value = line.trim();
         frontmatter[key] = value;
       }
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected 'status: accepted' to be 'accepted' // Object.is equality

[Killed] ArithmeticOperator
packages/adr-kit/src/parse.ts:52:34
       const colon = line.indexOf(':');
       if (colon !== -1 && line.trim() !== '') {
         const key = line.slice(0, colon).trim().toLowerCase();
-        const value = line.slice(colon + 1).trim();
+        const value = line.slice(colon - 1).trim();
         frontmatter[key] = value;
       }
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected 's: accepted' to be 'accepted' // Object.is equality

[Killed] UpdateOperator
packages/adr-kit/src/parse.ts:55:7
         const value = line.slice(colon + 1).trim();
         frontmatter[key] = value;
       }
-      idx++;
+      idx--;
     }
     idx++; // skip the closing '---'
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected '' to be '2026-07-16' // Object.is equality

[Survived] UpdateOperator
packages/adr-kit/src/parse.ts:57:5
       }
       idx++;
     }
-    idx++; // skip the closing '---'
+    idx--; // skip the closing '---'
   }
 

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:60:10
     idx++; // skip the closing '---'
   }
 
-  while (idx < lines.length && !/^#\s+/.test(lines[idx])) idx++;
+  while (idx >= lines.length && !/^#\s+/.test(lines[idx])) idx++;
   if (idx >= lines.length) throw new AdrKitError('adr has no H1 title', 'parse');
   const h1 = lines[idx];
killedBy: parseAdr — leniency and edge cases throws AdrKitError with code parse when there is no H1
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:60:32
     idx++; // skip the closing '---'
   }
 
-  while (idx < lines.length && !/^#\s+/.test(lines[idx])) idx++;
+  while (idx < lines.length && /^#\s+/.test(lines[idx])) idx++;
   if (idx >= lines.length) throw new AdrKitError('adr has no H1 title', 'parse');
   const h1 = lines[idx];
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be 1 // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:61:7
   }
 
   while (idx < lines.length && !/^#\s+/.test(lines[idx])) idx++;
-  if (idx >= lines.length) throw new AdrKitError('adr has no H1 title', 'parse');
+  if (idx < lines.length) throw new AdrKitError('adr has no H1 title', 'parse');
   const h1 = lines[idx];
   idx++;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: adr has no H1 title

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:61:7
   }
 
   while (idx < lines.length && !/^#\s+/.test(lines[idx])) idx++;
-  if (idx >= lines.length) throw new AdrKitError('adr has no H1 title', 'parse');
+  if (true) throw new AdrKitError('adr has no H1 title', 'parse');
   const h1 = lines[idx];
   idx++;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: adr has no H1 title

[Survived] UpdateOperator
packages/adr-kit/src/parse.ts:63:3
   while (idx < lines.length && !/^#\s+/.test(lines[idx])) idx++;
   if (idx >= lines.length) throw new AdrKitError('adr has no H1 title', 'parse');
   const h1 = lines[idx];
-  idx++;
+  idx--;
 
   let number: number | undefined;

[Survived] StringLiteral
packages/adr-kit/src/parse.ts:66:15
   idx++;
 
   let number: number | undefined;
-  let title = '';
+  let title = "Stryker was here!";
   let titleStyle: AdrConvention['titleStyle'] = 'plain';
   let numberWidth = NYGARD_CONVENTION.numberWidth;

[Survived] StringLiteral
packages/adr-kit/src/parse.ts:67:49
 
   let number: number | undefined;
   let title = '';
-  let titleStyle: AdrConvention['titleStyle'] = 'plain';
+  let titleStyle: AdrConvention['titleStyle'] = "";
   let numberWidth = NYGARD_CONVENTION.numberWidth;
 

[Killed] Regex
packages/adr-kit/src/parse.ts:70:11
   let titleStyle: AdrConvention['titleStyle'] = 'plain';
   let numberWidth = NYGARD_CONVENTION.numberWidth;
 
-  let m = /^#\s+ADR[-\s]?(\d+)\s*[:.—-]\s*(.+)$/i.exec(h1);
+  let m = /^#\s+ADR[-\s]?(\d)\s*[:.—-]\s*(.+)$/i.exec(h1);
   if (m) {
     number = Number(m[1]);
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be 1 // Object.is equality

[Killed] Regex
packages/adr-kit/src/parse.ts:70:11
   let titleStyle: AdrConvention['titleStyle'] = 'plain';
   let numberWidth = NYGARD_CONVENTION.numberWidth;
 
-  let m = /^#\s+ADR[-\s]?(\d+)\s*[:.—-]\s*(.+)$/i.exec(h1);
+  let m = /^#\s+ADR[^-\s]?(\d+)\s*[:.—-]\s*(.+)$/i.exec(h1);
   if (m) {
     number = Number(m[1]);
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:71:7
   let numberWidth = NYGARD_CONVENTION.numberWidth;
 
   let m = /^#\s+ADR[-\s]?(\d+)\s*[:.—-]\s*(.+)$/i.exec(h1);
-  if (m) {
+  if (false) {
     number = Number(m[1]);
     title = m[2];
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:71:10
   let numberWidth = NYGARD_CONVENTION.numberWidth;
 
   let m = /^#\s+ADR[-\s]?(\d+)\s*[:.—-]\s*(.+)$/i.exec(h1);
-  if (m) {
-    number = Number(m[1]);
-    title = m[2];
-    titleStyle = 'adr-prefix';
-    numberWidth = m[1].length;
-  } else if ((m = /^#\s+(\d+)\.\s*(.+)$/.exec(h1))) {
+  if (m) {} else if ((m = /^#\s+(\d+)\.\s*(.+)$/.exec(h1))) {
     number = Number(m[1]);
     title = m[2];
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:76:15
     title = m[2];
     titleStyle = 'adr-prefix';
     numberWidth = m[1].length;
-  } else if ((m = /^#\s+(\d+)\.\s*(.+)$/.exec(h1))) {
+  } else if ((false)) {
     number = Number(m[1]);
     title = m[2];
killedBy: parseAdr — CLASSIC_NYGARD reads the number from the numbered-dot H1, status from its section, and date from the bare preamble line
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:76:53
     title = m[2];
     titleStyle = 'adr-prefix';
     numberWidth = m[1].length;
-  } else if ((m = /^#\s+(\d+)\.\s*(.+)$/.exec(h1))) {
-    number = Number(m[1]);
-    title = m[2];
-    titleStyle = 'numbered-dot';
-  } else {
+  } else if ((m = /^#\s+(\d+)\.\s*(.+)$/.exec(h1))) {} else {
     m = /^#\s+(.+)$/.exec(h1);
     title = m ? m[1] : '';
killedBy: parseAdr — CLASSIC_NYGARD reads the number from the numbered-dot H1, status from its section, and date from the bare preamble line
statusReason: expected undefined to be 1 // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/parse.ts:79:18
   } else if ((m = /^#\s+(\d+)\.\s*(.+)$/.exec(h1))) {
     number = Number(m[1]);
     title = m[2];
-    titleStyle = 'numbered-dot';
+    titleStyle = "";
   } else {
     m = /^#\s+(.+)$/.exec(h1);
killedBy: inferConvention infers the numbered-dot / sections style from CLASSIC_NYGARD
statusReason: expected '' to be 'numbered-dot' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:80:10
     number = Number(m[1]);
     title = m[2];
     titleStyle = 'numbered-dot';
-  } else {
-    m = /^#\s+(.+)$/.exec(h1);
-    title = m ? m[1] : '';
-    titleStyle = 'plain';
-  }
+  } else {}
   if (number === undefined) {
     number = adrNumberFromFilename(options?.filename ?? '');
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\ndate: 2026-07-…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] Regex
packages/adr-kit/src/parse.ts:81:9
     title = m[2];
     titleStyle = 'numbered-dot';
   } else {
-    m = /^#\s+(.+)$/.exec(h1);
+    m = /^#\s+(.)$/.exec(h1);
     title = m ? m[1] : '';
     titleStyle = 'plain';
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\ndate: 2026-07-…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] Regex
packages/adr-kit/src/parse.ts:81:9
     title = m[2];
     titleStyle = 'numbered-dot';
   } else {
-    m = /^#\s+(.+)$/.exec(h1);
+    m = /^#\S+(.+)$/.exec(h1);
     title = m ? m[1] : '';
     titleStyle = 'plain';
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\ndate: 2026-07-…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:85:7
     title = m ? m[1] : '';
     titleStyle = 'plain';
   }
-  if (number === undefined) {
+  if (number !== undefined) {
     number = adrNumberFromFilename(options?.filename ?? '');
   }
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:85:29
     title = m ? m[1] : '';
     titleStyle = 'plain';
   }
-  if (number === undefined) {
-    number = adrNumberFromFilename(options?.filename ?? '');
-  }
+  if (number === undefined) {}
 
   const preambleLines: string[] = [];
killedBy: parseAdr — leniency and edge cases falls back to the filename for the number when the H1 carries none
statusReason: expected undefined to be 42 // Object.is equality

[Killed] LogicalOperator
packages/adr-kit/src/parse.ts:86:36
     titleStyle = 'plain';
   }
   if (number === undefined) {
-    number = adrNumberFromFilename(options?.filename ?? '');
+    number = adrNumberFromFilename(options?.filename && '');
   }
 
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] OptionalChaining
packages/adr-kit/src/parse.ts:86:36
     titleStyle = 'plain';
   }
   if (number === undefined) {
-    number = adrNumberFromFilename(options?.filename ?? '');
+    number = adrNumberFromFilename(options.filename ?? '');
   }
 
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: Cannot read properties of undefined (reading 'filename')

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:90:32
   }
 
   const preambleLines: string[] = [];
-  while (idx < lines.length && !/^##\s+/.test(lines[idx])) {
+  while (idx < lines.length && /^##\s+/.test(lines[idx])) {
     preambleLines.push(lines[idx]);
     idx++;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:90:10
   }
 
   const preambleLines: string[] = [];
-  while (idx < lines.length && !/^##\s+/.test(lines[idx])) {
+  while (idx >= lines.length && !/^##\s+/.test(lines[idx])) {
     preambleLines.push(lines[idx]);
     idx++;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected '' to be 'Accepted' // Object.is equality

[Killed] CallExpression
packages/adr-kit/src/parse.ts:91:5
 
   const preambleLines: string[] = [];
   while (idx < lines.length && !/^##\s+/.test(lines[idx])) {
-    preambleLines.push(lines[idx]);
+    ;
     idx++;
   }
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected '' to be 'Accepted' // Object.is equality

[Timeout] UpdateOperator
packages/adr-kit/src/parse.ts:92:5
   const preambleLines: string[] = [];
   while (idx < lines.length && !/^##\s+/.test(lines[idx])) {
     preambleLines.push(lines[idx]);
-    idx++;
+    idx--;
   }
 

[Killed] LogicalOperator
packages/adr-kit/src/parse.ts:95:16
     idx++;
   }
 
-  let status = frontmatter?.status ?? '';
+  let status = frontmatter?.status && '';
   let date = frontmatter?.date ?? '';
   let metaBullet = '- ';
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected '' to be 'accepted' // Object.is equality

[Killed] OptionalChaining
packages/adr-kit/src/parse.ts:95:16
     idx++;
   }
 
-  let status = frontmatter?.status ?? '';
+  let status = frontmatter.status ?? '';
   let date = frontmatter?.date ?? '';
   let metaBullet = '- ';
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of undefined (reading 'status')
