[Killed] LogicalOperator
packages/adr-kit/src/parse.ts:96:14
   }
 
   let status = frontmatter?.status ?? '';
-  let date = frontmatter?.date ?? '';
+  let date = frontmatter?.date && '';
   let metaBullet = '- ';
   let sawPreambleStatus = false;
killedBy: parseAdr — MADR reads status/date from frontmatter and maps MADR section names
statusReason: expected '' to be '2026-07-16' // Object.is equality

[Killed] OptionalChaining
packages/adr-kit/src/parse.ts:96:14
   }
 
   let status = frontmatter?.status ?? '';
-  let date = frontmatter?.date ?? '';
+  let date = frontmatter.date ?? '';
   let metaBullet = '- ';
   let sawPreambleStatus = false;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of undefined (reading 'date')

[Survived] StringLiteral
packages/adr-kit/src/parse.ts:97:20
 
   let status = frontmatter?.status ?? '';
   let date = frontmatter?.date ?? '';
-  let metaBullet = '- ';
+  let metaBullet = "";
   let sawPreambleStatus = false;
   for (const line of preambleLines) {

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:98:27
   let status = frontmatter?.status ?? '';
   let date = frontmatter?.date ?? '';
   let metaBullet = '- ';
-  let sawPreambleStatus = false;
+  let sawPreambleStatus = true;
   for (const line of preambleLines) {
     const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
killedBy: inferConvention infers the numbered-dot / sections style from CLASSIC_NYGARD
statusReason: expected 'bullet-list' to be 'sections' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:99:37
   let date = frontmatter?.date ?? '';
   let metaBullet = '- ';
   let sawPreambleStatus = false;
-  for (const line of preambleLines) {
-    const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
-    if (!pm) continue;
-    const bullet = pm[1] ?? '';
-    const label = pm[2].toLowerCase();
-    const value = pm[3].trim();
-    if (label === 'status' && !frontmatter) {
-      status = value;
-      metaBullet = bullet;
-      sawPreambleStatus = true;
-    } else if (label === 'date' && !frontmatter) {
-      date = value;
-      metaBullet = bullet;
-    }
-  }
+  for (const line of preambleLines) {}
 
   const sections: ParsedSection[] = [];
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] Regex
packages/adr-kit/src/parse.ts:100:16
   let metaBullet = '- ';
   let sawPreambleStatus = false;
   for (const line of preambleLines) {
-    const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
+    const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.)$/i.exec(line);
     if (!pm) continue;
     const bullet = pm[1] ?? '';
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected '' to be 'Accepted' // Object.is equality

[Survived] Regex
packages/adr-kit/src/parse.ts:100:16
   let metaBullet = '- ';
   let sawPreambleStatus = false;
   for (const line of preambleLines) {
-    const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
+    const pm = /^(-\s+|\*\s)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
     if (!pm) continue;
     const bullet = pm[1] ?? '';

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:101:9
   let sawPreambleStatus = false;
   for (const line of preambleLines) {
     const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
-    if (!pm) continue;
+    if (true) continue;
     const bullet = pm[1] ?? '';
     const label = pm[2].toLowerCase();
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:101:9
   let sawPreambleStatus = false;
   for (const line of preambleLines) {
     const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
-    if (!pm) continue;
+    if (pm) continue;
     const bullet = pm[1] ?? '';
     const label = pm[2].toLowerCase();
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of null (reading '1')

[Killed] LogicalOperator
packages/adr-kit/src/parse.ts:102:20
   for (const line of preambleLines) {
     const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
     if (!pm) continue;
-    const bullet = pm[1] ?? '';
+    const bullet = pm[1] && '';
     const label = pm[2].toLowerCase();
     const value = pm[3].trim();
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] MethodExpression
packages/adr-kit/src/parse.ts:103:19
     const pm = /^(-\s+|\*\s+)?(Status|Date)\s*:\s*(.*)$/i.exec(line);
     if (!pm) continue;
     const bullet = pm[1] ?? '';
-    const label = pm[2].toLowerCase();
+    const label = pm[2].toUpperCase();
     const value = pm[3].trim();
     if (label === 'status' && !frontmatter) {
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected '' to be 'Accepted' // Object.is equality

[Survived] MethodExpression
packages/adr-kit/src/parse.ts:104:19
     if (!pm) continue;
     const bullet = pm[1] ?? '';
     const label = pm[2].toLowerCase();
-    const value = pm[3].trim();
+    const value = pm[3];
     if (label === 'status' && !frontmatter) {
       status = value;

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:105:9
     const bullet = pm[1] ?? '';
     const label = pm[2].toLowerCase();
     const value = pm[3].trim();
-    if (label === 'status' && !frontmatter) {
+    if (true) {
       status = value;
       metaBullet = bullet;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:105:9
     const bullet = pm[1] ?? '';
     const label = pm[2].toLowerCase();
     const value = pm[3].trim();
-    if (label === 'status' && !frontmatter) {
+    if (true && !frontmatter) {
       status = value;
       metaBullet = bullet;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Survived] BooleanLiteral
packages/adr-kit/src/parse.ts:108:27
     if (label === 'status' && !frontmatter) {
       status = value;
       metaBullet = bullet;
-      sawPreambleStatus = true;
+      sawPreambleStatus = false;
     } else if (label === 'date' && !frontmatter) {
       date = value;

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:109:16
       status = value;
       metaBullet = bullet;
       sawPreambleStatus = true;
-    } else if (label === 'date' && !frontmatter) {
+    } else if (label !== 'date' && !frontmatter) {
       date = value;
       metaBullet = bullet;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:109:36
       status = value;
       metaBullet = bullet;
       sawPreambleStatus = true;
-    } else if (label === 'date' && !frontmatter) {
+    } else if (label === 'date' && frontmatter) {
       date = value;
       metaBullet = bullet;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected '' to be '2026-07-16' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:117:40
 
   const sections: ParsedSection[] = [];
   let current: { heading: string; headingMarker: string; bodyLines: string[] } | undefined;
-  for (const line of lines.slice(idx)) {
-    const hm = /^(#{2,6})\s+(.+)$/.exec(line);
-    if (hm) {
-      if (current)
-        sections.push({
-          heading: current.heading,
-          headingMarker: current.headingMarker,
-          body: trimBlankEdges(current.bodyLines),
-        });
-      current = { heading: hm[2], headingMarker: `${hm[1]} `, bodyLines: [] };
-    } else if (current) {
-      current.bodyLines.push(line);
-    }
-  }
+  for (const line of lines.slice(idx)) {}
   if (current)
     sections.push({
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
packages/adr-kit/src/parse.ts:117:22
 
   const sections: ParsedSection[] = [];
   let current: { heading: string; headingMarker: string; bodyLines: string[] } | undefined;
-  for (const line of lines.slice(idx)) {
+  for (const line of lines) {
     const hm = /^(#{2,6})\s+(.+)$/.exec(line);
     if (hm) {

[Killed] Regex
packages/adr-kit/src/parse.ts:118:16
   const sections: ParsedSection[] = [];
   let current: { heading: string; headingMarker: string; bodyLines: string[] } | undefined;
   for (const line of lines.slice(idx)) {
-    const hm = /^(#{2,6})\s+(.+)$/.exec(line);
+    const hm = /^(#{2,6})\s+(.)$/.exec(line);
     if (hm) {
       if (current)
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Survived] Regex
packages/adr-kit/src/parse.ts:118:16
   const sections: ParsedSection[] = [];
   let current: { heading: string; headingMarker: string; bodyLines: string[] } | undefined;
   for (const line of lines.slice(idx)) {
-    const hm = /^(#{2,6})\s+(.+)$/.exec(line);
+    const hm = /^(#{2,6})\s(.+)$/.exec(line);
     if (hm) {
       if (current)

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:119:9
   let current: { heading: string; headingMarker: string; bodyLines: string[] } | undefined;
   for (const line of lines.slice(idx)) {
     const hm = /^(#{2,6})\s+(.+)$/.exec(line);
-    if (hm) {
+    if (false) {
       if (current)
         sections.push({
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:119:9
   let current: { heading: string; headingMarker: string; bodyLines: string[] } | undefined;
   for (const line of lines.slice(idx)) {
     const hm = /^(#{2,6})\s+(.+)$/.exec(line);
-    if (hm) {
+    if (true) {
       if (current)
         sections.push({
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of null (reading '2')

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:120:11
   for (const line of lines.slice(idx)) {
     const hm = /^(#{2,6})\s+(.+)$/.exec(line);
     if (hm) {
-      if (current)
+      if (true)
         sections.push({
           heading: current.heading,
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of undefined (reading 'heading')

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:120:11
   for (const line of lines.slice(idx)) {
     const hm = /^(#{2,6})\s+(.+)$/.exec(line);
     if (hm) {
-      if (current)
+      if (false)
         sections.push({
           heading: current.heading,
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/parse.ts:126:50
           headingMarker: current.headingMarker,
           body: trimBlankEdges(current.bodyLines),
         });
-      current = { heading: hm[2], headingMarker: `${hm[1]} `, bodyLines: [] };
+      current = { heading: hm[2], headingMarker: ``, bodyLines: [] };
     } else if (current) {
       current.bodyLines.push(line);
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:127:25
           body: trimBlankEdges(current.bodyLines),
         });
       current = { heading: hm[2], headingMarker: `${hm[1]} `, bodyLines: [] };
-    } else if (current) {
-      current.bodyLines.push(line);
-    }
+    } else if (current) {}
   }
   if (current)
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:127:16
           body: trimBlankEdges(current.bodyLines),
         });
       current = { heading: hm[2], headingMarker: `${hm[1]} `, bodyLines: [] };
-    } else if (current) {
+    } else if (false) {
       current.bodyLines.push(line);
     }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] CallExpression
packages/adr-kit/src/parse.ts:128:7
         });
       current = { heading: hm[2], headingMarker: `${hm[1]} `, bodyLines: [] };
     } else if (current) {
-      current.bodyLines.push(line);
+      ;
     }
   }
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:131:7
       current.bodyLines.push(line);
     }
   }
-  if (current)
+  if (false)
     sections.push({
       heading: current.heading,
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:131:7
       current.bodyLines.push(line);
     }
   }
-  if (current)
+  if (true)
     sections.push({
       heading: current.heading,
killedBy: parseAdr — leniency and edge cases parses a title-only document leniently
statusReason: Cannot read properties of undefined (reading 'heading')

[Killed] ObjectLiteral
packages/adr-kit/src/parse.ts:132:19
     }
   }
   if (current)
-    sections.push({
-      heading: current.heading,
-      headingMarker: current.headingMarker,
-      body: trimBlankEdges(current.bodyLines),
-    });
+    sections.push({});
 
   let context = '';
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ArrayDeclaration
packages/adr-kit/src/parse.ts:143:62
   let consequences = '';
   let references: AdrReference[] = [];
   const sectionOrder: string[] = [];
-  const extraSections: { heading: string; body: string }[] = [];
+  const extraSections: { heading: string; body: string }[] = ["Stryker was here"];
   let headingPrefix = NYGARD_CONVENTION.headingPrefix;
   let metaStyle: AdrConvention['metaStyle'] = frontmatter ? 'frontmatter' : 'bullet-list';
killedBy: parseAdr — WITH_EXTRA_SECTION preserves an unrecognised heading in extraSections and sectionOrder
statusReason: expected [ 'Stryker was here', { …(2) } ] to have a length of 1 but got 2

[Killed] CallExpression
packages/adr-kit/src/parse.ts:153:5
   const assignedFields = new Set<KnownField>();
 
   for (const section of sections) {
-    sectionOrder.push(section.heading);
+    ;
     headingPrefix = section.headingMarker;
     const field = matchKnownField(section.heading);
killedBy: parseAdr — WITH_EXTRA_SECTION preserves an unrecognised heading in extraSections and sectionOrder
statusReason: expected [] to include 'Alternatives Considered'

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:156:9
     sectionOrder.push(section.heading);
     headingPrefix = section.headingMarker;
     const field = matchKnownField(section.heading);
-    if (field && !assignedFields.has(field)) {
+    if (true) {
       if (field === 'status') {
         labels.status = section.heading;
killedBy: serializeAdr — byte-stable round trip reproduces MADR_WITH_DECISION_DRIVERS exactly
statusReason: expected '---\nstatus: accepted\ndate: 2026-07-…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:156:9
     sectionOrder.push(section.heading);
     headingPrefix = section.headingMarker;
     const field = matchKnownField(section.heading);
-    if (field && !assignedFields.has(field)) {
+    if (false) {
       if (field === 'status') {
         labels.status = section.heading;
killedBy: serializeAdr — byte-stable round trip normalizes a bare angle-bracketed URL reference to a clean markdown link, per the serialize contract, instead of corrupting it with embedded brackets
statusReason: expected '# ADR-0012: Angle-bracket bare URL re…' to contain '- [https://example.com/foo](https://e…'

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:157:11
     headingPrefix = section.headingMarker;
     const field = matchKnownField(section.heading);
     if (field && !assignedFields.has(field)) {
-      if (field === 'status') {
+      if (false) {
         labels.status = section.heading;
         if (!status) status = section.body;
killedBy: parseAdr — CLASSIC_NYGARD reads the number from the numbered-dot H1, status from its section, and date from the bare preamble line
statusReason: expected '' to be 'Accepted' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:157:31
     headingPrefix = section.headingMarker;
     const field = matchKnownField(section.heading);
     if (field && !assignedFields.has(field)) {
-      if (field === 'status') {
-        labels.status = section.heading;
-        if (!status) status = section.body;
-        if (!sawPreambleStatus && !frontmatter) metaStyle = 'sections';
-        assignedFields.add('status');
-        continue;
-      }
+      if (field === 'status') {}
       if (field === 'date') {
         labels.date = section.heading;
killedBy: parseAdr — CLASSIC_NYGARD reads the number from the numbered-dot H1, status from its section, and date from the bare preamble line
statusReason: expected '' to be 'Accepted' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:159:13
     if (field && !assignedFields.has(field)) {
       if (field === 'status') {
         labels.status = section.heading;
-        if (!status) status = section.body;
+        if (false) status = section.body;
         if (!sawPreambleStatus && !frontmatter) metaStyle = 'sections';
         assignedFields.add('status');
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:159:13
     if (field && !assignedFields.has(field)) {
       if (field === 'status') {
         labels.status = section.heading;
-        if (!status) status = section.body;
+        if (status) status = section.body;
         if (!sawPreambleStatus && !frontmatter) metaStyle = 'sections';
         assignedFields.add('status');
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:160:35
       if (field === 'status') {
         labels.status = section.heading;
         if (!status) status = section.body;
-        if (!sawPreambleStatus && !frontmatter) metaStyle = 'sections';
+        if (!sawPreambleStatus && frontmatter) metaStyle = 'sections';
         assignedFields.add('status');
         continue;
killedBy: inferConvention infers the numbered-dot / sections style from CLASSIC_NYGARD
statusReason: expected 'bullet-list' to be 'sections' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:160:13
       if (field === 'status') {
         labels.status = section.heading;
         if (!status) status = section.body;
-        if (!sawPreambleStatus && !frontmatter) metaStyle = 'sections';
+        if (sawPreambleStatus && !frontmatter) metaStyle = 'sections';
         assignedFields.add('status');
         continue;
killedBy: inferConvention infers the numbered-dot / sections style from CLASSIC_NYGARD
statusReason: expected 'bullet-list' to be 'sections' // Object.is equality

[Survived] StringLiteral
packages/adr-kit/src/parse.ts:161:28
         labels.status = section.heading;
         if (!status) status = section.body;
         if (!sawPreambleStatus && !frontmatter) metaStyle = 'sections';
-        assignedFields.add('status');
+        assignedFields.add("");
         continue;
       }

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:164:11
         assignedFields.add('status');
         continue;
       }
-      if (field === 'date') {
+      if (field !== 'date') {
         labels.date = section.heading;
         if (!date) date = section.body;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
packages/adr-kit/src/parse.ts:164:29
         assignedFields.add('status');
         continue;
       }
-      if (field === 'date') {
-        labels.date = section.heading;
-        if (!date) date = section.body;
-        assignedFields.add('date');
-        continue;
-      }
+      if (field === 'date') {}
       if (field === 'context') {
         labels.context = section.heading;
killedBy: parseAdr — Date as its own section reads the date from a ## Date section when the document splits Status and Date into sections
statusReason: expected '' to be '2026-07-16' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/parse.ts:166:13
       }
       if (field === 'date') {
         labels.date = section.heading;
-        if (!date) date = section.body;
+        if (date) date = section.body;
         assignedFields.add('date');
         continue;
killedBy: parseAdr — Date as its own section reads the date from a ## Date section when the document splits Status and Date into sections
statusReason: expected '' to be '2026-07-16' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:166:13
       }
       if (field === 'date') {
         labels.date = section.heading;
-        if (!date) date = section.body;
+        if (false) date = section.body;
         assignedFields.add('date');
         continue;
killedBy: parseAdr — Date as its own section reads the date from a ## Date section when the document splits Status and Date into sections
statusReason: expected '' to be '2026-07-16' // Object.is equality

[Survived] StringLiteral
packages/adr-kit/src/parse.ts:167:28
       if (field === 'date') {
         labels.date = section.heading;
         if (!date) date = section.body;
-        assignedFields.add('date');
+        assignedFields.add("");
         continue;
       }

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:170:11
         assignedFields.add('date');
         continue;
       }
-      if (field === 'context') {
+      if (true) {
         labels.context = section.heading;
         context = section.body;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:170:11
         assignedFields.add('date');
         continue;
       }
-      if (field === 'context') {
+      if (field !== 'context') {
         labels.context = section.heading;
         context = section.body;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:176:11
         assignedFields.add('context');
         continue;
       }
-      if (field === 'decision') {
+      if (true) {
         labels.decision = section.heading;
         decision = section.body;
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:176:11
         assignedFields.add('context');
         continue;
       }
-      if (field === 'decision') {
+      if (false) {
         labels.decision = section.heading;
         decision = section.body;
killedBy: serializeAdr — byte-stable round trip keeps Decision Drivers and Decision Outcome distinct instead of one clobbering the other
statusReason: expected '' to be 'Chosen option: A.' // Object.is equality

[Survived] StringLiteral
packages/adr-kit/src/parse.ts:179:28
       if (field === 'decision') {
         labels.decision = section.heading;
         decision = section.body;
-        assignedFields.add('decision');
+        assignedFields.add("");
         continue;
       }

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:182:11
         assignedFields.add('decision');
         continue;
       }
-      if (field === 'consequences') {
+      if (true) {
         labels.consequences = section.heading;
         consequences = section.body;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:182:11
         assignedFields.add('decision');
         continue;
       }
-      if (field === 'consequences') {
+      if (field !== 'consequences') {
         labels.consequences = section.heading;
         consequences = section.body;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:189:25
         continue;
       }
       // field === 'references'
-      const bodyLines = section.body === '' ? [] : section.body.split('\n');
+      const bodyLines = section.body !== '' ? [] : section.body.split('\n');
       const nonBlank = bodyLines.filter((line) => line.trim() !== '');
       const parsedRefs = nonBlank.map(parseReferenceLine);
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:189:25
         continue;
       }
       // field === 'references'
-      const bodyLines = section.body === '' ? [] : section.body.split('\n');
+      const bodyLines = true ? [] : section.body.split('\n');
       const nonBlank = bodyLines.filter((line) => line.trim() !== '');
       const parsedRefs = nonBlank.map(parseReferenceLine);
killedBy: serializeAdr — byte-stable round trip normalizes a bare angle-bracketed URL reference to a clean markdown link, per the serialize contract, instead of corrupting it with embedded brackets
statusReason: expected '# ADR-0012: Angle-bracket bare URL re…' to contain '- [https://example.com/foo](https://e…'

[Killed] ConditionalExpression
packages/adr-kit/src/parse.ts:190:51
       }
       // field === 'references'
       const bodyLines = section.body === '' ? [] : section.body.split('\n');
-      const nonBlank = bodyLines.filter((line) => line.trim() !== '');
+      const nonBlank = bodyLines.filter((line) => false);
       const parsedRefs = nonBlank.map(parseReferenceLine);
       if (nonBlank.length > 0 && parsedRefs.every((ref): ref is AdrReference => ref !== undefined)) {
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected [] to have a length of 2 but got +0

[Killed] EqualityOperator
packages/adr-kit/src/parse.ts:190:51
       }
       // field === 'references'
       const bodyLines = section.body === '' ? [] : section.body.split('\n');
-      const nonBlank = bodyLines.filter((line) => line.trim() !== '');
+      const nonBlank = bodyLines.filter((line) => line.trim() === '');
       const parsedRefs = nonBlank.map(parseReferenceLine);
       if (nonBlank.length > 0 && parsedRefs.every((ref): ref is AdrReference => ref !== undefined)) {
killedBy: parseAdr — ACCEPTED_NYGARD parses number, title, status, date, and non-empty sections
statusReason: expected [] to have a length of 2 but got +0
