[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:7:58
 import type { AdrConvention } from './convention.js';
 import { NYGARD_CONVENTION } from './convention.js';
 
-function padNumber(value: number, width: number): string {
-  return String(value).padStart(width, '0');
-}
+function padNumber(value: number, width: number): string {}
 
 function renderH1(adr: Adr, convention: AdrConvention): string {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-undefined: Use fixture ADRs to …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:11:64
   return String(value).padStart(width, '0');
 }
 
-function renderH1(adr: Adr, convention: AdrConvention): string {
-  if (convention.titleStyle === 'adr-prefix' && adr.number !== undefined) {
-    return `# ADR-${padNumber(adr.number, convention.numberWidth)}: ${adr.title}`;
-  }
-  if (convention.titleStyle === 'numbered-dot' && adr.number !== undefined) {
-    return `# ${adr.number}. ${adr.title}`;
-  }
-  return `# ${adr.title}`;
-}
+function renderH1(adr: Adr, convention: AdrConvention): string {}
 
 function renderReferences(references: readonly AdrReference[]): string {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '\n\n- Status: Accepted\n- Date: 2026-…' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:12:49
 }
 
 function renderH1(adr: Adr, convention: AdrConvention): string {
-  if (convention.titleStyle === 'adr-prefix' && adr.number !== undefined) {
+  if (convention.titleStyle === 'adr-prefix' && adr.number === undefined) {
     return `# ADR-${padNumber(adr.number, convention.numberWidth)}: ${adr.title}`;
   }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# Use fixture ADRs to test the kit\n\…' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] LogicalOperator
packages/adr-kit/src/serialize.ts:12:7
 }
 
 function renderH1(adr: Adr, convention: AdrConvention): string {
-  if (convention.titleStyle === 'adr-prefix' && adr.number !== undefined) {
+  if (convention.titleStyle === 'adr-prefix' || adr.number !== undefined) {
     return `# ADR-${padNumber(adr.number, convention.numberWidth)}: ${adr.title}`;
   }
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# ADR-0001: Record architecture decis…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:15:7
   if (convention.titleStyle === 'adr-prefix' && adr.number !== undefined) {
     return `# ADR-${padNumber(adr.number, convention.numberWidth)}: ${adr.title}`;
   }
-  if (convention.titleStyle === 'numbered-dot' && adr.number !== undefined) {
+  if (true) {
     return `# ${adr.number}. ${adr.title}`;
   }
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\ndate: 2026-07-…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:15:7
   if (convention.titleStyle === 'adr-prefix' && adr.number !== undefined) {
     return `# ADR-${padNumber(adr.number, convention.numberWidth)}: ${adr.title}`;
   }
-  if (convention.titleStyle === 'numbered-dot' && adr.number !== undefined) {
+  if (false) {
     return `# ${adr.number}. ${adr.title}`;
   }
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# Record architecture decisions\n\nDa…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:21:72
   return `# ${adr.title}`;
 }
 
-function renderReferences(references: readonly AdrReference[]): string {
-  return references
-    .map((ref) => (ref.url ? `${ref.marker} [${ref.text}](${ref.url})` : `${ref.marker} ${ref.text}`))
-    .join('\n');
-}
+function renderReferences(references: readonly AdrReference[]): string {}
 
 function renderSectionBlock(headingPrefix: string, heading: string, body: string): string {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/serialize.ts:23:10
 
 function renderReferences(references: readonly AdrReference[]): string {
   return references
-    .map((ref) => (ref.url ? `${ref.marker} [${ref.text}](${ref.url})` : `${ref.marker} ${ref.text}`))
+    .map(() => undefined)
     .join('\n');
 }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:23:30
 
 function renderReferences(references: readonly AdrReference[]): string {
   return references
-    .map((ref) => (ref.url ? `${ref.marker} [${ref.text}](${ref.url})` : `${ref.marker} ${ref.text}`))
+    .map((ref) => (ref.url ? `` : `${ref.marker} ${ref.text}`))
     .join('\n');
 }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:24:11
 function renderReferences(references: readonly AdrReference[]): string {
   return references
     .map((ref) => (ref.url ? `${ref.marker} [${ref.text}](${ref.url})` : `${ref.marker} ${ref.text}`))
-    .join('\n');
+    .join("");
 }
 
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:27:91
     .join('\n');
 }
 
-function renderSectionBlock(headingPrefix: string, heading: string, body: string): string {
-  return body === '' ? `${headingPrefix}${heading}` : `${headingPrefix}${heading}\n\n${body}`;
-}
+function renderSectionBlock(headingPrefix: string, heading: string, body: string): string {}
 
 function fieldBody(adr: Adr, field: KnownField): string {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:28:10
 }
 
 function renderSectionBlock(headingPrefix: string, heading: string, body: string): string {
-  return body === '' ? `${headingPrefix}${heading}` : `${headingPrefix}${heading}\n\n${body}`;
+  return true ? `${headingPrefix}${heading}` : `${headingPrefix}${heading}\n\n${body}`;
 }
 
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:28:10
 }
 
 function renderSectionBlock(headingPrefix: string, heading: string, body: string): string {
-  return body === '' ? `${headingPrefix}${heading}` : `${headingPrefix}${heading}\n\n${body}`;
+  return body !== '' ? `${headingPrefix}${heading}` : `${headingPrefix}${heading}\n\n${body}`;
 }
 
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:31:57
   return body === '' ? `${headingPrefix}${heading}` : `${headingPrefix}${heading}\n\n${body}`;
 }
 
-function fieldBody(adr: Adr, field: KnownField): string {
-  switch (field) {
-    case 'status':
-      return adr.status;
-    case 'date':
-      return adr.date;
-    case 'context':
-      return adr.context;
-    case 'decision':
-      return adr.decision;
-    case 'consequences':
-      return adr.consequences;
-    case 'references':
-      return renderReferences(adr.references);
-  }
-}
+function fieldBody(adr: Adr, field: KnownField): string {}
 
 export function serializeAdr(adr: Adr, convention: AdrConvention = NYGARD_CONVENTION): string {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:33:5
 
 function fieldBody(adr: Adr, field: KnownField): string {
   switch (field) {
-    case 'status':
-      return adr.status;
+    case 'status':
     case 'date':
       return adr.date;
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:33:10
 
 function fieldBody(adr: Adr, field: KnownField): string {
   switch (field) {
-    case 'status':
+    case "":
       return adr.status;
     case 'date':
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:35:5
   switch (field) {
     case 'status':
       return adr.status;
-    case 'date':
-      return adr.date;
+    case 'date':
     case 'context':
       return adr.context;
killedBy: serializeAdr — byte-stable round trip reproduces DATE_AS_SECTION exactly
statusReason: expected '# ADR-0010: Sections style with a Dat…' to be '# ADR-0010: Sections style with a Dat…' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:35:10
   switch (field) {
     case 'status':
       return adr.status;
-    case 'date':
+    case "":
       return adr.date;
     case 'context':
killedBy: serializeAdr — byte-stable round trip reproduces DATE_AS_SECTION exactly
statusReason: expected '# ADR-0010: Sections style with a Dat…' to be '# ADR-0010: Sections style with a Dat…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:37:5
       return adr.status;
     case 'date':
       return adr.date;
-    case 'context':
-      return adr.context;
+    case 'context':
     case 'decision':
       return adr.decision;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:39:5
       return adr.date;
     case 'context':
       return adr.context;
-    case 'decision':
-      return adr.decision;
+    case 'decision':
     case 'consequences':
       return adr.consequences;
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:41:5
       return adr.context;
     case 'decision':
       return adr.decision;
-    case 'consequences':
-      return adr.consequences;
+    case 'consequences':
     case 'references':
       return renderReferences(adr.references);
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:41:10
       return adr.context;
     case 'decision':
       return adr.decision;
-    case 'consequences':
+    case "":
       return adr.consequences;
     case 'references':
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:43:5
       return adr.decision;
     case 'consequences':
       return adr.consequences;
-    case 'references':
-      return renderReferences(adr.references);
+    case 'references':
   }
 }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:43:10
       return adr.decision;
     case 'consequences':
       return adr.consequences;
-    case 'references':
+    case "":
       return renderReferences(adr.references);
   }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ArrayDeclaration
packages/adr-kit/src/serialize.ts:49:28
 }
 
 export function serializeAdr(adr: Adr, convention: AdrConvention = NYGARD_CONVENTION): string {
-  const blocks: string[] = [];
+  const blocks: string[] = ["Stryker was here"];
   const hasSectionOrder = adr.sectionOrder.length > 0;
   const sectionFields = new Set(
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected 'Stryker was here\n\n# ADR-0001: Use f…' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:50:27
 
 export function serializeAdr(adr: Adr, convention: AdrConvention = NYGARD_CONVENTION): string {
   const blocks: string[] = [];
-  const hasSectionOrder = adr.sectionOrder.length > 0;
+  const hasSectionOrder = false;
   const sectionFields = new Set(
     adr.sectionOrder
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:50:27
 
 export function serializeAdr(adr: Adr, convention: AdrConvention = NYGARD_CONVENTION): string {
   const blocks: string[] = [];
-  const hasSectionOrder = adr.sectionOrder.length > 0;
+  const hasSectionOrder = true;
   const sectionFields = new Set(
     adr.sectionOrder
killedBy: serializeAdr — default template emits the full Nygard template with no References section
statusReason: expected '# ADR-0005: Use X\n\n- Status: Propos…' to contain '## Context'

[Survived] MethodExpression
packages/adr-kit/src/serialize.ts:52:5
   const blocks: string[] = [];
   const hasSectionOrder = adr.sectionOrder.length > 0;
   const sectionFields = new Set(
-    adr.sectionOrder
-      .map((heading) => matchKnownField(heading))
-      .filter((field): field is KnownField => field !== undefined),
+    adr.sectionOrder.map(heading => matchKnownField(heading)),
   );
 

[Killed] ArrowFunction
packages/adr-kit/src/serialize.ts:53:12
   const hasSectionOrder = adr.sectionOrder.length > 0;
   const sectionFields = new Set(
     adr.sectionOrder
-      .map((heading) => matchKnownField(heading))
+      .map(() => undefined)
       .filter((field): field is KnownField => field !== undefined),
   );
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:54:47
   const sectionFields = new Set(
     adr.sectionOrder
       .map((heading) => matchKnownField(heading))
-      .filter((field): field is KnownField => field !== undefined),
+      .filter((field): field is KnownField => field === undefined),
   );
 
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] ArrowFunction
packages/adr-kit/src/serialize.ts:54:15
   const sectionFields = new Set(
     adr.sectionOrder
       .map((heading) => matchKnownField(heading))
-      .filter((field): field is KnownField => field !== undefined),
+      .filter(() => undefined),
   );
 
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:57:7
       .filter((field): field is KnownField => field !== undefined),
   );
 
-  if (convention.metaStyle === 'frontmatter') {
+  if (convention.metaStyle !== 'frontmatter') {
     const frontmatterLines = ['---'];
     if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '---\nstatus: Accepted\ndate: 2026-07-…' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:57:7
       .filter((field): field is KnownField => field !== undefined),
   );
 
-  if (convention.metaStyle === 'frontmatter') {
+  if (false) {
     const frontmatterLines = ['---'];
     if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '# Use fixture-based testing for the A…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:58:31
   );
 
   if (convention.metaStyle === 'frontmatter') {
-    const frontmatterLines = ['---'];
+    const frontmatterLines = [""];
     if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
     if (adr.date !== '') frontmatterLines.push(`date: ${adr.date}`);
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '\nstatus: accepted\ndate: 2026-07-16\…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:59:9
 
   if (convention.metaStyle === 'frontmatter') {
     const frontmatterLines = ['---'];
-    if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
+    if (false) frontmatterLines.push(`status: ${adr.status}`);
     if (adr.date !== '') frontmatterLines.push(`date: ${adr.date}`);
     frontmatterLines.push('---');
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\ndate: 2026-07-16\n---\n\n# Use f…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:59:9
 
   if (convention.metaStyle === 'frontmatter') {
     const frontmatterLines = ['---'];
-    if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
+    if (adr.status === '') frontmatterLines.push(`status: ${adr.status}`);
     if (adr.date !== '') frontmatterLines.push(`date: ${adr.date}`);
     frontmatterLines.push('---');
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\ndate: 2026-07-16\n---\n\n# Use f…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:60:9
   if (convention.metaStyle === 'frontmatter') {
     const frontmatterLines = ['---'];
     if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
-    if (adr.date !== '') frontmatterLines.push(`date: ${adr.date}`);
+    if (false) frontmatterLines.push(`date: ${adr.date}`);
     frontmatterLines.push('---');
     blocks.push(frontmatterLines.join('\n'));
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\n---\n\n# Use f…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:60:9
   if (convention.metaStyle === 'frontmatter') {
     const frontmatterLines = ['---'];
     if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
-    if (adr.date !== '') frontmatterLines.push(`date: ${adr.date}`);
+    if (adr.date === '') frontmatterLines.push(`date: ${adr.date}`);
     frontmatterLines.push('---');
     blocks.push(frontmatterLines.join('\n'));
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\n---\n\n# Use f…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/serialize.ts:62:39
     if (adr.status !== '') frontmatterLines.push(`status: ${adr.status}`);
     if (adr.date !== '') frontmatterLines.push(`date: ${adr.date}`);
     frontmatterLines.push('---');
-    blocks.push(frontmatterLines.join('\n'));
+    blocks.push(frontmatterLines.join(""));
   }
 
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---status: accepteddate: 2026-07-16--…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] CallExpression
packages/adr-kit/src/serialize.ts:65:3
     blocks.push(frontmatterLines.join('\n'));
   }
 
-  blocks.push(renderH1(adr, convention));
+  ;
 
   if (convention.metaStyle !== 'frontmatter') {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '- Status: Accepted\n- Date: 2026-07-1…' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:67:7
 
   blocks.push(renderH1(adr, convention));
 
-  if (convention.metaStyle !== 'frontmatter') {
+  if (true) {
     if (hasSectionOrder) {
       const preambleLines: string[] = [];
killedBy: serializeAdr — byte-stable round trip reproduces MADR exactly
statusReason: expected '---\nstatus: accepted\ndate: 2026-07-…' to be '---\nstatus: accepted\ndate: 2026-07-…' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:67:47
 
   blocks.push(renderH1(adr, convention));
 
-  if (convention.metaStyle !== 'frontmatter') {
-    if (hasSectionOrder) {
-      const preambleLines: string[] = [];
-      if (!sectionFields.has('status') && adr.status !== '') {
-        preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
-      }
-      if (!sectionFields.has('date') && adr.date !== '') {
-        preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
-      }
-      if (preambleLines.length > 0) blocks.push(preambleLines.join('\n'));
-    } else if (convention.metaStyle === 'bullet-list') {
-      const preambleLines: string[] = [];
-      if (adr.status !== '') preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
-      if (adr.date !== '') preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
-      if (preambleLines.length > 0) blocks.push(preambleLines.join('\n'));
-    }
-  }
+  if (convention.metaStyle !== 'frontmatter') {}
 
   if (hasSectionOrder) {
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] BlockStatement
packages/adr-kit/src/serialize.ts:68:26
   blocks.push(renderH1(adr, convention));
 
   if (convention.metaStyle !== 'frontmatter') {
-    if (hasSectionOrder) {
-      const preambleLines: string[] = [];
-      if (!sectionFields.has('status') && adr.status !== '') {
-        preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
-      }
-      if (!sectionFields.has('date') && adr.date !== '') {
-        preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
-      }
-      if (preambleLines.length > 0) blocks.push(preambleLines.join('\n'));
-    } else if (convention.metaStyle === 'bullet-list') {
+    if (hasSectionOrder) {} else if (convention.metaStyle === 'bullet-list') {
       const preambleLines: string[] = [];
       if (adr.status !== '') preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:68:9
   blocks.push(renderH1(adr, convention));
 
   if (convention.metaStyle !== 'frontmatter') {
-    if (hasSectionOrder) {
+    if (false) {
       const preambleLines: string[] = [];
       if (!sectionFields.has('status') && adr.status !== '') {
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:70:11
   if (convention.metaStyle !== 'frontmatter') {
     if (hasSectionOrder) {
       const preambleLines: string[] = [];
-      if (!sectionFields.has('status') && adr.status !== '') {
+      if (false) {
         preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
       }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:70:11
   if (convention.metaStyle !== 'frontmatter') {
     if (hasSectionOrder) {
       const preambleLines: string[] = [];
-      if (!sectionFields.has('status') && adr.status !== '') {
+      if (true) {
         preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
       }
killedBy: serializeAdr — byte-stable round trip reproduces CLASSIC_NYGARD exactly
statusReason: expected '# 1. Record architecture decisions\n\…' to be '# 1. Record architecture decisions\n\…' // Object.is equality

[Killed] BooleanLiteral
packages/adr-kit/src/serialize.ts:73:11
       if (!sectionFields.has('status') && adr.status !== '') {
         preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
       }
-      if (!sectionFields.has('date') && adr.date !== '') {
+      if (sectionFields.has('date') && adr.date !== '') {
         preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
       }
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] LogicalOperator
packages/adr-kit/src/serialize.ts:73:11
       if (!sectionFields.has('status') && adr.status !== '') {
         preambleLines.push(`${convention.metaBullet}${convention.statusLabel}: ${adr.status}`);
       }
-      if (!sectionFields.has('date') && adr.date !== '') {
+      if (!sectionFields.has('date') || adr.date !== '') {
         preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
       }
killedBy: serializeAdr — byte-stable round trip reproduces DATE_AS_SECTION exactly
statusReason: expected '# ADR-0010: Sections style with a Dat…' to be '# ADR-0010: Sections style with a Dat…' // Object.is equality

[Killed] EqualityOperator
packages/adr-kit/src/serialize.ts:76:11
       if (!sectionFields.has('date') && adr.date !== '') {
         preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
       }
-      if (preambleLines.length > 0) blocks.push(preambleLines.join('\n'));
+      if (preambleLines.length >= 0) blocks.push(preambleLines.join('\n'));
     } else if (convention.metaStyle === 'bullet-list') {
       const preambleLines: string[] = [];
killedBy: serializeAdr — byte-stable round trip reproduces DATE_AS_SECTION exactly
statusReason: expected '# ADR-0010: Sections style with a Dat…' to be '# ADR-0010: Sections style with a Dat…' // Object.is equality

[Killed] ConditionalExpression
packages/adr-kit/src/serialize.ts:76:11
       if (!sectionFields.has('date') && adr.date !== '') {
         preambleLines.push(`${convention.metaBullet}${convention.dateLabel}: ${adr.date}`);
       }
-      if (preambleLines.length > 0) blocks.push(preambleLines.join('\n'));
+      if (false) blocks.push(preambleLines.join('\n'));
     } else if (convention.metaStyle === 'bullet-list') {
       const preambleLines: string[] = [];
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality
