[Killed] StringLiteral
packages/adr-kit/src/convention.ts:34:15
 
 /** The Michael Nygard template — the fallback when a repo has no ADR convention yet. */
 export const NYGARD_CONVENTION: AdrConvention = {
-  titleStyle: 'adr-prefix',
+  titleStyle: "",
   numberWidth: 4,
   metaStyle: 'bullet-list',
killedBy: serializeAdr — default template emits the full Nygard template with no References section
statusReason: expected '# Use X\n\n- Status: Proposed\n- Date…' to contain '# ADR-0005: Use X'

[Killed] StringLiteral
packages/adr-kit/src/convention.ts:36:14
 export const NYGARD_CONVENTION: AdrConvention = {
   titleStyle: 'adr-prefix',
   numberWidth: 4,
-  metaStyle: 'bullet-list',
+  metaStyle: "",
   metaBullet: '- ',
   statusLabel: 'Status',
killedBy: serializeAdr — default template emits the full Nygard template with no References section
statusReason: expected '# ADR-0005: Use X\n\n## Context\n\n##…' to contain '- Status: Proposed'

[Killed] StringLiteral
packages/adr-kit/src/convention.ts:38:16
   numberWidth: 4,
   metaStyle: 'bullet-list',
   metaBullet: '- ',
-  statusLabel: 'Status',
+  statusLabel: "",
   dateLabel: 'Date',
   contextLabel: 'Context',
killedBy: serializeAdr — byte-stable round trip reproduces ACCEPTED_NYGARD exactly
statusReason: expected '# ADR-0001: Use fixture ADRs to test …' to be '# ADR-0001: Use fixture ADRs to test …' // Object.is equality

[Killed] StringLiteral
packages/adr-kit/src/convention.ts:40:17
   metaBullet: '- ',
   statusLabel: 'Status',
   dateLabel: 'Date',
-  contextLabel: 'Context',
+  contextLabel: "",
   decisionLabel: 'Decision',
   consequencesLabel: 'Consequences',
killedBy: serializeAdr — default template emits the full Nygard template with no References section
statusReason: expected '# ADR-0005: Use X\n\n- Status: Propos…' to contain '## Context'

[Killed] StringLiteral
packages/adr-kit/src/convention.ts:41:18
   statusLabel: 'Status',
   dateLabel: 'Date',
   contextLabel: 'Context',
-  decisionLabel: 'Decision',
+  decisionLabel: "",
   consequencesLabel: 'Consequences',
   referencesLabel: 'References',
killedBy: serializeAdr — default template emits the full Nygard template with no References section
statusReason: expected '# ADR-0005: Use X\n\n- Status: Propos…' to contain '## Decision'

[Killed] StringLiteral
packages/adr-kit/src/convention.ts:44:18
   decisionLabel: 'Decision',
   consequencesLabel: 'Consequences',
   referencesLabel: 'References',
-  headingPrefix: '## ',
+  headingPrefix: "",
   eol: '\n',
   trailingNewline: true,
killedBy: serializeAdr — default template emits the full Nygard template with no References section
statusReason: expected '# ADR-0005: Use X\n\n- Status: Propos…' to contain '## Context'

[Survived] StringLiteral
packages/adr-kit/src/convention.ts:45:8
   consequencesLabel: 'Consequences',
   referencesLabel: 'References',
   headingPrefix: '## ',
-  eol: '\n',
+  eol: "",
   trailingNewline: true,
 };

[Survived] BooleanLiteral
packages/adr-kit/src/convention.ts:46:20
   referencesLabel: 'References',
   headingPrefix: '## ',
   eol: '\n',
-  trailingNewline: true,
+  trailingNewline: false,
 };
 
