[Killed] BlockStatement
packages/config/src/index.ts:16:61
  * Resolve a config file path from this package's `src/` directory.
  * Works both in dev (from src/) and after build (from dist/ → ../src/).
  */
-export function resolveConfigPath(filename: string): string {
-  // After build, this file is at dist/index.js; config files are in ../src/
-  // In dev (tsx), this file is at src/index.ts; config files are in ./
-  const base = __dirname.endsWith('dist') ? resolve(__dirname, '..', 'src') : __dirname;
-  return resolve(base, filename);
-}
+export function resolveConfigPath(filename: string): string {}
 
 /** Directory containing constitution markdown files */
killedBy: config paths resolves shared config paths
statusReason: The "path" argument must be of type string. Received undefined

[Survived] MethodExpression
packages/config/src/index.ts:19:16
 export function resolveConfigPath(filename: string): string {
   // After build, this file is at dist/index.js; config files are in ../src/
   // In dev (tsx), this file is at src/index.ts; config files are in ./
-  const base = __dirname.endsWith('dist') ? resolve(__dirname, '..', 'src') : __dirname;
+  const base = __dirname.startsWith('dist') ? resolve(__dirname, '..', 'src') : __dirname;
   return resolve(base, filename);
 }

[NoCoverage] StringLiteral
packages/config/src/index.ts:19:64
 export function resolveConfigPath(filename: string): string {
   // After build, this file is at dist/index.js; config files are in ../src/
   // In dev (tsx), this file is at src/index.ts; config files are in ./
-  const base = __dirname.endsWith('dist') ? resolve(__dirname, '..', 'src') : __dirname;
+  const base = __dirname.endsWith('dist') ? resolve(__dirname, "", 'src') : __dirname;
   return resolve(base, filename);
 }
