[Killed] BlockStatement
product/src/decompose/render.ts:5:65
 
 import type { Decomposition } from './decompose.js';
 
-function joinList(items: readonly string[] | undefined): string {
-  return (items ?? []).join(', ');
-}
+function joinList(items: readonly string[] | undefined): string {}
 
 /** Human-readable markdown lines for the CLI. Matches renderIntentDoc's style. */
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] LogicalOperator
product/src/decompose/render.ts:6:11
 import type { Decomposition } from './decompose.js';
 
 function joinList(items: readonly string[] | undefined): string {
-  return (items ?? []).join(', ');
+  return (items && []).join(', ');
 }
 
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:12:73
 /** Human-readable markdown lines for the CLI. Matches renderIntentDoc's style. */
 export function renderDecomposition(decomposition: Decomposition): string[] {
   const { epic, stories } = decomposition;
-  const lines: string[] = ['# Decomposition', `## Epic: ${epic.title}`, `Why: ${epic.why}`, 'Done when:'];
+  const lines: string[] = ['# Decomposition', `## Epic: ${epic.title}`, ``, 'Done when:'];
 
   for (const item of epic.doneWhen) {
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] BlockStatement
product/src/decompose/render.ts:14:37
   const { epic, stories } = decomposition;
   const lines: string[] = ['# Decomposition', `## Epic: ${epic.title}`, `Why: ${epic.why}`, 'Done when:'];
 
-  for (const item of epic.doneWhen) {
-    lines.push(`- ${item}`);
-  }
+  for (const item of epic.doneWhen) {}
   lines.push(`Traces to: ${joinList(epic.tracesTo)}`);
 
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(18) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:15:16
   const lines: string[] = ['# Decomposition', `## Epic: ${epic.title}`, `Why: ${epic.why}`, 'Done when:'];
 
   for (const item of epic.doneWhen) {
-    lines.push(`- ${item}`);
+    lines.push(``);
   }
   lines.push(`Traces to: ${joinList(epic.tracesTo)}`);
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:17:14
   for (const item of epic.doneWhen) {
     lines.push(`- ${item}`);
   }
-  lines.push(`Traces to: ${joinList(epic.tracesTo)}`);
+  lines.push(``);
 
   stories.forEach((story, i) => {
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] ArithmeticOperator
product/src/decompose/render.ts:20:33
   lines.push(`Traces to: ${joinList(epic.tracesTo)}`);
 
   stories.forEach((story, i) => {
-    lines.push('', `### Story ${i + 1}: ${story.title}`);
+    lines.push('', `### Story ${i - 1}: ${story.title}`);
     lines.push(`As a ${story.role}, I want ${story.want}, so that ${story.soThat}`);
 
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:20:20
   lines.push(`Traces to: ${joinList(epic.tracesTo)}`);
 
   stories.forEach((story, i) => {
-    lines.push('', `### Story ${i + 1}: ${story.title}`);
+    lines.push('', ``);
     lines.push(`As a ${story.role}, I want ${story.want}, so that ${story.soThat}`);
 
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:23:16
     lines.push('', `### Story ${i + 1}: ${story.title}`);
     lines.push(`As a ${story.role}, I want ${story.want}, so that ${story.soThat}`);
 
-    lines.push('In scope:');
+    lines.push("");
     for (const item of story.inScope) {
       lines.push(`- ${item}`);
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] BlockStatement
product/src/decompose/render.ts:24:39
     lines.push(`As a ${story.role}, I want ${story.want}, so that ${story.soThat}`);
 
     lines.push('In scope:');
-    for (const item of story.inScope) {
-      lines.push(`- ${item}`);
-    }
+    for (const item of story.inScope) {}
 
     lines.push('Out of scope:');
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(18) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] BlockStatement
product/src/decompose/render.ts:29:42
     }
 
     lines.push('Out of scope:');
-    for (const item of story.outOfScope) {
-      lines.push(`- ${item}`);
-    }
+    for (const item of story.outOfScope) {}
 
     lines.push('Acceptance criteria:');
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(18) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:30:18
 
     lines.push('Out of scope:');
     for (const item of story.outOfScope) {
-      lines.push(`- ${item}`);
+      lines.push(``);
     }
 
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] BlockStatement
product/src/decompose/render.ts:34:55
     }
 
     lines.push('Acceptance criteria:');
-    for (const criterion of story.acceptanceCriteria) {
-      lines.push(`- ${criterion.name}`);
-      if (criterion.given.length > 0) {
-        lines.push(`  Given ${joinList(criterion.given)}`);
-      }
-      lines.push(`  When ${joinList(criterion.when)}`);
-      lines.push(`  Then ${joinList(criterion.then)}`);
-      lines.push(`  Traces to: ${joinList(criterion.tracesTo)}`);
-    }
+    for (const criterion of story.acceptanceCriteria) {}
 
     lines.push(`Traces to: ${joinList(story.tracesTo)}`);
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(14) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] EqualityOperator
product/src/decompose/render.ts:36:11
     lines.push('Acceptance criteria:');
     for (const criterion of story.acceptanceCriteria) {
       lines.push(`- ${criterion.name}`);
-      if (criterion.given.length > 0) {
+      if (criterion.given.length >= 0) {
         lines.push(`  Given ${joinList(criterion.given)}`);
       }
killedBy: renderDecomposition omits the Given line entirely when a criterion has an empty given, and separates stories with a blank line
statusReason: expected [ '# Decomposition', …(33) ] to not include '  Given '

[Killed] EqualityOperator
product/src/decompose/render.ts:36:11
     lines.push('Acceptance criteria:');
     for (const criterion of story.acceptanceCriteria) {
       lines.push(`- ${criterion.name}`);
-      if (criterion.given.length > 0) {
+      if (criterion.given.length <= 0) {
         lines.push(`  Given ${joinList(criterion.given)}`);
       }
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(18) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:37:20
     for (const criterion of story.acceptanceCriteria) {
       lines.push(`- ${criterion.name}`);
       if (criterion.given.length > 0) {
-        lines.push(`  Given ${joinList(criterion.given)}`);
+        lines.push(``);
       }
       lines.push(`  When ${joinList(criterion.when)}`);
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:39:18
       if (criterion.given.length > 0) {
         lines.push(`  Given ${joinList(criterion.given)}`);
       }
-      lines.push(`  When ${joinList(criterion.when)}`);
+      lines.push(``);
       lines.push(`  Then ${joinList(criterion.then)}`);
       lines.push(`  Traces to: ${joinList(criterion.tracesTo)}`);
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:40:18
         lines.push(`  Given ${joinList(criterion.given)}`);
       }
       lines.push(`  When ${joinList(criterion.when)}`);
-      lines.push(`  Then ${joinList(criterion.then)}`);
+      lines.push(``);
       lines.push(`  Traces to: ${joinList(criterion.tracesTo)}`);
     }
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]

[Killed] StringLiteral
product/src/decompose/render.ts:41:18
       }
       lines.push(`  When ${joinList(criterion.when)}`);
       lines.push(`  Then ${joinList(criterion.then)}`);
-      lines.push(`  Traces to: ${joinList(criterion.tracesTo)}`);
+      lines.push(``);
     }
 
killedBy: renderDecomposition renders the epic header, done-when bullets, and traces-to, then each story
statusReason: expected [ '# Decomposition', …(19) ] to deeply equal [ '# Decomposition', …(19) ]
