[NoCoverage] ArrayDeclaration
product/src/export/issues.ts:12:20
 }
 
 function joinList(items: readonly string[] | undefined): string {
-  return (items ?? []).join(', ');
+  return (items ?? ["Stryker was here"]).join(', ');
 }
 

[Killed] BlockStatement
product/src/export/issues.ts:18:35
 function gherkinBlock(criterion: AcceptanceCriterion): string[] {
   const lines: string[] = ['```gherkin', `Scenario: ${criterion.name}`];
 
-  if (criterion.given.length > 0) {
-    lines.push(`  Given ${criterion.given[0]}`);
-    for (const given of criterion.given.slice(1)) {
-      lines.push(`  And ${given}`);
-    }
-  }
+  if (criterion.given.length > 0) {}
 
   lines.push(`  When ${criterion.when[0]}`);
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Killed] EqualityOperator
product/src/export/issues.ts:18:7
 function gherkinBlock(criterion: AcceptanceCriterion): string[] {
   const lines: string[] = ['```gherkin', `Scenario: ${criterion.name}`];
 
-  if (criterion.given.length > 0) {
+  if (criterion.given.length <= 0) {
     lines.push(`  Given ${criterion.given[0]}`);
     for (const given of criterion.given.slice(1)) {
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Killed] MethodExpression
product/src/export/issues.ts:20:25
 
   if (criterion.given.length > 0) {
     lines.push(`  Given ${criterion.given[0]}`);
-    for (const given of criterion.given.slice(1)) {
+    for (const given of criterion.given) {
       lines.push(`  And ${given}`);
     }
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Killed] BlockStatement
product/src/export/issues.ts:20:51
 
   if (criterion.given.length > 0) {
     lines.push(`  Given ${criterion.given[0]}`);
-    for (const given of criterion.given.slice(1)) {
-      lines.push(`  And ${given}`);
-    }
+    for (const given of criterion.given.slice(1)) {}
   }
 
killedBy: renderStoryIssue renders And lines for additional given/when/then entries
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '  Given g1\n  And g2\n  When w1\n  An…'

[Killed] StringLiteral
product/src/export/issues.ts:21:18
   if (criterion.given.length > 0) {
     lines.push(`  Given ${criterion.given[0]}`);
     for (const given of criterion.given.slice(1)) {
-      lines.push(`  And ${given}`);
+      lines.push(``);
     }
   }
killedBy: renderStoryIssue renders And lines for additional given/when/then entries
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '  Given g1\n  And g2\n  When w1\n  An…'

[Killed] StringLiteral
product/src/export/issues.ts:25:14
     }
   }
 
-  lines.push(`  When ${criterion.when[0]}`);
+  lines.push(``);
   for (const when of criterion.when.slice(1)) {
     lines.push(`  And ${when}`);
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Killed] MethodExpression
product/src/export/issues.ts:26:22
   }
 
   lines.push(`  When ${criterion.when[0]}`);
-  for (const when of criterion.when.slice(1)) {
+  for (const when of criterion.when) {
     lines.push(`  And ${when}`);
   }
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Killed] BlockStatement
product/src/export/issues.ts:26:47
   }
 
   lines.push(`  When ${criterion.when[0]}`);
-  for (const when of criterion.when.slice(1)) {
-    lines.push(`  And ${when}`);
-  }
+  for (const when of criterion.when.slice(1)) {}
 
   lines.push(`  Then ${criterion.then[0]}`);
killedBy: renderStoryIssue renders And lines for additional given/when/then entries
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '  Given g1\n  And g2\n  When w1\n  An…'

[Killed] MethodExpression
product/src/export/issues.ts:31:22
   }
 
   lines.push(`  Then ${criterion.then[0]}`);
-  for (const then of criterion.then.slice(1)) {
+  for (const then of criterion.then) {
     lines.push(`  And ${then}`);
   }
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Killed] BlockStatement
product/src/export/issues.ts:31:47
   }
 
   lines.push(`  Then ${criterion.then[0]}`);
-  for (const then of criterion.then.slice(1)) {
-    lines.push(`  And ${then}`);
-  }
+  for (const then of criterion.then.slice(1)) {}
 
   lines.push('```');
killedBy: renderStoryIssue renders And lines for additional given/when/then entries
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '  Given g1\n  And g2\n  When w1\n  An…'

[Killed] StringLiteral
product/src/export/issues.ts:32:16
 
   lines.push(`  Then ${criterion.then[0]}`);
   for (const then of criterion.then.slice(1)) {
-    lines.push(`  And ${then}`);
+    lines.push(``);
   }
 
killedBy: renderStoryIssue renders And lines for additional given/when/then entries
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '  Given g1\n  And g2\n  When w1\n  An…'

[Survived] ConditionalExpression
product/src/export/issues.ts:37:7
 
   lines.push('```');
 
-  if (criterion.tracesTo.length > 0) {
+  if (false) {
     lines.push(`Traces to: ${joinList(criterion.tracesTo)}`);
   }

[Survived] EqualityOperator
product/src/export/issues.ts:37:7
 
   lines.push('```');
 
-  if (criterion.tracesTo.length > 0) {
+  if (criterion.tracesTo.length >= 0) {
     lines.push(`Traces to: ${joinList(criterion.tracesTo)}`);
   }

[Survived] StringLiteral
product/src/export/issues.ts:38:16
   lines.push('```');
 
   if (criterion.tracesTo.length > 0) {
-    lines.push(`Traces to: ${joinList(criterion.tracesTo)}`);
+    lines.push(``);
   }
 

[Killed] BlockStatement
product/src/export/issues.ts:45:59
 }
 
 /** Renders an Epic as the epic-level GitHub issue payload. */
-export function renderEpicIssue(epic: Epic): IssuePayload {
-  const lines: string[] = ['## Why', epic.why, '', '## Done when'];
-
-  for (const item of epic.doneWhen) {
-    lines.push(`- [ ] ${item}`);
-  }
-
-  lines.push('', '## Stories (build order)');
-  for (const child of epic.children) {
-    lines.push(`- ${child}`);
-  }
-
-  if (epic.whatAlreadyExists !== undefined) {
-    lines.push('', '## What already exists', epic.whatAlreadyExists);
-  }
-
-  if (epic.tracesTo.length > 0) {
-    lines.push('', `Traces to: ${joinList(epic.tracesTo)}`);
-  }
-
-  return { title: epic.title, body: lines.join('\n'), labels: epic.labels };
-}
+export function renderEpicIssue(epic: Epic): IssuePayload {}
 
 /** Renders a Story as a GitHub issue payload, optionally linked to a filed epic number. */
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'title')

[Survived] StringLiteral
product/src/export/issues.ts:46:48
 
 /** Renders an Epic as the epic-level GitHub issue payload. */
 export function renderEpicIssue(epic: Epic): IssuePayload {
-  const lines: string[] = ['## Why', epic.why, '', '## Done when'];
+  const lines: string[] = ['## Why', epic.why, "Stryker was here!", '## Done when'];
 
   for (const item of epic.doneWhen) {

[Killed] BlockStatement
product/src/export/issues.ts:48:37
 export function renderEpicIssue(epic: Epic): IssuePayload {
   const lines: string[] = ['## Why', epic.why, '', '## Done when'];
 
-  for (const item of epic.doneWhen) {
-    lines.push(`- [ ] ${item}`);
-  }
+  for (const item of epic.doneWhen) {}
 
   lines.push('', '## Stories (build order)');
killedBy: renderEpicIssue passes through title and labels, and renders the standard sections in order
statusReason: expected '## Why\nengineering needs filed issue…' to contain '- [ ] issues are filed\n- [ ] bundle …'

[Killed] StringLiteral
product/src/export/issues.ts:52:18
     lines.push(`- [ ] ${item}`);
   }
 
-  lines.push('', '## Stories (build order)');
+  lines.push('', "");
   for (const child of epic.children) {
     lines.push(`- ${child}`);
killedBy: renderEpicIssue passes through title and labels, and renders the standard sections in order
statusReason: expected '## Why\nengineering needs filed issue…' to contain '## Stories (build order)\n- Story A\n…'

[Killed] BlockStatement
product/src/export/issues.ts:53:38
   }
 
   lines.push('', '## Stories (build order)');
-  for (const child of epic.children) {
-    lines.push(`- ${child}`);
-  }
+  for (const child of epic.children) {}
 
   if (epic.whatAlreadyExists !== undefined) {
killedBy: renderEpicIssue passes through title and labels, and renders the standard sections in order
statusReason: expected '## Why\nengineering needs filed issue…' to contain '## Stories (build order)\n- Story A\n…'

[Killed] EqualityOperator
product/src/export/issues.ts:57:7
     lines.push(`- ${child}`);
   }
 
-  if (epic.whatAlreadyExists !== undefined) {
+  if (epic.whatAlreadyExists === undefined) {
     lines.push('', '## What already exists', epic.whatAlreadyExists);
   }
killedBy: renderEpicIssue omits "What already exists" when unset
statusReason: expected '## Why\nengineering needs filed issue…' not to contain 'What already exists'

[Killed] ConditionalExpression
product/src/export/issues.ts:57:7
     lines.push(`- ${child}`);
   }
 
-  if (epic.whatAlreadyExists !== undefined) {
+  if (false) {
     lines.push('', '## What already exists', epic.whatAlreadyExists);
   }
killedBy: renderEpicIssue includes "What already exists" only when set
statusReason: expected '## Why\nengineering needs filed issue…' to contain '## What already exists\na stub module'

[Killed] StringLiteral
product/src/export/issues.ts:58:20
   }
 
   if (epic.whatAlreadyExists !== undefined) {
-    lines.push('', '## What already exists', epic.whatAlreadyExists);
+    lines.push('', "", epic.whatAlreadyExists);
   }
 
killedBy: renderEpicIssue includes "What already exists" only when set
statusReason: expected '## Why\nengineering needs filed issue…' to contain '## What already exists\na stub module'

[Killed] EqualityOperator
product/src/export/issues.ts:61:7
     lines.push('', '## What already exists', epic.whatAlreadyExists);
   }
 
-  if (epic.tracesTo.length > 0) {
+  if (epic.tracesTo.length <= 0) {
     lines.push('', `Traces to: ${joinList(epic.tracesTo)}`);
   }
killedBy: renderEpicIssue omits "Traces to" when tracesTo is empty
statusReason: expected '## Why\nengineering needs filed issue…' not to contain 'Traces to'

[Killed] BlockStatement
product/src/export/issues.ts:61:33
     lines.push('', '## What already exists', epic.whatAlreadyExists);
   }
 
-  if (epic.tracesTo.length > 0) {
-    lines.push('', `Traces to: ${joinList(epic.tracesTo)}`);
-  }
+  if (epic.tracesTo.length > 0) {}
 
   return { title: epic.title, body: lines.join('\n'), labels: epic.labels };
killedBy: renderEpicIssue includes "Traces to" only when tracesTo is non-empty
statusReason: expected '## Why\nengineering needs filed issue…' to contain 'Traces to: INT-PROBLEM-01'

[Killed] StringLiteral
product/src/export/issues.ts:62:20
   }
 
   if (epic.tracesTo.length > 0) {
-    lines.push('', `Traces to: ${joinList(epic.tracesTo)}`);
+    lines.push('', ``);
   }
 
killedBy: renderEpicIssue includes "Traces to" only when tracesTo is non-empty
statusReason: expected '## Why\nengineering needs filed issue…' to contain 'Traces to: INT-PROBLEM-01'

[Survived] StringLiteral
product/src/export/issues.ts:62:16
   }
 
   if (epic.tracesTo.length > 0) {
-    lines.push('', `Traces to: ${joinList(epic.tracesTo)}`);
+    lines.push("Stryker was here!", `Traces to: ${joinList(epic.tracesTo)}`);
   }
 

[Killed] StringLiteral
product/src/export/issues.ts:65:48
     lines.push('', `Traces to: ${joinList(epic.tracesTo)}`);
   }
 
-  return { title: epic.title, body: lines.join('\n'), labels: epic.labels };
+  return { title: epic.title, body: lines.join(""), labels: epic.labels };
 }
 
killedBy: renderEpicIssue passes through title and labels, and renders the standard sections in order
statusReason: expected '## Whyengineering needs filed issues#…' to contain '## Why\nengineering needs filed issues'

[Killed] ConditionalExpression
product/src/export/issues.ts:72:7
 export function renderStoryIssue(story: Story, epicNumber?: number): IssuePayload {
   const lines: string[] = [];
 
-  if (epicNumber !== undefined) {
+  if (false) {
     lines.push(`Part of #${epicNumber}`, '');
   }
killedBy: renderStoryIssue prepends "Part of #<n>" as the first line when an epic number is passed
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
product/src/export/issues.ts:72:7
 export function renderStoryIssue(story: Story, epicNumber?: number): IssuePayload {
   const lines: string[] = [];
 
-  if (epicNumber !== undefined) {
+  if (true) {
     lines.push(`Part of #${epicNumber}`, '');
   }
killedBy: renderStoryIssue has no "Part of" line without an epic number
statusReason: expected 'Part of #undefined\n\nAs a engineer, …' not to contain 'Part of #'

[Killed] StringLiteral
product/src/export/issues.ts:77:5
   }
 
   lines.push(
-    `As a ${story.role}, I want ${story.want}, so that ${story.soThat}`,
+    ``,
     '',
     '## Problem',
killedBy: renderStoryIssue renders the "As a ... I want ... so that" sentence
statusReason: expected '\n\n## Problem\nnothing is filed yet\…' to contain 'As a engineer, I want a filed issue, …'

[Survived] StringLiteral
product/src/export/issues.ts:78:5
 
   lines.push(
     `As a ${story.role}, I want ${story.want}, so that ${story.soThat}`,
-    '',
+    "Stryker was here!",
     '## Problem',
     story.problemStatement,

[Killed] BlockStatement
product/src/export/issues.ts:84:37
   );
 
   lines.push('', '## In scope');
-  for (const item of story.inScope) {
-    lines.push(`- ${item}`);
-  }
+  for (const item of story.inScope) {}
 
   if (story.outOfScope.length > 0) {
killedBy: renderStoryIssue renders the "## In scope" bullets
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## In scope\n- file the issue'

[Killed] ConditionalExpression
product/src/export/issues.ts:88:7
     lines.push(`- ${item}`);
   }
 
-  if (story.outOfScope.length > 0) {
+  if (false) {
     lines.push('', '## Out of scope');
     for (const item of story.outOfScope) {
killedBy: renderStoryIssue renders the "## Out of scope" bullets when present
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## Out of scope\n- program design'

[Killed] BlockStatement
product/src/export/issues.ts:88:36
     lines.push(`- ${item}`);
   }
 
-  if (story.outOfScope.length > 0) {
-    lines.push('', '## Out of scope');
-    for (const item of story.outOfScope) {
-      lines.push(`- ${item}`);
-    }
-  }
+  if (story.outOfScope.length > 0) {}
 
   lines.push('', '## Acceptance criteria');
killedBy: renderStoryIssue renders the "## Out of scope" bullets when present
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## Out of scope\n- program design'

[Killed] StringLiteral
product/src/export/issues.ts:89:20
   }
 
   if (story.outOfScope.length > 0) {
-    lines.push('', '## Out of scope');
+    lines.push('', "");
     for (const item of story.outOfScope) {
       lines.push(`- ${item}`);
killedBy: renderStoryIssue renders the "## Out of scope" bullets when present
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## Out of scope\n- program design'

[Killed] BlockStatement
product/src/export/issues.ts:90:42
 
   if (story.outOfScope.length > 0) {
     lines.push('', '## Out of scope');
-    for (const item of story.outOfScope) {
-      lines.push(`- ${item}`);
-    }
+    for (const item of story.outOfScope) {}
   }
 
killedBy: renderStoryIssue renders the "## Out of scope" bullets when present
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## Out of scope\n- program design'

[Survived] StringLiteral
product/src/export/issues.ts:95:18
     }
   }
 
-  lines.push('', '## Acceptance criteria');
+  lines.push('', "");
   for (const criterion of story.acceptanceCriteria) {
     lines.push(...gherkinBlock(criterion), '');

[Killed] BlockStatement
product/src/export/issues.ts:96:53
   }
 
   lines.push('', '## Acceptance criteria');
-  for (const criterion of story.acceptanceCriteria) {
-    lines.push(...gherkinBlock(criterion), '');
-  }
+  for (const criterion of story.acceptanceCriteria) {}
   if (lines[lines.length - 1] === '') {
     lines.pop();
killedBy: renderStoryIssue renders a gherkin fence with Scenario/Given/When/Then in order
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '```gherkin\nScenario: issue is filed\…'

[Survived] StringLiteral
product/src/export/issues.ts:97:44
 
   lines.push('', '## Acceptance criteria');
   for (const criterion of story.acceptanceCriteria) {
-    lines.push(...gherkinBlock(criterion), '');
+    lines.push(...gherkinBlock(criterion), "Stryker was here!");
   }
   if (lines[lines.length - 1] === '') {

[Survived] EqualityOperator
product/src/export/issues.ts:99:7
   for (const criterion of story.acceptanceCriteria) {
     lines.push(...gherkinBlock(criterion), '');
   }
-  if (lines[lines.length - 1] === '') {
+  if (lines[lines.length - 1] !== '') {
     lines.pop();
   }

[Survived] ArithmeticOperator
product/src/export/issues.ts:99:13
   for (const criterion of story.acceptanceCriteria) {
     lines.push(...gherkinBlock(criterion), '');
   }
-  if (lines[lines.length - 1] === '') {
+  if (lines[lines.length + 1] === '') {
     lines.pop();
   }

[Survived] CallExpression
product/src/export/issues.ts:100:5
     lines.push(...gherkinBlock(criterion), '');
   }
   if (lines[lines.length - 1] === '') {
-    lines.pop();
+    ;
   }
 

[Killed] BlockStatement
product/src/export/issues.ts:104:42
   }
 
   lines.push('', '## Verification');
-  for (const step of story.verification) {
-    lines.push(`- ${step.command} — passes when: ${step.passWhen}`);
-  }
+  for (const step of story.verification) {}
 
   if (story.investNote !== undefined) {
killedBy: renderStoryIssue renders verification bullets
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## Verification\n- npm test — passes …'

[Killed] StringLiteral
product/src/export/issues.ts:105:16
 
   lines.push('', '## Verification');
   for (const step of story.verification) {
-    lines.push(`- ${step.command} — passes when: ${step.passWhen}`);
+    lines.push(``);
   }
 
killedBy: renderStoryIssue renders verification bullets
statusReason: expected 'As a engineer, I want a filed issue, …' to contain '## Verification\n- npm test — passes …'

[Killed] ConditionalExpression
product/src/export/issues.ts:108:7
     lines.push(`- ${step.command} — passes when: ${step.passWhen}`);
   }
 
-  if (story.investNote !== undefined) {
+  if (true) {
     lines.push('', `INVEST: ${story.investNote}`);
   }
killedBy: renderStoryIssue renders the INVEST note only when set
statusReason: expected 'As a engineer, I want a filed issue, …' not to contain 'INVEST:'

[Killed] ConditionalExpression
product/src/export/issues.ts:108:7
     lines.push(`- ${step.command} — passes when: ${step.passWhen}`);
   }
 
-  if (story.investNote !== undefined) {
+  if (false) {
     lines.push('', `INVEST: ${story.investNote}`);
   }
killedBy: renderStoryIssue renders the INVEST note only when set
statusReason: expected 'As a engineer, I want a filed issue, …' to contain 'INVEST: small'

[Killed] StringLiteral
product/src/export/issues.ts:109:20
   }
 
   if (story.investNote !== undefined) {
-    lines.push('', `INVEST: ${story.investNote}`);
+    lines.push('', ``);
   }
 
killedBy: renderStoryIssue renders the INVEST note only when set
statusReason: expected 'As a engineer, I want a filed issue, …' to contain 'INVEST: small'

[Killed] EqualityOperator
product/src/export/issues.ts:112:7
     lines.push('', `INVEST: ${story.investNote}`);
   }
 
-  if (story.tracesTo.length > 0) {
+  if (story.tracesTo.length >= 0) {
     lines.push('', `Traces to: ${joinList(story.tracesTo)}`);
   }
killedBy: renderStoryIssue renders the story-level Traces to line only when non-empty
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/export/issues.ts:112:7
     lines.push('', `INVEST: ${story.investNote}`);
   }
 
-  if (story.tracesTo.length > 0) {
+  if (true) {
     lines.push('', `Traces to: ${joinList(story.tracesTo)}`);
   }
killedBy: renderStoryIssue renders the story-level Traces to line only when non-empty
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
product/src/export/issues.ts:116:49
     lines.push('', `Traces to: ${joinList(story.tracesTo)}`);
   }
 
-  return { title: story.title, body: lines.join('\n'), labels: story.labels };
+  return { title: story.title, body: lines.join(""), labels: story.labels };
 }
 
killedBy: renderStoryIssue prepends "Part of #<n>" as the first line when an epic number is passed
statusReason: expected false to be true // Object.is equality
