[Killed] StringLiteral
packages/product/src/adr-home.ts:15:29
 import { adrFilename, nextAdrNumberFromFilenames, NYGARD_CONVENTION } from '@on-par/adr-kit';
 
 /** Repo-root-relative path to the monorepo's single ADR home. */
-export const ADR_HOME_DIR = 'docs/adr';
+export const ADR_HOME_DIR = "";
 
 /** The ADR style this repo writes — see docs/adr/README.md. */
killedBy: adr-home declares docs/adr as the shared ADR home
statusReason: expected '' to be 'docs/adr' // Object.is equality

[Killed] BlockStatement
packages/product/src/adr-home.ts:20:58
 /** The ADR style this repo writes — see docs/adr/README.md. */
 export const ADR_CONVENTION = NYGARD_CONVENTION;
 
-export function resolveAdrHome(repoRoot: string): string {
-  return resolve(repoRoot, ADR_HOME_DIR);
-}
+export function resolveAdrHome(repoRoot: string): string {}
 
 /** Filename for the next ADR in a home, given the filenames already in it. */
killedBy: main prints the ADR home for `adr home`
statusReason: expected "vi.fn()" to be called with arguments: [ '/repo/docs/adr' ]

Received:

  1st vi.fn() call:

  [
-   "/repo/docs/adr",

[Killed] BlockStatement
packages/product/src/adr-home.ts:25:85
 }
 
 /** Filename for the next ADR in a home, given the filenames already in it. */
-export function nextAdrFilename(existing: readonly string[], title: string): string {
-  return adrFilename(nextAdrNumberFromFilenames(existing), title, ADR_CONVENTION.numberWidth);
-}
+export function nextAdrFilename(existing: readonly string[], title: string): string {}
 
 /** ADR files in a home — README.md is the index, not a decision record. */
killedBy: main prints the next ADR filename for `adr next <title>`
statusReason: expected "vi.fn()" to be called with arguments: [ '0003-a-big-choice.md' ]

Received:

  1st vi.fn() call:

  [
-   "0003-a-big-choice.md",

[Killed] BlockStatement
packages/product/src/adr-home.ts:30:108
 }
 
 /** ADR files in a home — README.md is the index, not a decision record. */
-export function listAdrFilenames(dir: string, readDir: (path: string) => string[] = readdirSync): string[] {
-  return readDir(dir).filter((name) => name.endsWith('.md') && name !== 'README.md');
-}
+export function listAdrFilenames(dir: string, readDir: (path: string) => string[] = readdirSync): string[] {}
 
killedBy: defaultDeps lists ADRs from the real docs/adr/ directory
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/product/src/adr-home.ts:31:64
 
 /** ADR files in a home — README.md is the index, not a decision record. */
 export function listAdrFilenames(dir: string, readDir: (path: string) => string[] = readdirSync): string[] {
-  return readDir(dir).filter((name) => name.endsWith('.md') && name !== 'README.md');
+  return readDir(dir).filter((name) => name.endsWith('.md') && name === 'README.md');
 }
 
killedBy: adr-home filters out README.md and non-markdown files
statusReason: expected [ 'README.md' ] to deeply equal [ '0001-a.md', '0002-b.md' ]

[Killed] ArrowFunction
packages/product/src/adr-home.ts:31:30
 
 /** ADR files in a home — README.md is the index, not a decision record. */
 export function listAdrFilenames(dir: string, readDir: (path: string) => string[] = readdirSync): string[] {
-  return readDir(dir).filter((name) => name.endsWith('.md') && name !== 'README.md');
+  return readDir(dir).filter(() => undefined);
 }
 
killedBy: adr-home filters out README.md and non-markdown files
statusReason: expected [] to deeply equal [ '0001-a.md', '0002-b.md' ]
