[Killed] StringLiteral
product/src/architecture/adrs.ts:6:32
 import type { RepoContextReader } from '@on-par/repo-context';
 
 /** Repo-root-relative ADR home scanned by default — matches adr-home.ts's ADR_HOME_DIR. */
-export const DEFAULT_ADR_DIR = 'docs/adr';
+export const DEFAULT_ADR_DIR = "";
 
 /** An Accepted ADR read from the target repo, condensed to what the epic designer needs. */
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Survived] Regex
product/src/architecture/adrs.ts:20:26
   decision: string;
 }
 
-const NON_ADR_FILENAME = /^(readme|index|_?template)\.md$/i;
+const NON_ADR_FILENAME = /(readme|index|_?template)\.md$/i;
 
 export async function readActiveAdrs(reader: RepoContextReader, opts?: { dir?: string }): Promise<readonly EpicAdr[]> {

[Killed] OptionalChaining
product/src/architecture/adrs.ts:23:15
 const NON_ADR_FILENAME = /^(readme|index|_?template)\.md$/i;
 
 export async function readActiveAdrs(reader: RepoContextReader, opts?: { dir?: string }): Promise<readonly EpicAdr[]> {
-  const dir = opts?.dir ?? DEFAULT_ADR_DIR;
+  const dir = opts.dir ?? DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(dir);
killedBy: readActiveAdrs parses Accepted ADRs from the target repo docs/adr
statusReason: Cannot read properties of undefined (reading 'dir')

[Killed] LogicalOperator
product/src/architecture/adrs.ts:23:15
 const NON_ADR_FILENAME = /^(readme|index|_?template)\.md$/i;
 
 export async function readActiveAdrs(reader: RepoContextReader, opts?: { dir?: string }): Promise<readonly EpicAdr[]> {
-  const dir = opts?.dir ?? DEFAULT_ADR_DIR;
+  const dir = opts?.dir && DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(dir);
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] MethodExpression
product/src/architecture/adrs.ts:26:22
   const dir = opts?.dir ?? DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(dir);
-  const candidates = entries.filter(
-    (entry) => entry.type === 'file' && /\.md$/i.test(entry.name) && !NON_ADR_FILENAME.test(entry.name),
-  );
+  const candidates = entries;
 
   const active: EpicAdr[] = [];

[Killed] ArrowFunction
product/src/architecture/adrs.ts:27:5
 
   const entries = await reader.readDir(dir);
   const candidates = entries.filter(
-    (entry) => entry.type === 'file' && /\.md$/i.test(entry.name) && !NON_ADR_FILENAME.test(entry.name),
+    () => undefined,
   );
 
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] EqualityOperator
product/src/architecture/adrs.ts:27:16
 
   const entries = await reader.readDir(dir);
   const candidates = entries.filter(
-    (entry) => entry.type === 'file' && /\.md$/i.test(entry.name) && !NON_ADR_FILENAME.test(entry.name),
+    (entry) => entry.type !== 'file' && /\.md$/i.test(entry.name) && !NON_ADR_FILENAME.test(entry.name),
   );
 
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] ArrayDeclaration
product/src/architecture/adrs.ts:30:29
     (entry) => entry.type === 'file' && /\.md$/i.test(entry.name) && !NON_ADR_FILENAME.test(entry.name),
   );
 
-  const active: EpicAdr[] = [];
+  const active: EpicAdr[] = ["Stryker was here"];
 
   for (const entry of candidates) {
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
product/src/architecture/adrs.ts:32:35
 
   const active: EpicAdr[] = [];
 
-  for (const entry of candidates) {
-    const file = await reader.readFile(entry.path);
-    if (file === undefined) {
-      continue;
-    }
-
-    const result = tryParseAdr(file.text, { filename: entry.name });
-    if (!result.ok) {
-      continue;
-    }
-
-    if (normalizeStatus(result.adr.status) !== 'Accepted') {
-      continue;
-    }
-
-    active.push({
-      label: result.adr.number === undefined ? entry.path : `ADR-${formatAdrNumber(result.adr.number)}`,
-      number: result.adr.number,
-      title: result.adr.title,
-      path: entry.path,
-      decision: result.adr.decision,
-    });
-  }
+  for (const entry of candidates) {}
 
   active.sort((a, b) => {
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:34:9
 
   for (const entry of candidates) {
     const file = await reader.readFile(entry.path);
-    if (file === undefined) {
+    if (false) {
       continue;
     }
killedBy: readActiveAdrs skips a candidate whose readFile degrades to undefined
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] EqualityOperator
product/src/architecture/adrs.ts:34:9
 
   for (const entry of candidates) {
     const file = await reader.readFile(entry.path);
-    if (file === undefined) {
+    if (file !== undefined) {
       continue;
     }
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Survived] ObjectLiteral
product/src/architecture/adrs.ts:38:43
       continue;
     }
 
-    const result = tryParseAdr(file.text, { filename: entry.name });
+    const result = tryParseAdr(file.text, {});
     if (!result.ok) {
       continue;

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:39:9
     }
 
     const result = tryParseAdr(file.text, { filename: entry.name });
-    if (!result.ok) {
+    if (true) {
       continue;
     }
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] BooleanLiteral
product/src/architecture/adrs.ts:39:9
     }
 
     const result = tryParseAdr(file.text, { filename: entry.name });
-    if (!result.ok) {
+    if (result.ok) {
       continue;
     }
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(1) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:43:9
       continue;
     }
 
-    if (normalizeStatus(result.adr.status) !== 'Accepted') {
+    if (false) {
       continue;
     }
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(8) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] EqualityOperator
product/src/architecture/adrs.ts:43:9
       continue;
     }
 
-    if (normalizeStatus(result.adr.status) !== 'Accepted') {
+    if (normalizeStatus(result.adr.status) === 'Accepted') {
       continue;
     }
killedBy: readActiveAdrs parses Accepted ADRs from the target repo docs/adr
statusReason: expected [] to deeply equal [ { label: 'ADR-0004', …(4) } ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:48:14
     }
 
     active.push({
-      label: result.adr.number === undefined ? entry.path : `ADR-${formatAdrNumber(result.adr.number)}`,
+      label: false ? entry.path : `ADR-${formatAdrNumber(result.adr.number)}`,
       number: result.adr.number,
       title: result.adr.title,
killedBy: readActiveAdrs labels a numbered ADR as ADR-NNNN and an unnumbered ADR by its path
statusReason: expected [ 'ADR-0004', 'ADR-undefined' ] to deeply equal [ Array(2) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:48:14
     }
 
     active.push({
-      label: result.adr.number === undefined ? entry.path : `ADR-${formatAdrNumber(result.adr.number)}`,
+      label: true ? entry.path : `ADR-${formatAdrNumber(result.adr.number)}`,
       number: result.adr.number,
       title: result.adr.title,
killedBy: readActiveAdrs parses Accepted ADRs from the target repo docs/adr
statusReason: expected [ { …(5) } ] to deeply equal [ { label: 'ADR-0004', …(4) } ]

[Killed] MethodExpression
product/src/architecture/adrs.ts:56:3
     });
   }
 
-  active.sort((a, b) => {
-    if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
-    if (a.number === undefined) return 1;
-    if (b.number === undefined) return -1;
-    if (a.number !== b.number) return a.number - b.number;
-    return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
-  });
+  active;
 
   return active;
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (reverse input order)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] BlockStatement
product/src/architecture/adrs.ts:56:25
     });
   }
 
-  active.sort((a, b) => {
-    if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
-    if (a.number === undefined) return 1;
-    if (b.number === undefined) return -1;
-    if (a.number !== b.number) return a.number - b.number;
-    return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
-  });
+  active.sort((a, b) => {});
 
   return active;
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (reverse input order)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:57:66
   }
 
   active.sort((a, b) => {
-    if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
+    if (a.number === undefined && b.number === undefined) return true ? -1 : a.path > b.path ? 1 : 0;
     if (a.number === undefined) return 1;
     if (b.number === undefined) return -1;
killedBy: readActiveAdrs sorts ascending by number, unnumbered last, ties broken by path
statusReason: expected [ 'docs/adr/0001-first.md', …(3) ] to deeply equal [ 'docs/adr/0001-first.md', …(3) ]

[Killed] EqualityOperator
product/src/architecture/adrs.ts:57:35
   }
 
   active.sort((a, b) => {
-    if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
+    if (a.number === undefined && b.number !== undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
     if (a.number === undefined) return 1;
     if (b.number === undefined) return -1;
killedBy: readActiveAdrs breaks a tie between two unnumbered ADRs by path (reverse input order)
statusReason: expected [ 'docs/adr/b-unnumbered.md', …(1) ] to deeply equal [ 'docs/adr/a-unnumbered.md', …(1) ]

[Killed] EqualityOperator
product/src/architecture/adrs.ts:58:9
 
   active.sort((a, b) => {
     if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
-    if (a.number === undefined) return 1;
+    if (a.number !== undefined) return 1;
     if (b.number === undefined) return -1;
     if (a.number !== b.number) return a.number - b.number;
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (reverse input order)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:58:9
 
   active.sort((a, b) => {
     if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
-    if (a.number === undefined) return 1;
+    if (true) return 1;
     if (b.number === undefined) return -1;
     if (a.number !== b.number) return a.number - b.number;
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (reverse input order)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:59:9
   active.sort((a, b) => {
     if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
     if (a.number === undefined) return 1;
-    if (b.number === undefined) return -1;
+    if (true) return -1;
     if (a.number !== b.number) return a.number - b.number;
     return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: expected [ '## Active decisions', …(4) ] to deeply equal [ '## Active decisions', …(4) ]

[Killed] UnaryOperator
product/src/architecture/adrs.ts:59:40
   active.sort((a, b) => {
     if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
     if (a.number === undefined) return 1;
-    if (b.number === undefined) return -1;
+    if (b.number === undefined) return +1;
     if (a.number !== b.number) return a.number - b.number;
     return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
killedBy: readActiveAdrs sorts a numbered ADR ahead of an unnumbered one regardless of comparator argument order
statusReason: expected [ 'docs/adr/unnumbered.md', …(1) ] to deeply equal [ 'docs/adr/0001-x.md', …(1) ]

[Killed] EqualityOperator
product/src/architecture/adrs.ts:60:9
     if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
     if (a.number === undefined) return 1;
     if (b.number === undefined) return -1;
-    if (a.number !== b.number) return a.number - b.number;
+    if (a.number === b.number) return a.number - b.number;
     return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
   });
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (reverse input order)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:60:9
     if (a.number === undefined && b.number === undefined) return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
     if (a.number === undefined) return 1;
     if (b.number === undefined) return -1;
-    if (a.number !== b.number) return a.number - b.number;
+    if (true) return a.number - b.number;
     return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
   });
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (reverse input order)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] EqualityOperator
product/src/architecture/adrs.ts:61:12
     if (a.number === undefined) return 1;
     if (b.number === undefined) return -1;
     if (a.number !== b.number) return a.number - b.number;
-    return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
+    return a.path >= b.path ? -1 : a.path > b.path ? 1 : 0;
   });
 
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (pre-sorted input)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]

[Killed] ConditionalExpression
product/src/architecture/adrs.ts:61:12
     if (a.number === undefined) return 1;
     if (b.number === undefined) return -1;
     if (a.number !== b.number) return a.number - b.number;
-    return a.path < b.path ? -1 : a.path > b.path ? 1 : 0;
+    return true ? -1 : a.path > b.path ? 1 : 0;
   });
 
killedBy: readActiveAdrs breaks a tie between two ADRs sharing a number by path (pre-sorted input)
statusReason: expected [ 'docs/adr/0001-b.md', …(1) ] to deeply equal [ 'docs/adr/0001-a.md', …(1) ]
