[Killed] BlockStatement
product/src/architecture/critic.ts:67:73
   scoreHistory: readonly number[];
 }
 
-function resolveMaxIterations(options: EpicDesignCriticOptions): number {
-  const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
-    throw new Error('epic-design critic: maxIterations must be a non-negative integer');
-  }
-  return maxIterations;
-}
+function resolveMaxIterations(options: EpicDesignCriticOptions): number {}
 
 /** Five equally-weighted checks against the approved intent doc and the active ADRs. Pure, deterministic. */
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: expected 'max-iterations' to be 'passed' // Object.is equality

[Killed] LogicalOperator
product/src/architecture/critic.ts:68:25
 }
 
 function resolveMaxIterations(options: EpicDesignCriticOptions): number {
-  const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
+  const maxIterations = options.maxIterations && DEFAULT_MAX_REWORK_ITERATIONS;
   if (!Number.isInteger(maxIterations) || maxIterations < 0) {
     throw new Error('epic-design critic: maxIterations must be a non-negative integer');
killedBy: runEpicDesignCritic returns immediately with iterations: 0 and stopReason "passed" for an already-passing architecture
statusReason: epic-design critic: maxIterations must be a non-negative integer

[Killed] BooleanLiteral
product/src/architecture/critic.ts:69:7
 
 function resolveMaxIterations(options: EpicDesignCriticOptions): number {
   const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
+  if (Number.isInteger(maxIterations) || maxIterations < 0) {
     throw new Error('epic-design critic: maxIterations must be a non-negative integer');
   }
killedBy: runEpicDesignCritic returns immediately with iterations: 0 and stopReason "passed" for an already-passing architecture
statusReason: epic-design critic: maxIterations must be a non-negative integer

[Killed] ConditionalExpression
product/src/architecture/critic.ts:69:7
 
 function resolveMaxIterations(options: EpicDesignCriticOptions): number {
   const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
+  if (false) {
     throw new Error('epic-design critic: maxIterations must be a non-negative integer');
   }
killedBy: runEpicDesignCritic throws the exact message for a negative maxIterations
statusReason: promise resolved "{ architecture: { …(3) }, …(4) }" instead of rejecting

[Killed] BooleanLiteral
product/src/architecture/critic.ts:81:62
   doc: IntentDoc,
   adrs: readonly EpicAdr[],
 ): CriticVerdict {
-  const missing = adrs.map((a) => a.label).filter((label) => !architecture.constraints.some((c) => c.adr === label));
+  const missing = adrs.map((a) => a.label).filter((label) => architecture.constraints.some(c => c.adr === label));
 
   const conflicts: { deviation: ArchitectureDecision; backing: EpicAdr }[] = [];
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
product/src/architecture/critic.ts:81:100
   doc: IntentDoc,
   adrs: readonly EpicAdr[],
 ): CriticVerdict {
-  const missing = adrs.map((a) => a.label).filter((label) => !architecture.constraints.some((c) => c.adr === label));
+  const missing = adrs.map((a) => a.label).filter((label) => !architecture.constraints.some((c) => c.adr !== label));
 
   const conflicts: { deviation: ArchitectureDecision; backing: EpicAdr }[] = [];
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
product/src/architecture/critic.ts:84:52
   const missing = adrs.map((a) => a.label).filter((label) => !architecture.constraints.some((c) => c.adr === label));
 
   const conflicts: { deviation: ArchitectureDecision; backing: EpicAdr }[] = [];
-  for (const deviation of architecture.deviations) {
-    const backing = findBackingAdr(deviation.subject, adrs);
-    if (backing !== undefined) {
-      conflicts.push({ deviation, backing });
-    }
-  }
+  for (const deviation of architecture.deviations) {}
 
   const undeclared = architecture.deviations.filter(
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:86:9
   const conflicts: { deviation: ArchitectureDecision; backing: EpicAdr }[] = [];
   for (const deviation of architecture.deviations) {
     const backing = findBackingAdr(deviation.subject, adrs);
-    if (backing !== undefined) {
+    if (true) {
       conflicts.push({ deviation, backing });
     }
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] ConditionalExpression
product/src/architecture/critic.ts:86:9
   const conflicts: { deviation: ArchitectureDecision; backing: EpicAdr }[] = [];
   for (const deviation of architecture.deviations) {
     const backing = findBackingAdr(deviation.subject, adrs);
-    if (backing !== undefined) {
+    if (false) {
       conflicts.push({ deviation, backing });
     }
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
product/src/architecture/critic.ts:87:22
   for (const deviation of architecture.deviations) {
     const backing = findBackingAdr(deviation.subject, adrs);
     if (backing !== undefined) {
-      conflicts.push({ deviation, backing });
+      conflicts.push({});
     }
   }
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: Cannot read properties of undefined (reading 'text')

[Survived] MethodExpression
product/src/architecture/critic.ts:91:22
     }
   }
 
-  const undeclared = architecture.deviations.filter(
-    (d) => !architecture.artifact.openQuestions.includes(`needs a new ADR: ${d.text}`),
-  );
+  const undeclared = architecture.deviations;
 
   const checks: readonly RubricCheck[] = [

[Killed] BooleanLiteral
product/src/architecture/critic.ts:92:12
   }
 
   const undeclared = architecture.deviations.filter(
-    (d) => !architecture.artifact.openQuestions.includes(`needs a new ADR: ${d.text}`),
+    (d) => architecture.artifact.openQuestions.includes(`needs a new ADR: ${d.text}`),
   );
 
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: expected 'pass' to be 'rework' // Object.is equality

[Killed] ArrowFunction
product/src/architecture/critic.ts:92:5
   }
 
   const undeclared = architecture.deviations.filter(
-    (d) => !architecture.artifact.openQuestions.includes(`needs a new ADR: ${d.text}`),
+    () => undefined,
   );
 
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: expected 'pass' to be 'rework' // Object.is equality

[Killed] ObjectLiteral
product/src/architecture/critic.ts:96:5
   );
 
   const checks: readonly RubricCheck[] = [
-    {
-      id: 'intent-approved',
-      label: 'The intent doc is approved (human gate #1)',
-      passed: doc.status === 'approved',
-      note:
-        doc.status === 'approved'
-          ? 'the intent doc is approved'
-          : 'the intent doc is a draft — the critic needs human gate #1',
-    },
+    {},
     {
       id: 'adrs-covered',
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Survived] StringLiteral
product/src/architecture/critic.ts:98:14
   const checks: readonly RubricCheck[] = [
     {
       id: 'intent-approved',
-      label: 'The intent doc is approved (human gate #1)',
+      label: "",
       passed: doc.status === 'approved',
       note:

[Killed] ConditionalExpression
product/src/architecture/critic.ts:99:15
     {
       id: 'intent-approved',
       label: 'The intent doc is approved (human gate #1)',
-      passed: doc.status === 'approved',
+      passed: false,
       note:
         doc.status === 'approved'
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ConditionalExpression
product/src/architecture/critic.ts:99:15
     {
       id: 'intent-approved',
       label: 'The intent doc is approved (human gate #1)',
-      passed: doc.status === 'approved',
+      passed: true,
       note:
         doc.status === 'approved'
killedBy: critiqueEpicArchitecture fails intent-approved alone on a draft doc
statusReason: expected 'pass' to be 'rework' // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:101:9
       label: 'The intent doc is approved (human gate #1)',
       passed: doc.status === 'approved',
       note:
-        doc.status === 'approved'
+        true
           ? 'the intent doc is approved'
           : 'the intent doc is a draft — the critic needs human gate #1',
killedBy: critiqueEpicArchitecture fails intent-approved alone on a draft doc
statusReason: expected 'the intent doc is approved' to be 'the intent doc is a draft — the criti…' // Object.is equality

[Killed] EqualityOperator
product/src/architecture/critic.ts:101:9
       label: 'The intent doc is approved (human gate #1)',
       passed: doc.status === 'approved',
       note:
-        doc.status === 'approved'
+        doc.status !== 'approved'
           ? 'the intent doc is approved'
           : 'the intent doc is a draft — the critic needs human gate #1',
killedBy: critiqueEpicArchitecture fails intent-approved alone on a draft doc
statusReason: expected 'the intent doc is approved' to be 'the intent doc is a draft — the criti…' // Object.is equality

[Survived] StringLiteral
product/src/architecture/critic.ts:102:13
       passed: doc.status === 'approved',
       note:
         doc.status === 'approved'
-          ? 'the intent doc is approved'
+          ? ""
           : 'the intent doc is a draft — the critic needs human gate #1',
     },

[Killed] ObjectLiteral
product/src/architecture/critic.ts:105:5
           ? 'the intent doc is approved'
           : 'the intent doc is a draft — the critic needs human gate #1',
     },
-    {
-      id: 'adrs-covered',
-      label: 'Every active ADR is carried as a constraint',
-      passed: missing.length === 0,
-      note:
-        missing.length === 0
-          ? 'every active ADR is carried as a constraint'
-          : `active ADRs missing from the constraints: ${missing.join(', ')}`,
-    },
+    {},
     {
       id: 'no-adr-conflicts',
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected undefined to be false // Object.is equality

[Killed] StringLiteral
product/src/architecture/critic.ts:106:11
           : 'the intent doc is a draft — the critic needs human gate #1',
     },
     {
-      id: 'adrs-covered',
+      id: "",
       label: 'Every active ADR is carried as a constraint',
       passed: missing.length === 0,
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
product/src/architecture/critic.ts:107:14
     },
     {
       id: 'adrs-covered',
-      label: 'Every active ADR is carried as a constraint',
+      label: "",
       passed: missing.length === 0,
       note:

[Killed] EqualityOperator
product/src/architecture/critic.ts:108:15
     {
       id: 'adrs-covered',
       label: 'Every active ADR is carried as a constraint',
-      passed: missing.length === 0,
+      passed: missing.length !== 0,
       note:
         missing.length === 0
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:108:15
     {
       id: 'adrs-covered',
       label: 'Every active ADR is carried as a constraint',
-      passed: missing.length === 0,
+      passed: false,
       note:
         missing.length === 0
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Survived] EqualityOperator
product/src/architecture/critic.ts:110:9
       label: 'Every active ADR is carried as a constraint',
       passed: missing.length === 0,
       note:
-        missing.length === 0
+        missing.length !== 0
           ? 'every active ADR is carried as a constraint'
           : `active ADRs missing from the constraints: ${missing.join(', ')}`,

[Survived] ConditionalExpression
product/src/architecture/critic.ts:110:9
       label: 'Every active ADR is carried as a constraint',
       passed: missing.length === 0,
       note:
-        missing.length === 0
+        false
           ? 'every active ADR is carried as a constraint'
           : `active ADRs missing from the constraints: ${missing.join(', ')}`,

[Killed] ConditionalExpression
product/src/architecture/critic.ts:117:15
     {
       id: 'no-adr-conflicts',
       label: 'No deviation re-decides ground an active ADR covers',
-      passed: conflicts.length === 0,
+      passed: false,
       note:
         conflicts.length === 0
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ConditionalExpression
product/src/architecture/critic.ts:117:15
     {
       id: 'no-adr-conflicts',
       label: 'No deviation re-decides ground an active ADR covers',
-      passed: conflicts.length === 0,
+      passed: true,
       note:
         conflicts.length === 0
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected true to be false // Object.is equality

[Survived] EqualityOperator
product/src/architecture/critic.ts:119:9
       label: 'No deviation re-decides ground an active ADR covers',
       passed: conflicts.length === 0,
       note:
-        conflicts.length === 0
+        conflicts.length !== 0
           ? 'no deviation re-decides ground an active ADR covers'
           : conflicts.map((c) => `"${c.deviation.text}" conflicts with ${c.backing.label}`).join('; '),

[Survived] ConditionalExpression
product/src/architecture/critic.ts:119:9
       label: 'No deviation re-decides ground an active ADR covers',
       passed: conflicts.length === 0,
       note:
-        conflicts.length === 0
+        true
           ? 'no deviation re-decides ground an active ADR covers'
           : conflicts.map((c) => `"${c.deviation.text}" conflicts with ${c.backing.label}`).join('; '),

[Survived] StringLiteral
product/src/architecture/critic.ts:120:13
       passed: conflicts.length === 0,
       note:
         conflicts.length === 0
-          ? 'no deviation re-decides ground an active ADR covers'
+          ? ""
           : conflicts.map((c) => `"${c.deviation.text}" conflicts with ${c.backing.label}`).join('; '),
     },

[Survived] ArrowFunction
product/src/architecture/critic.ts:121:27
       note:
         conflicts.length === 0
           ? 'no deviation re-decides ground an active ADR covers'
-          : conflicts.map((c) => `"${c.deviation.text}" conflicts with ${c.backing.label}`).join('; '),
+          : conflicts.map(() => undefined).join('; '),
     },
     {

[Survived] StringLiteral
product/src/architecture/critic.ts:121:98
       note:
         conflicts.length === 0
           ? 'no deviation re-decides ground an active ADR covers'
-          : conflicts.map((c) => `"${c.deviation.text}" conflicts with ${c.backing.label}`).join('; '),
+          : conflicts.map((c) => `"${c.deviation.text}" conflicts with ${c.backing.label}`).join(""),
     },
     {

[Killed] ConditionalExpression
product/src/architecture/critic.ts:126:15
     {
       id: 'deviations-declared',
       label: 'Every deviation is declared as an open question',
-      passed: undeclared.length === 0,
+      passed: true,
       note:
         undeclared.length === 0
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: expected 'pass' to be 'rework' // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:126:15
     {
       id: 'deviations-declared',
       label: 'Every deviation is declared as an open question',
-      passed: undeclared.length === 0,
+      passed: false,
       note:
         undeclared.length === 0
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] EqualityOperator
product/src/architecture/critic.ts:128:9
       label: 'Every deviation is declared as an open question',
       passed: undeclared.length === 0,
       note:
-        undeclared.length === 0
+        undeclared.length !== 0
           ? 'every deviation is declared as an open question'
           : `deviations not declared as open questions: ${undeclared.map((d) => d.text).join(', ')}`,
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: expected 'every deviation is declared as an ope…' to contain 'change component widget (packages/wid…'

[Killed] ConditionalExpression
product/src/architecture/critic.ts:128:9
       label: 'Every deviation is declared as an open question',
       passed: undeclared.length === 0,
       note:
-        undeclared.length === 0
+        true
           ? 'every deviation is declared as an open question'
           : `deviations not declared as open questions: ${undeclared.map((d) => d.text).join(', ')}`,
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: expected 'every deviation is declared as an ope…' to contain 'change component widget (packages/wid…'

[Survived] StringLiteral
product/src/architecture/critic.ts:129:13
       passed: undeclared.length === 0,
       note:
         undeclared.length === 0
-          ? 'every deviation is declared as an open question'
+          ? ""
           : `deviations not declared as open questions: ${undeclared.map((d) => d.text).join(', ')}`,
     },

[Killed] ArrowFunction
product/src/architecture/critic.ts:130:74
       note:
         undeclared.length === 0
           ? 'every deviation is declared as an open question'
-          : `deviations not declared as open questions: ${undeclared.map((d) => d.text).join(', ')}`,
+          : `deviations not declared as open questions: ${undeclared.map(() => undefined).join(', ')}`,
     },
     {
killedBy: critiqueEpicArchitecture fails deviations-declared alone when a deviation is missing its open-question line
statusReason: expected 'deviations not declared as open quest…' to contain 'change component widget (packages/wid…'

[Killed] ObjectLiteral
product/src/architecture/critic.ts:132:5
           ? 'every deviation is declared as an open question'
           : `deviations not declared as open questions: ${undeclared.map((d) => d.text).join(', ')}`,
     },
-    {
-      id: 'verification-planned',
-      label: 'The architecture carries a non-empty verification plan',
-      passed: architecture.artifact.verificationPlan.length > 0,
-      note:
-        architecture.artifact.verificationPlan.length > 0
-          ? 'the architecture carries a non-empty verification plan'
-          : 'verificationPlan is empty',
-    },
+    {},
   ];
 
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Survived] StringLiteral
product/src/architecture/critic.ts:134:14
     },
     {
       id: 'verification-planned',
-      label: 'The architecture carries a non-empty verification plan',
+      label: "",
       passed: architecture.artifact.verificationPlan.length > 0,
       note:

[Killed] EqualityOperator
product/src/architecture/critic.ts:135:15
     {
       id: 'verification-planned',
       label: 'The architecture carries a non-empty verification plan',
-      passed: architecture.artifact.verificationPlan.length > 0,
+      passed: architecture.artifact.verificationPlan.length <= 0,
       note:
         architecture.artifact.verificationPlan.length > 0
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ConditionalExpression
product/src/architecture/critic.ts:135:15
     {
       id: 'verification-planned',
       label: 'The architecture carries a non-empty verification plan',
-      passed: architecture.artifact.verificationPlan.length > 0,
+      passed: false,
       note:
         architecture.artifact.verificationPlan.length > 0
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 80, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ConditionalExpression
product/src/architecture/critic.ts:137:9
       label: 'The architecture carries a non-empty verification plan',
       passed: architecture.artifact.verificationPlan.length > 0,
       note:
-        architecture.artifact.verificationPlan.length > 0
+        true
           ? 'the architecture carries a non-empty verification plan'
           : 'verificationPlan is empty',
killedBy: critiqueEpicArchitecture fails verification-planned alone on an architecture with an empty verification plan
statusReason: expected 'the architecture carries a non-empty …' to be 'verificationPlan is empty' // Object.is equality

[Killed] EqualityOperator
product/src/architecture/critic.ts:137:9
       label: 'The architecture carries a non-empty verification plan',
       passed: architecture.artifact.verificationPlan.length > 0,
       note:
-        architecture.artifact.verificationPlan.length > 0
+        architecture.artifact.verificationPlan.length <= 0
           ? 'the architecture carries a non-empty verification plan'
           : 'verificationPlan is empty',
killedBy: critiqueEpicArchitecture fails verification-planned alone on an architecture with an empty verification plan
statusReason: expected 'the architecture carries a non-empty …' to be 'verificationPlan is empty' // Object.is equality

[Survived] StringLiteral
product/src/architecture/critic.ts:138:13
       passed: architecture.artifact.verificationPlan.length > 0,
       note:
         architecture.artifact.verificationPlan.length > 0
-          ? 'the architecture carries a non-empty verification plan'
+          ? ""
           : 'verificationPlan is empty',
     },

[Killed] MethodExpression
product/src/architecture/critic.ts:143:23
     },
   ];
 
-  const passedCount = checks.filter((c) => c.passed).length;
+  const passedCount = checks.length;
   const score = Math.round((passedCount / checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
killedBy: critiqueEpicArchitecture fails intent-approved alone on a draft doc
statusReason: expected 100 to be 80 // Object.is equality

[Killed] ArrowFunction
product/src/architecture/critic.ts:143:37
     },
   ];
 
-  const passedCount = checks.filter((c) => c.passed).length;
+  const passedCount = checks.filter(() => undefined).length;
   const score = Math.round((passedCount / checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'pass', score: +0, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ArithmeticOperator
product/src/architecture/critic.ts:144:29
   ];
 
   const passedCount = checks.filter((c) => c.passed).length;
-  const score = Math.round((passedCount / checks.length) * 100);
+  const score = Math.round((passedCount * checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'pass', score: 2500, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ArithmeticOperator
product/src/architecture/critic.ts:144:28
   ];
 
   const passedCount = checks.filter((c) => c.passed).length;
-  const score = Math.round((passedCount / checks.length) * 100);
+  const score = Math.round(passedCount / checks.length / 100);
   const failed = checks.filter((c) => !c.passed);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'pass', score: +0, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ArrowFunction
product/src/architecture/critic.ts:145:32
 
   const passedCount = checks.filter((c) => c.passed).length;
   const score = Math.round((passedCount / checks.length) * 100);
-  const failed = checks.filter((c) => !c.passed);
+  const failed = checks.filter(() => undefined);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected 'pass' to be 'rework' // Object.is equality

[Killed] MethodExpression
product/src/architecture/critic.ts:145:18
 
   const passedCount = checks.filter((c) => c.passed).length;
   const score = Math.round((passedCount / checks.length) * 100);
-  const failed = checks.filter((c) => !c.passed);
+  const failed = checks;
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 100, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ConditionalExpression
product/src/architecture/critic.ts:146:45
   const passedCount = checks.filter((c) => c.passed).length;
   const score = Math.round((passedCount / checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
-  const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
+  const verdict: CriticVerdict['verdict'] = true ? 'pass' : 'rework';
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
   const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected 'pass' to be 'rework' // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:146:45
   const passedCount = checks.filter((c) => c.passed).length;
   const score = Math.round((passedCount / checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
-  const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
+  const verdict: CriticVerdict['verdict'] = false ? 'pass' : 'rework';
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
   const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'rework', score: 100, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }
