[Killed] EqualityOperator
product/src/architecture/critic.ts:147:21
   const score = Math.round((passedCount / checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
-  const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
+  const rationale = failed.length !== 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
   const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
 
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'pass', score: 100, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] ConditionalExpression
product/src/architecture/critic.ts:147:21
   const score = Math.round((passedCount / checks.length) * 100);
   const failed = checks.filter((c) => !c.passed);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
-  const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
+  const rationale = false ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
   const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
 
killedBy: critiqueEpicArchitecture passes an architecture designed against the same active-ADR set
statusReason: expected { verdict: 'pass', score: 100, …(3) } to deeply equal { verdict: 'pass', score: 100, …(3) }

[Killed] MethodExpression
product/src/architecture/critic.ts:148:24
   const failed = checks.filter((c) => !c.passed);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
-  const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
+  const violatedAdrs = [...new Set([...missing, ...conflicts.map(c => c.backing.label)])];
 
   return { verdict, score, rationale, checks, violatedAdrs };
killedBy: critiqueEpicArchitecture returns violatedAdrs sorted, deduped across missing and conflicting ADRs
statusReason: expected [ 'ADR-0009', 'ADR-0001' ] to deeply equal [ 'ADR-0001', 'ADR-0009' ]

[Survived] ArrowFunction
product/src/architecture/critic.ts:148:66
   const failed = checks.filter((c) => !c.passed);
   const verdict: CriticVerdict['verdict'] = failed.length === 0 ? 'pass' : 'rework';
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
-  const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
+  const violatedAdrs = [...new Set([...missing, ...conflicts.map(() => undefined)])].sort();
 
   return { verdict, score, rationale, checks, violatedAdrs };

[Killed] ObjectLiteral
product/src/architecture/critic.ts:150:10
   const rationale = failed.length === 0 ? `All ${checks.length} checks passed.` : failed.map((c) => c.note).join('; ');
   const violatedAdrs = [...new Set([...missing, ...conflicts.map((c) => c.backing.label)])].sort();
 
-  return { verdict, score, rationale, checks, violatedAdrs };
+  return {};
 }
 
killedBy: critiqueEpicArchitecture the Gherkin scenario: an architecture ignoring an active ADR gets rework, naming the ADR
statusReason: expected undefined to be 'rework' // Object.is equality

[Killed] BooleanLiteral
product/src/architecture/critic.ts:160:58
   _doc: IntentDoc,
   adrs: readonly EpicAdr[],
 ): EpicArchitecture {
-  const failedIds = new Set(verdict.checks.filter((c) => !c.passed).map((c) => c.id));
+  const failedIds = new Set(verdict.checks.filter((c) => c.passed).map((c) => c.id));
   const fixable = ['adrs-covered', 'no-adr-conflicts', 'deviations-declared'];
   if (!fixable.some((id) => failedIds.has(id))) {
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ { subject: 'widget', …(1) } ] to deeply equal []

[Killed] MethodExpression
product/src/architecture/critic.ts:160:29
   _doc: IntentDoc,
   adrs: readonly EpicAdr[],
 ): EpicArchitecture {
-  const failedIds = new Set(verdict.checks.filter((c) => !c.passed).map((c) => c.id));
+  const failedIds = new Set(verdict.checks.map((c) => c.id));
   const fixable = ['adrs-covered', 'no-adr-conflicts', 'deviations-declared'];
   if (!fixable.some((id) => failedIds.has(id))) {
killedBy: reworkArchitectureMechanically leaves the architecture unchanged (same reference) when only unfixable checks fail
statusReason: expected { artifact: { …(10) }, …(2) } to be { artifact: { …(10) }, …(2) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { artifact: { …(10) }, …(2) }
Received: serializes to the same string

[Killed] ConditionalExpression
product/src/architecture/critic.ts:162:7
 ): EpicArchitecture {
   const failedIds = new Set(verdict.checks.filter((c) => !c.passed).map((c) => c.id));
   const fixable = ['adrs-covered', 'no-adr-conflicts', 'deviations-declared'];
-  if (!fixable.some((id) => failedIds.has(id))) {
+  if (false) {
     return architecture;
   }
killedBy: reworkArchitectureMechanically leaves the architecture unchanged (same reference) when only unfixable checks fail
statusReason: expected { artifact: { …(10) }, …(2) } to be { artifact: { …(10) }, …(2) } // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: { artifact: { …(10) }, …(2) }
Received: serializes to the same string

[Killed] MethodExpression
product/src/architecture/critic.ts:162:8
 ): EpicArchitecture {
   const failedIds = new Set(verdict.checks.filter((c) => !c.passed).map((c) => c.id));
   const fixable = ['adrs-covered', 'no-adr-conflicts', 'deviations-declared'];
-  if (!fixable.some((id) => failedIds.has(id))) {
+  if (!fixable.every(id => failedIds.has(id))) {
     return architecture;
   }
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected { artifact: { …(10) }, …(2) } not to be { artifact: { …(10) }, …(2) } // Object.is equality

[Killed] ArrayDeclaration
product/src/architecture/critic.ts:166:21
     return architecture;
   }
 
-  let constraints = [...architecture.constraints];
+  let constraints = [];
   let deviations = [...architecture.deviations];
 
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
product/src/architecture/critic.ts:169:42
   let constraints = [...architecture.constraints];
   let deviations = [...architecture.deviations];
 
-  if (failedIds.has('no-adr-conflicts')) {
-    deviations = deviations.filter((d) => {
-      const backing = findBackingAdr(d.subject, adrs);
-      if (backing === undefined) {
-        return true;
-      }
-      constraints = constraints.map((c) =>
-        c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
-      );
-      return false;
-    });
-  }
+  if (failedIds.has('no-adr-conflicts')) {}
 
   if (failedIds.has('adrs-covered')) {
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ { subject: 'widget', …(1) } ] to deeply equal []

[Killed] ConditionalExpression
product/src/architecture/critic.ts:169:7
   let constraints = [...architecture.constraints];
   let deviations = [...architecture.deviations];
 
-  if (failedIds.has('no-adr-conflicts')) {
+  if (false) {
     deviations = deviations.filter((d) => {
       const backing = findBackingAdr(d.subject, adrs);
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ { subject: 'widget', …(1) } ] to deeply equal []

[Killed] MethodExpression
product/src/architecture/critic.ts:170:18
   let deviations = [...architecture.deviations];
 
   if (failedIds.has('no-adr-conflicts')) {
-    deviations = deviations.filter((d) => {
-      const backing = findBackingAdr(d.subject, adrs);
-      if (backing === undefined) {
-        return true;
-      }
-      constraints = constraints.map((c) =>
-        c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
-      );
-      return false;
-    });
+    deviations = deviations;
   }
 
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ { subject: 'widget', …(1) } ] to deeply equal []

[Killed] BlockStatement
product/src/architecture/critic.ts:170:43
   let deviations = [...architecture.deviations];
 
   if (failedIds.has('no-adr-conflicts')) {
-    deviations = deviations.filter((d) => {
-      const backing = findBackingAdr(d.subject, adrs);
-      if (backing === undefined) {
-        return true;
-      }
-      constraints = constraints.map((c) =>
-        c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
-      );
-      return false;
-    });
+    deviations = deviations.filter((d) => {});
   }
 
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:172:11
   if (failedIds.has('no-adr-conflicts')) {
     deviations = deviations.filter((d) => {
       const backing = findBackingAdr(d.subject, adrs);
-      if (backing === undefined) {
+      if (false) {
         return true;
       }
killedBy: reworkArchitectureMechanically fixes only the deviation an active ADR backs, leaving an unbacked deviation declared
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] BlockStatement
product/src/architecture/critic.ts:172:34
   if (failedIds.has('no-adr-conflicts')) {
     deviations = deviations.filter((d) => {
       const backing = findBackingAdr(d.subject, adrs);
-      if (backing === undefined) {
-        return true;
-      }
+      if (backing === undefined) {}
       constraints = constraints.map((c) =>
         c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
killedBy: reworkArchitectureMechanically fixes only the deviation an active ADR backs, leaving an unbacked deviation declared
statusReason: Cannot read properties of undefined (reading 'label')

[Killed] BooleanLiteral
product/src/architecture/critic.ts:173:16
     deviations = deviations.filter((d) => {
       const backing = findBackingAdr(d.subject, adrs);
       if (backing === undefined) {
-        return true;
+        return false;
       }
       constraints = constraints.map((c) =>
killedBy: reworkArchitectureMechanically fixes only the deviation an active ADR backs, leaving an unbacked deviation declared
statusReason: expected [] to deeply equal [ { …(2) } ]

[Killed] ArrowFunction
product/src/architecture/critic.ts:175:37
       if (backing === undefined) {
         return true;
       }
-      constraints = constraints.map((c) =>
-        c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
+      constraints = constraints.map(() => undefined,
       );
       return false;
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: Cannot read properties of undefined (reading 'adr')

[Killed] EqualityOperator
product/src/architecture/critic.ts:176:9
         return true;
       }
       constraints = constraints.map((c) =>
-        c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
+        c.text !== d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
       );
       return false;
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:176:9
         return true;
       }
       constraints = constraints.map((c) =>
-        c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
+        false ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
       );
       return false;
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
product/src/architecture/critic.ts:178:14
       constraints = constraints.map((c) =>
         c.text === d.text && c.adr === undefined ? { text: `${d.text} (per ${backing.label})`, adr: backing.label } : c,
       );
-      return false;
+      return true;
     });
   }
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ { subject: 'widget', …(1) } ] to deeply equal []

[Survived] ConditionalExpression
product/src/architecture/critic.ts:182:7
     });
   }
 
-  if (failedIds.has('adrs-covered')) {
+  if (true) {
     const missingAdrs = adrs.filter((adr) => !constraints.some((c) => c.adr === adr.label));
     constraints = [...missingAdrs.map(adrConstraintOf), ...constraints];

[Survived] ConditionalExpression
product/src/architecture/critic.ts:182:7
     });
   }
 
-  if (failedIds.has('adrs-covered')) {
+  if (false) {
     const missingAdrs = adrs.filter((adr) => !constraints.some((c) => c.adr === adr.label));
     constraints = [...missingAdrs.map(adrConstraintOf), ...constraints];

[Survived] ConditionalExpression
product/src/architecture/critic.ts:183:71
   }
 
   if (failedIds.has('adrs-covered')) {
-    const missingAdrs = adrs.filter((adr) => !constraints.some((c) => c.adr === adr.label));
+    const missingAdrs = adrs.filter((adr) => !constraints.some((c) => true));
     constraints = [...missingAdrs.map(adrConstraintOf), ...constraints];
   }

[Survived] EqualityOperator
product/src/architecture/critic.ts:183:71
   }
 
   if (failedIds.has('adrs-covered')) {
-    const missingAdrs = adrs.filter((adr) => !constraints.some((c) => c.adr === adr.label));
+    const missingAdrs = adrs.filter((adr) => !constraints.some((c) => c.adr !== adr.label));
     constraints = [...missingAdrs.map(adrConstraintOf), ...constraints];
   }

[Killed] ArrowFunction
product/src/architecture/critic.ts:187:44
     constraints = [...missingAdrs.map(adrConstraintOf), ...constraints];
   }
 
-  const behaviorContract = constraints.map((c: ArchitectureConstraint) => c.text);
+  const behaviorContract = constraints.map(() => undefined);
   const openQuestions = [
     ...architecture.artifact.openQuestions.filter((q) => !q.startsWith('needs a new ADR: ')),
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: [
  {
    "expected": "string",
    "code": "invalid_type",
    "path": [
      "behaviorContract",
      0
    ],

[Killed] BooleanLiteral
product/src/architecture/critic.ts:189:58
 
   const behaviorContract = constraints.map((c: ArchitectureConstraint) => c.text);
   const openQuestions = [
-    ...architecture.artifact.openQuestions.filter((q) => !q.startsWith('needs a new ADR: ')),
+    ...architecture.artifact.openQuestions.filter((q) => q.startsWith('needs a new ADR: ')),
     ...deviations.map((d) => `needs a new ADR: ${d.text}`),
   ];
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] MethodExpression
product/src/architecture/critic.ts:189:8
 
   const behaviorContract = constraints.map((c: ArchitectureConstraint) => c.text);
   const openQuestions = [
-    ...architecture.artifact.openQuestions.filter((q) => !q.startsWith('needs a new ADR: ')),
+    ...architecture.artifact.openQuestions,
     ...deviations.map((d) => `needs a new ADR: ${d.text}`),
   ];
killedBy: reworkArchitectureMechanically fixes the ADR conflict and ADR coverage on the Gherkin architecture, rebuilding the artifact consistently
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] ArrowFunction
product/src/architecture/critic.ts:190:23
   const behaviorContract = constraints.map((c: ArchitectureConstraint) => c.text);
   const openQuestions = [
     ...architecture.artifact.openQuestions.filter((q) => !q.startsWith('needs a new ADR: ')),
-    ...deviations.map((d) => `needs a new ADR: ${d.text}`),
+    ...deviations.map(() => undefined),
   ];
   const artifact = DesignArtifactSchema.parse({ ...architecture.artifact, behaviorContract, openQuestions });
killedBy: reworkArchitectureMechanically fixes only the deviation an active ADR backs, leaving an unbacked deviation declared
statusReason: [
  {
    "expected": "string",
    "code": "invalid_type",
    "path": [
      "openQuestions",
      0
    ],

[Killed] StringLiteral
product/src/architecture/critic.ts:190:30
   const behaviorContract = constraints.map((c: ArchitectureConstraint) => c.text);
   const openQuestions = [
     ...architecture.artifact.openQuestions.filter((q) => !q.startsWith('needs a new ADR: ')),
-    ...deviations.map((d) => `needs a new ADR: ${d.text}`),
+    ...deviations.map((d) => ``),
   ];
   const artifact = DesignArtifactSchema.parse({ ...architecture.artifact, behaviorContract, openQuestions });
killedBy: reworkArchitectureMechanically fixes only the deviation an active ADR backs, leaving an unbacked deviation declared
statusReason: expected [ '' ] to deeply equal [ Array(1) ]

[Killed] LogicalOperator
product/src/architecture/critic.ts:209:18
   deps: EpicDesignCriticDeps = {},
   options: EpicDesignCriticOptions = {},
 ): Promise<EpicDesignCritique> {
-  const critic = deps.critic ?? critiqueEpicArchitecture;
+  const critic = deps.critic && critiqueEpicArchitecture;
   const rework = deps.rework ?? reworkArchitectureMechanically;
   const maxIterations = resolveMaxIterations(options);
killedBy: runEpicDesignCritic returns immediately with iterations: 0 and stopReason "passed" for an already-passing architecture
statusReason: critic is not a function

[Killed] LogicalOperator
product/src/architecture/critic.ts:210:18
   options: EpicDesignCriticOptions = {},
 ): Promise<EpicDesignCritique> {
   const critic = deps.critic ?? critiqueEpicArchitecture;
-  const rework = deps.rework ?? reworkArchitectureMechanically;
+  const rework = deps.rework && reworkArchitectureMechanically;
   const maxIterations = resolveMaxIterations(options);
 
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: rework is not a function

[Killed] ConditionalExpression
product/src/architecture/critic.ts:216:7
   let best = { architecture, verdict: await critic(architecture, doc, adrs) };
   const scoreHistory: number[] = [best.verdict.score];
 
-  if (best.verdict.verdict === 'pass') {
+  if (true) {
     return {
       architecture: best.architecture,
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:216:7
   let best = { architecture, verdict: await critic(architecture, doc, adrs) };
   const scoreHistory: number[] = [best.verdict.score];
 
-  if (best.verdict.verdict === 'pass') {
+  if (false) {
     return {
       architecture: best.architecture,
killedBy: runEpicDesignCritic returns immediately with iterations: 0 and stopReason "passed" for an already-passing architecture
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ObjectLiteral
product/src/architecture/critic.ts:217:12
   const scoreHistory: number[] = [best.verdict.score];
 
   if (best.verdict.verdict === 'pass') {
-    return {
-      architecture: best.architecture,
-      verdict: best.verdict,
-      iterations: 0,
-      stopReason: 'passed',
-      scoreHistory,
-    };
+    return {};
   }
 
killedBy: runEpicDesignCritic returns immediately with iterations: 0 and stopReason "passed" for an already-passing architecture
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:226:19
     };
   }
 
-  for (let i = 1; i <= maxIterations; i++) {
+  for (let i = 1; false; i++) {
     const candidate = await rework(best.architecture, best.verdict, doc, adrs);
     const verdict = await critic(candidate, doc, adrs);
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: expected 'max-iterations' to be 'passed' // Object.is equality

[Killed] EqualityOperator
product/src/architecture/critic.ts:226:19
     };
   }
 
-  for (let i = 1; i <= maxIterations; i++) {
+  for (let i = 1; i < maxIterations; i++) {
     const candidate = await rework(best.architecture, best.verdict, doc, adrs);
     const verdict = await critic(candidate, doc, adrs);
killedBy: runEpicDesignCritic stops at exactly maxIterations when an adversarial critic keeps "improving" but never passes
statusReason: expected [ 1, 2, 3 ] to deeply equal [ 1, 2, 3, 4 ]

[Killed] CallExpression
product/src/architecture/critic.ts:229:5
   for (let i = 1; i <= maxIterations; i++) {
     const candidate = await rework(best.architecture, best.verdict, doc, adrs);
     const verdict = await critic(candidate, doc, adrs);
-    scoreHistory.push(verdict.score);
+    ;
 
     if (verdict.score <= best.verdict.score) {
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: expected [ 60 ] to have a length of 2 but got 1

[Killed] ConditionalExpression
product/src/architecture/critic.ts:231:9
     const verdict = await critic(candidate, doc, adrs);
     scoreHistory.push(verdict.score);
 
-    if (verdict.score <= best.verdict.score) {
+    if (false) {
       return {
         architecture: best.architecture,
killedBy: runEpicDesignCritic stops with "no-improvement" after one iteration on an unfixable failure, keeping the original best
statusReason: expected 'max-iterations' to be 'no-improvement' // Object.is equality

[Killed] EqualityOperator
product/src/architecture/critic.ts:231:9
     const verdict = await critic(candidate, doc, adrs);
     scoreHistory.push(verdict.score);
 
-    if (verdict.score <= best.verdict.score) {
+    if (verdict.score < best.verdict.score) {
       return {
         architecture: best.architecture,
killedBy: runEpicDesignCritic stops with "no-improvement" after one iteration on an unfixable failure, keeping the original best
statusReason: expected 'max-iterations' to be 'no-improvement' // Object.is equality

[Killed] ConditionalExpression
product/src/architecture/critic.ts:242:9
     }
 
     best = { architecture: candidate, verdict };
-    if (verdict.verdict === 'pass') {
+    if (true) {
       return {
         architecture: best.architecture,
killedBy: runEpicDesignCritic stops at exactly maxIterations when an adversarial critic keeps "improving" but never passes
statusReason: expected 'passed' to be 'max-iterations' // Object.is equality

[Killed] EqualityOperator
product/src/architecture/critic.ts:242:9
     }
 
     best = { architecture: candidate, verdict };
-    if (verdict.verdict === 'pass') {
+    if (verdict.verdict !== 'pass') {
       return {
         architecture: best.architecture,
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: expected 'no-improvement' to be 'passed' // Object.is equality

[Killed] ObjectLiteral
product/src/architecture/critic.ts:243:14
 
     best = { architecture: candidate, verdict };
     if (verdict.verdict === 'pass') {
-      return {
-        architecture: best.architecture,
-        verdict: best.verdict,
-        iterations: i,
-        stopReason: 'passed',
-        scoreHistory,
-      };
+      return {};
     }
   }
killedBy: runEpicDesignCritic reworks the Gherkin architecture to a pass in one iteration with default seams
statusReason: expected undefined to be 'passed' // Object.is equality
