[Killed] ArrayDeclaration
product/src/architecture/design.ts:136:16
     interfacesTouched: touched.map((c) => c.path),
     targetTypes: [],
     signatures: [],
-    callGraph: [],
+    callGraph: ["Stryker was here"],
     behaviorContract: constraints.map((c) => c.text),
     verificationPlan,
killedBy: designEpicArchitecture conforms constraints to active ADRs and flags an unbacked decision as a deviation
statusReason: [
  {
    "expected": "object",
    "code": "invalid_type",
    "path": [
      "callGraph",
      0
    ],

[Killed] ArrowFunction
product/src/architecture/design.ts:137:39
     targetTypes: [],
     signatures: [],
     callGraph: [],
-    behaviorContract: constraints.map((c) => c.text),
+    behaviorContract: constraints.map(() => undefined),
     verificationPlan,
     riskBlastRadius: `Epic-level architecture bounds every story in "${epic.title}"; a wrong sketch misleads all ${stories.length} story(ies) and any ADR drafts derived from it.`,
killedBy: designEpicArchitecture conforms constraints to active ADRs and flags an unbacked decision as a deviation
statusReason: [
  {
    "expected": "string",
    "code": "invalid_type",
    "path": [
      "behaviorContract",
      0
    ],

[Killed] ArrowFunction
product/src/architecture/design.ts:140:35
     behaviorContract: constraints.map((c) => c.text),
     verificationPlan,
     riskBlastRadius: `Epic-level architecture bounds every story in "${epic.title}"; a wrong sketch misleads all ${stories.length} story(ies) and any ADR drafts derived from it.`,
-    openQuestions: deviations.map((d) => `needs a new ADR: ${d.text}`),
+    openQuestions: deviations.map(() => undefined),
   });
 
killedBy: designEpicArchitecture conforms constraints to active ADRs and flags an unbacked decision as a deviation
statusReason: [
  {
    "expected": "string",
    "code": "invalid_type",
    "path": [
      "openQuestions",
      0
    ],

[Killed] StringLiteral
product/src/architecture/design.ts:140:42
     behaviorContract: constraints.map((c) => c.text),
     verificationPlan,
     riskBlastRadius: `Epic-level architecture bounds every story in "${epic.title}"; a wrong sketch misleads all ${stories.length} story(ies) and any ADR drafts derived from it.`,
-    openQuestions: deviations.map((d) => `needs a new ADR: ${d.text}`),
+    openQuestions: deviations.map((d) => ``),
   });
 
killedBy: designEpicArchitecture conforms constraints to active ADRs and flags an unbacked decision as a deviation
statusReason: expected [ '' ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
product/src/architecture/design.ts:143:16
     openQuestions: deviations.map((d) => `needs a new ADR: ${d.text}`),
   });
 
-  return { ok: true, architecture: { artifact, constraints, deviations } };
+  return { ok: false, architecture: { artifact, constraints, deviations } };
 }
 
killedBy: designEpicArchitecture conforms constraints to active ADRs and flags an unbacked decision as a deviation
statusReason: expected false to be true // Object.is equality
