[Killed] BlockStatement
product/src/architecture/survey.ts:24:24
 export async function surveyRepo(
   reader: RepoContextReader,
   opts?: { packagesDir?: string; adrDir?: string },
-): Promise<RepoSurvey> {
-  const packagesDir = opts?.packagesDir ?? DEFAULT_PACKAGES_DIR;
-  const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
-
-  const entries = await reader.readDir(packagesDir);
-  const components = entries
-    .filter((entry) => entry.type === 'dir')
-    .map((entry) => ({ name: entry.name, path: entry.path }))
-    .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
-
-  const hasAdrHome = await reader.exists(adrDir);
-
-  return { components, hasAdrHome };
-}
+): Promise<RepoSurvey> {}
 
killedBy: buildDesignContext returns both halves: sorted accepted-only adrs and the survey
statusReason: expected undefined to deeply equal { components: [ { …(2) } ], …(1) }

[Killed] LogicalOperator
product/src/architecture/survey.ts:25:23
   reader: RepoContextReader,
   opts?: { packagesDir?: string; adrDir?: string },
 ): Promise<RepoSurvey> {
-  const packagesDir = opts?.packagesDir ?? DEFAULT_PACKAGES_DIR;
+  const packagesDir = opts?.packagesDir && DEFAULT_PACKAGES_DIR;
   const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
 
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] OptionalChaining
product/src/architecture/survey.ts:25:23
   reader: RepoContextReader,
   opts?: { packagesDir?: string; adrDir?: string },
 ): Promise<RepoSurvey> {
-  const packagesDir = opts?.packagesDir ?? DEFAULT_PACKAGES_DIR;
+  const packagesDir = opts.packagesDir ?? DEFAULT_PACKAGES_DIR;
   const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
 
killedBy: surveyRepo lists directories under packages/ as components, sorted by name
statusReason: Cannot read properties of undefined (reading 'packagesDir')

[Killed] OptionalChaining
product/src/architecture/survey.ts:26:18
   opts?: { packagesDir?: string; adrDir?: string },
 ): Promise<RepoSurvey> {
   const packagesDir = opts?.packagesDir ?? DEFAULT_PACKAGES_DIR;
-  const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
+  const adrDir = opts.adrDir ?? DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(packagesDir);
killedBy: surveyRepo lists directories under packages/ as components, sorted by name
statusReason: Cannot read properties of undefined (reading 'adrDir')

[Killed] LogicalOperator
product/src/architecture/survey.ts:26:18
   opts?: { packagesDir?: string; adrDir?: string },
 ): Promise<RepoSurvey> {
   const packagesDir = opts?.packagesDir ?? DEFAULT_PACKAGES_DIR;
-  const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
+  const adrDir = opts?.adrDir && DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(packagesDir);
killedBy: buildDesignContext composes accepted ADRs and the repo survey (Gherkin acceptance)
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] MethodExpression
product/src/architecture/survey.ts:29:22
   const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(packagesDir);
-  const components = entries
-    .filter((entry) => entry.type === 'dir')
+  const components = entries
     .map((entry) => ({ name: entry.name, path: entry.path }))
     .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
killedBy: surveyRepo excludes files directly under packages/
statusReason: expected [ { name: 'README.md', …(1) }, …(1) ] to deeply equal [ { name: 'core', …(1) } ]

[Killed] MethodExpression
product/src/architecture/survey.ts:29:22
   const adrDir = opts?.adrDir ?? DEFAULT_ADR_DIR;
 
   const entries = await reader.readDir(packagesDir);
-  const components = entries
-    .filter((entry) => entry.type === 'dir')
-    .map((entry) => ({ name: entry.name, path: entry.path }))
-    .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
+  const components = entries.filter(entry => entry.type === 'dir').map(entry => ({
+  name: entry.name,
+  path: entry.path
+}));
 
   const hasAdrHome = await reader.exists(adrDir);
killedBy: surveyRepo sorts components by name regardless of comparator argument order
statusReason: expected [ { name: 'core', …(1) }, …(1) ] to deeply equal [ { name: 'cli', …(1) }, …(1) ]

[Killed] EqualityOperator
product/src/architecture/survey.ts:30:24
 
   const entries = await reader.readDir(packagesDir);
   const components = entries
-    .filter((entry) => entry.type === 'dir')
+    .filter((entry) => entry.type !== 'dir')
     .map((entry) => ({ name: entry.name, path: entry.path }))
     .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
killedBy: surveyRepo lists directories under packages/ as components, sorted by name
statusReason: expected [] to deeply equal [ { name: 'cli', …(1) }, …(1) ]

[Killed] ConditionalExpression
product/src/architecture/survey.ts:30:24
 
   const entries = await reader.readDir(packagesDir);
   const components = entries
-    .filter((entry) => entry.type === 'dir')
+    .filter((entry) => false)
     .map((entry) => ({ name: entry.name, path: entry.path }))
     .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
killedBy: surveyRepo lists directories under packages/ as components, sorted by name
statusReason: expected [] to deeply equal [ { name: 'cli', …(1) }, …(1) ]

[Killed] ArrowFunction
product/src/architecture/survey.ts:31:10
   const entries = await reader.readDir(packagesDir);
   const components = entries
     .filter((entry) => entry.type === 'dir')
-    .map((entry) => ({ name: entry.name, path: entry.path }))
+    .map(() => undefined)
     .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
 
killedBy: surveyRepo lists directories under packages/ as components, sorted by name
statusReason: expected [ undefined, undefined ] to deeply equal [ { name: 'cli', …(1) }, …(1) ]

[Killed] ConditionalExpression
product/src/architecture/survey.ts:32:22
   const components = entries
     .filter((entry) => entry.type === 'dir')
     .map((entry) => ({ name: entry.name, path: entry.path }))
-    .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
+    .sort((a, b) => (true ? -1 : a.name > b.name ? 1 : 0));
 
   const hasAdrHome = await reader.exists(adrDir);
killedBy: surveyRepo lists directories under packages/ as components, sorted by name
statusReason: expected [ { name: 'core', …(1) }, …(1) ] to deeply equal [ { name: 'cli', …(1) }, …(1) ]

[Killed] UnaryOperator
product/src/architecture/survey.ts:32:40
   const components = entries
     .filter((entry) => entry.type === 'dir')
     .map((entry) => ({ name: entry.name, path: entry.path }))
-    .sort((a, b) => (a.name < b.name ? -1 : a.name > b.name ? 1 : 0));
+    .sort((a, b) => (a.name < b.name ? +1 : a.name > b.name ? 1 : 0));
 
   const hasAdrHome = await reader.exists(adrDir);
killedBy: surveyRepo sorts components by name regardless of comparator argument order
statusReason: expected [ { name: 'core', …(1) }, …(1) ] to deeply equal [ { name: 'cli', …(1) }, …(1) ]
