[Killed] BlockStatement
product/src/cli/program.ts:37:45
   createPrompter: () => Prompter;
 }
 
-export function getProductVersion(): string {
-  return createRequire(import.meta.url)('../../package.json').version;
-}
+export function getProductVersion(): string {}
 
 /**
killedBy: getProductVersion reads the version from package.json
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
product/src/cli/program.ts:47:36
  * home`/`adr next` compute the wrong ADR home (or ENOENT) whenever invoked
  * from a subdirectory, e.g. `npm run dev -w packages/product`.
  */
-function resolveRepoRoot(): string {
-  try {
-    return execSync('git rev-parse --show-toplevel', { encoding: 'utf-8' }).trim();
-  } catch {
-    return process.cwd();
-  }
-}
+function resolveRepoRoot(): string {}
 
 async function resolveBrainDump(
killedBy: defaultDeps reads the repo root from git, not process.cwd()
statusReason: expected undefined to be '/Users/moltbot/repos/on-par/software-…' // Object.is equality

[Killed] BlockStatement
product/src/cli/program.ts:48:7
  * from a subdirectory, e.g. `npm run dev -w packages/product`.
  */
 function resolveRepoRoot(): string {
-  try {
-    return execSync('git rev-parse --show-toplevel', { encoding: 'utf-8' }).trim();
-  } catch {
+  try {} catch {
     return process.cwd();
   }
killedBy: defaultDeps reads the repo root from git, not process.cwd()
statusReason: expected undefined to be '/Users/moltbot/repos/on-par/software-…' // Object.is equality

[Killed] MethodExpression
product/src/cli/program.ts:49:12
  */
 function resolveRepoRoot(): string {
   try {
-    return execSync('git rev-parse --show-toplevel', { encoding: 'utf-8' }).trim();
+    return execSync('git rev-parse --show-toplevel', {
+  encoding: 'utf-8'
+});
   } catch {
     return process.cwd();
killedBy: defaultDeps reads the repo root from git, not process.cwd()
statusReason: expected '/Users/moltbot/repos/on-par/software-…' to be '/Users/moltbot/repos/on-par/software-…' // Object.is equality

[Killed] ObjectLiteral
product/src/cli/program.ts:49:54
  */
 function resolveRepoRoot(): string {
   try {
-    return execSync('git rev-parse --show-toplevel', { encoding: 'utf-8' }).trim();
+    return execSync('git rev-parse --show-toplevel', {}).trim();
   } catch {
     return process.cwd();
killedBy: defaultDeps reads the repo root from git, not process.cwd()
statusReason: expected '/Users/moltbot/repos/on-par/software-…' to be '/Users/moltbot/repos/on-par/software-…' // Object.is equality

[Killed] BlockStatement
product/src/cli/program.ts:50:11
 function resolveRepoRoot(): string {
   try {
     return execSync('git rev-parse --show-toplevel', { encoding: 'utf-8' }).trim();
-  } catch {
-    return process.cwd();
-  }
+  } catch {}
 }
 
killedBy: defaultDeps falls back to process.cwd() when git rev-parse fails
statusReason: expected undefined to be '/Users/moltbot/repos/on-par/software-…' // Object.is equality

[Killed] BlockStatement
product/src/cli/program.ts:59:20
   opts: { text?: string; file?: string },
   deps: ProgramDeps,
   command: string,
-): Promise<string> {
-  const brainDump = opts.text ?? (opts.file === undefined ? undefined : await deps.readFile(opts.file));
-  if (brainDump === undefined || brainDump.trim() === '') {
-    throw new Error(`product ${command}: pass --text "<brain-dump>" or --file <path>`);
-  }
-  return brainDump;
-}
+): Promise<string> {}
 
 function parseBudget(raw: string, command: string): number {
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] LogicalOperator
product/src/cli/program.ts:60:21
   deps: ProgramDeps,
   command: string,
 ): Promise<string> {
-  const brainDump = opts.text ?? (opts.file === undefined ? undefined : await deps.readFile(opts.file));
+  const brainDump = opts.text && (opts.file === undefined ? undefined : await deps.readFile(opts.file));
   if (brainDump === undefined || brainDump.trim() === '') {
     throw new Error(`product ${command}: pass --text "<brain-dump>" or --file <path>`);
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: product interview: pass --text "<brain-dump>" or --file <path>

[Killed] EqualityOperator
product/src/cli/program.ts:60:35
   deps: ProgramDeps,
   command: string,
 ): Promise<string> {
-  const brainDump = opts.text ?? (opts.file === undefined ? undefined : await deps.readFile(opts.file));
+  const brainDump = opts.text ?? (opts.file !== undefined ? undefined : await deps.readFile(opts.file));
   if (brainDump === undefined || brainDump.trim() === '') {
     throw new Error(`product ${command}: pass --text "<brain-dump>" or --file <path>`);
killedBy: main: interview runs the loop from --file, reading its contents
statusReason: product interview: pass --text "<brain-dump>" or --file <path>

[Killed] BlockStatement
product/src/cli/program.ts:61:59
   command: string,
 ): Promise<string> {
   const brainDump = opts.text ?? (opts.file === undefined ? undefined : await deps.readFile(opts.file));
-  if (brainDump === undefined || brainDump.trim() === '') {
-    throw new Error(`product ${command}: pass --text "<brain-dump>" or --file <path>`);
-  }
+  if (brainDump === undefined || brainDump.trim() === '') {}
   return brainDump;
 }
killedBy: main: interview rejects with neither --text nor --file, without creating a prompter
statusReason: expected [Function] to throw error matching /pass --text/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
product/src/cli/program.ts:61:34
   command: string,
 ): Promise<string> {
   const brainDump = opts.text ?? (opts.file === undefined ? undefined : await deps.readFile(opts.file));
-  if (brainDump === undefined || brainDump.trim() === '') {
+  if (brainDump === undefined || false) {
     throw new Error(`product ${command}: pass --text "<brain-dump>" or --file <path>`);
   }
killedBy: main: interview rejects when --file contents are whitespace only
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
product/src/cli/program.ts:67:60
   return brainDump;
 }
 
-function parseBudget(raw: string, command: string): number {
-  const questionBudget = Number.parseInt(raw, 10);
-  if (!Number.isInteger(questionBudget) || questionBudget < 0) {
-    throw new Error(`product ${command}: --budget must be a non-negative integer`);
-  }
-  return questionBudget;
-}
+function parseBudget(raw: string, command: string): number {}
 
 function parseThreshold(raw: string, command: string): number {
killedBy: main: interview rejects a non-numeric --budget
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
product/src/cli/program.ts:69:44
 
 function parseBudget(raw: string, command: string): number {
   const questionBudget = Number.parseInt(raw, 10);
-  if (!Number.isInteger(questionBudget) || questionBudget < 0) {
+  if (!Number.isInteger(questionBudget) || questionBudget <= 0) {
     throw new Error(`product ${command}: --budget must be a non-negative integer`);
   }
killedBy: main: intent builds the intent doc from --text and writes it, closing the prompter
statusReason: product intent: --budget must be a non-negative integer

[Killed] BlockStatement
product/src/cli/program.ts:69:64
 
 function parseBudget(raw: string, command: string): number {
   const questionBudget = Number.parseInt(raw, 10);
-  if (!Number.isInteger(questionBudget) || questionBudget < 0) {
-    throw new Error(`product ${command}: --budget must be a non-negative integer`);
-  }
+  if (!Number.isInteger(questionBudget) || questionBudget < 0) {}
   return questionBudget;
 }
killedBy: main: interview rejects a non-numeric --budget
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
product/src/cli/program.ts:75:63
   return questionBudget;
 }
 
-function parseThreshold(raw: string, command: string): number {
-  const threshold = Number(raw);
-  if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
-    throw new Error(`product ${command}: --threshold must be a number between 0 and 100`);
-  }
-  return threshold;
-}
+function parseThreshold(raw: string, command: string): number {}
 
 function parseMaxIterations(raw: string, command: string): number {
killedBy: main: judge rejects an out-of-range --threshold
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
product/src/cli/program.ts:77:7
 
 function parseThreshold(raw: string, command: string): number {
   const threshold = Number(raw);
-  if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
+  if (!Number.isFinite(threshold) && threshold < 0 || threshold > 100) {
     throw new Error(`product ${command}: --threshold must be a number between 0 and 100`);
   }
killedBy: main: judge rejects a non-numeric --threshold
statusReason: expected [Function] to throw error matching /^product judge: --threshold must be a…/ but got 'judge loop: threshold must be a finit…'

[Killed] ConditionalExpression
product/src/cli/program.ts:77:7
 
 function parseThreshold(raw: string, command: string): number {
   const threshold = Number(raw);
-  if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
+  if (false) {
     throw new Error(`product ${command}: --threshold must be a number between 0 and 100`);
   }
killedBy: main: judge rejects an out-of-range --threshold
statusReason: expected [Function] to throw error matching /^product judge: --threshold must be a…/ but got 'judge loop: threshold must be a finit…'

[Killed] BlockStatement
product/src/cli/program.ts:83:67
   return threshold;
 }
 
-function parseMaxIterations(raw: string, command: string): number {
-  const maxIterations = Number.parseInt(raw, 10);
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
-    throw new Error(`product ${command}: --max-iterations must be a non-negative integer`);
-  }
-  return maxIterations;
-}
+function parseMaxIterations(raw: string, command: string): number {}
 
 /** Shared by `decompose` and `personas`: brain-dump -> approved doc -> decomposition, or throw. */
killedBy: main: judge rejects a negative --max-iterations
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
product/src/cli/program.ts:85:62
 
 function parseMaxIterations(raw: string, command: string): number {
   const maxIterations = Number.parseInt(raw, 10);
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
-    throw new Error(`product ${command}: --max-iterations must be a non-negative integer`);
-  }
+  if (!Number.isInteger(maxIterations) || maxIterations < 0) {}
   return maxIterations;
 }
killedBy: main: judge rejects a negative --max-iterations
statusReason: expected [Function] to throw error matching /^product judge: --max-iterations must…/ but got 'judge loop: maxIterations must be a n…'

[Killed] BooleanLiteral
product/src/cli/program.ts:85:7
 
 function parseMaxIterations(raw: string, command: string): number {
   const maxIterations = Number.parseInt(raw, 10);
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
+  if (Number.isInteger(maxIterations) || maxIterations < 0) {
     throw new Error(`product ${command}: --max-iterations must be a non-negative integer`);
   }
killedBy: main: judge approves the intent doc, decomposes it, judges each story, and writes the rendered report
statusReason: product judge: --max-iterations must be a non-negative integer

[Killed] StringLiteral
product/src/cli/program.ts:86:21
 function parseMaxIterations(raw: string, command: string): number {
   const maxIterations = Number.parseInt(raw, 10);
   if (!Number.isInteger(maxIterations) || maxIterations < 0) {
-    throw new Error(`product ${command}: --max-iterations must be a non-negative integer`);
+    throw new Error(``);
   }
   return maxIterations;
killedBy: main: judge rejects a negative --max-iterations
statusReason: expected [Function] to throw error matching /^product judge: --max-iterations must…/ but got ''

[Killed] BlockStatement
product/src/cli/program.ts:101:7
   const questionBudget = parseBudget(opts.budget, command);
   const prompter = deps.createPrompter();
   let result: InterviewResult;
-  try {
-    result = await runInterview(
-      brainDump,
-      { ask: (question) => prompter.ask(formatQuestion(question)) },
-      { questionBudget },
-    );
-  } finally {
+  try {} finally {
     prompter.close();
   }
killedBy: main: decompose approves the intent doc and writes the rendered decomposition
statusReason: Cannot read properties of undefined (reading 'brainDump')

[Killed] ArrowFunction
product/src/cli/program.ts:104:14
   try {
     result = await runInterview(
       brainDump,
-      { ask: (question) => prompter.ask(formatQuestion(question)) },
+      { ask: () => undefined },
       { questionBudget },
     );
killedBy: main: decompose asks via the prompter when the budget allows a clarifying question
statusReason: expected "vi.fn()" to be called at least once

[Killed] ObjectLiteral
product/src/cli/program.ts:104:7
   try {
     result = await runInterview(
       brainDump,
-      { ask: (question) => prompter.ask(formatQuestion(question)) },
+      {},
       { questionBudget },
     );
killedBy: main: decompose asks via the prompter when the budget allows a clarifying question
statusReason: expected "vi.fn()" to be called at least once

[Killed] ObjectLiteral
product/src/cli/program.ts:105:7
     result = await runInterview(
       brainDump,
       { ask: (question) => prompter.ask(formatQuestion(question)) },
-      { questionBudget },
+      {},
     );
   } finally {
killedBy: main: decompose asks via the prompter when the budget allows a clarifying question
statusReason: promise resolved "undefined" instead of rejecting

[Survived] BlockStatement
product/src/cli/program.ts:107:13
       { ask: (question) => prompter.ask(formatQuestion(question)) },
       { questionBudget },
     );
-  } finally {
-    prompter.close();
-  }
+  } finally {}
 
   const doc = buildIntentDoc(result);

[Survived] CallExpression
product/src/cli/program.ts:108:5
       { questionBudget },
     );
   } finally {
-    prompter.close();
+    ;
   }
 

[Killed] BooleanLiteral
product/src/cli/program.ts:113:7
 
   const doc = buildIntentDoc(result);
   const approval = approveIntentDoc(doc, opts.approve);
-  if (!approval.ok) {
+  if (approval.ok) {
     for (const line of renderIntentDoc(doc)) {
       deps.write(line);
killedBy: main: decompose approves the intent doc and writes the rendered decomposition
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] ConditionalExpression
product/src/cli/program.ts:113:7
 
   const doc = buildIntentDoc(result);
   const approval = approveIntentDoc(doc, opts.approve);
-  if (!approval.ok) {
+  if (true) {
     for (const line of renderIntentDoc(doc)) {
       deps.write(line);
killedBy: main: decompose approves the intent doc and writes the rendered decomposition
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
product/src/cli/program.ts:114:46
   const doc = buildIntentDoc(result);
   const approval = approveIntentDoc(doc, opts.approve);
   if (!approval.ok) {
-    for (const line of renderIntentDoc(doc)) {
-      deps.write(line);
-    }
+    for (const line of renderIntentDoc(doc)) {}
     throw new Error(`product ${command}: cannot approve — ${approval.blockers.join('; ')}`);
   }
killedBy: main: decompose rejects with cannot approve and still writes the draft lines when gaps remain
statusReason: expected "vi.fn()" to be called with arguments: [ '# Intent Doc' ]

Number of calls: 0

[Killed] CallExpression
product/src/cli/program.ts:115:7
   const approval = approveIntentDoc(doc, opts.approve);
   if (!approval.ok) {
     for (const line of renderIntentDoc(doc)) {
-      deps.write(line);
+      ;
     }
     throw new Error(`product ${command}: cannot approve — ${approval.blockers.join('; ')}`);
killedBy: main: decompose rejects with cannot approve and still writes the draft lines when gaps remain
statusReason: expected "vi.fn()" to be called with arguments: [ '# Intent Doc' ]

Number of calls: 0

[Killed] BlockStatement
product/src/cli/program.ts:121:28
   }
 
   const decomposeResult = decomposeIntent(approval.doc);
-  if (!decomposeResult.ok) {
-    throw new Error(`product ${command}: ${decomposeResult.blockers.join('; ')}`);
-  }
+  if (!decomposeResult.ok) {}
 
   return { doc: approval.doc, decomposition: decomposeResult.decomposition };
killedBy: main: decompose rejects with the decomposition blockers when a scope statement is horizontal
statusReason: expected [Function] to throw error matching /^product decompose: / but got 'Cannot destructure property \'epic\' …'

[Killed] ConditionalExpression
product/src/cli/program.ts:121:7
   }
 
   const decomposeResult = decomposeIntent(approval.doc);
-  if (!decomposeResult.ok) {
+  if (true) {
     throw new Error(`product ${command}: ${decomposeResult.blockers.join('; ')}`);
   }
killedBy: main: decompose approves the intent doc and writes the rendered decomposition
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] BlockStatement
product/src/cli/program.ts:128:44
   return { doc: approval.doc, decomposition: decomposeResult.decomposition };
 }
 
-export function defaultDeps(): ProgramDeps {
-  return {
-    repoRoot: resolveRepoRoot(),
-    listAdrs: (dir) => listAdrFilenames(dir),
-    write: (line) => console.log(line),
-    readFile: (path) => readFileFs(path, 'utf-8'),
-    createPrompter: () => createStdinPrompter(),
-  };
-}
+export function defaultDeps(): ProgramDeps {}
 
 export function buildProgram(deps: ProgramDeps = defaultDeps()): Command {
killedBy: defaultDeps reads the repo root from git, not process.cwd()
statusReason: Cannot read properties of undefined (reading 'repoRoot')

[Killed] ArrowFunction
product/src/cli/program.ts:131:15
 export function defaultDeps(): ProgramDeps {
   return {
     repoRoot: resolveRepoRoot(),
-    listAdrs: (dir) => listAdrFilenames(dir),
+    listAdrs: () => undefined,
     write: (line) => console.log(line),
     readFile: (path) => readFileFs(path, 'utf-8'),
killedBy: defaultDeps lists ADRs from the real docs/adr/ directory
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
product/src/cli/program.ts:132:12
   return {
     repoRoot: resolveRepoRoot(),
     listAdrs: (dir) => listAdrFilenames(dir),
-    write: (line) => console.log(line),
+    write: () => undefined,
     readFile: (path) => readFileFs(path, 'utf-8'),
     createPrompter: () => createStdinPrompter(),
killedBy: defaultDeps writes via console.log
statusReason: expected "log" to be called with arguments: [ 'hello' ]

Number of calls: 0

[Killed] ArrowFunction
product/src/cli/program.ts:133:15
     repoRoot: resolveRepoRoot(),
     listAdrs: (dir) => listAdrFilenames(dir),
     write: (line) => console.log(line),
-    readFile: (path) => readFileFs(path, 'utf-8'),
+    readFile: () => undefined,
     createPrompter: () => createStdinPrompter(),
   };
killedBy: defaultDeps reads a real file via readFile
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
product/src/cli/program.ts:133:42
     repoRoot: resolveRepoRoot(),
     listAdrs: (dir) => listAdrFilenames(dir),
     write: (line) => console.log(line),
-    readFile: (path) => readFileFs(path, 'utf-8'),
+    readFile: (path) => readFileFs(path, ""),
     createPrompter: () => createStdinPrompter(),
   };
killedBy: defaultDeps reads a real file via readFile
statusReason: expected [ 123, 10, 32, 32, 34, 110, …(1997) ] to include '"name"'

[Killed] ArrowFunction
product/src/cli/program.ts:134:21
     listAdrs: (dir) => listAdrFilenames(dir),
     write: (line) => console.log(line),
     readFile: (path) => readFileFs(path, 'utf-8'),
-    createPrompter: () => createStdinPrompter(),
+    createPrompter: () => undefined,
   };
 }
killedBy: defaultDeps creates a prompter without opening real stdin (readline/promises is mocked)
statusReason: Cannot read properties of undefined (reading 'ask')

[Killed] StringLiteral
product/src/cli/program.ts:146:31
     .description('Product app — turn a brain-dump into engineering-ready issues (proposer: read-only)')
     .version(getProductVersion());
 
-  const adr = program.command('adr').description('Architecture Decision Record helpers');
+  const adr = program.command("").description('Architecture Decision Record helpers');
 
   adr
killedBy: buildProgram names the program product and lists the adr and interview commands in help
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] StringLiteral
product/src/cli/program.ts:146:50
     .description('Product app — turn a brain-dump into engineering-ready issues (proposer: read-only)')
     .version(getProductVersion());
 
-  const adr = program.command('adr').description('Architecture Decision Record helpers');
+  const adr = program.command('adr').description("");
 
   adr

[Killed] StringLiteral
product/src/cli/program.ts:149:14
   const adr = program.command('adr').description('Architecture Decision Record helpers');
 
   adr
-    .command('home')
+    .command("")
     .description("Print the monorepo's ADR home directory")
     .action(() => {
killedBy: buildProgram names the program product and lists the adr and interview commands in help
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] StringLiteral
product/src/cli/program.ts:150:18
 
   adr
     .command('home')
-    .description("Print the monorepo's ADR home directory")
+    .description("")
     .action(() => {
       deps.write(resolveAdrHome(deps.repoRoot));

[Killed] BlockStatement
product/src/cli/program.ts:151:19
   adr
     .command('home')
     .description("Print the monorepo's ADR home directory")
-    .action(() => {
-      deps.write(resolveAdrHome(deps.repoRoot));
-    });
+    .action(() => {});
 
   adr
killedBy: main prints the ADR home for `adr home`
statusReason: expected "vi.fn()" to be called with arguments: [ '/repo/docs/adr' ]

Number of calls: 0

[Killed] CallExpression
product/src/cli/program.ts:152:7
     .command('home')
     .description("Print the monorepo's ADR home directory")
     .action(() => {
-      deps.write(resolveAdrHome(deps.repoRoot));
+      ;
     });
 
killedBy: main prints the ADR home for `adr home`
statusReason: expected "vi.fn()" to be called with arguments: [ '/repo/docs/adr' ]

Number of calls: 0

[Killed] CallExpression
product/src/cli/program.ts:155:3
       deps.write(resolveAdrHome(deps.repoRoot));
     });
 
-  adr
-    .command('next')
-    .argument('<title>', 'title of the decision')
-    .description('Print the filename for the next ADR, numbered by @on-par/adr-kit')
-    .action((title: string) => {
-      deps.write(nextAdrFilename(deps.listAdrs(resolveAdrHome(deps.repoRoot)), title));
-    });
+  ;
 
   program
killedBy: main prints the next ADR filename for `adr next <title>`
statusReason: process.exit unexpectedly called with "1"

[Killed] StringLiteral
product/src/cli/program.ts:156:14
     });
 
   adr
-    .command('next')
+    .command("")
     .argument('<title>', 'title of the decision')
     .description('Print the filename for the next ADR, numbered by @on-par/adr-kit')
killedBy: buildProgram names the program product and lists the adr and interview commands in help
statusReason: object null is not iterable (cannot read property Symbol(Symbol.iterator))

[Survived] StringLiteral
product/src/cli/program.ts:157:26
 
   adr
     .command('next')
-    .argument('<title>', 'title of the decision')
+    .argument('<title>', "")
     .description('Print the filename for the next ADR, numbered by @on-par/adr-kit')
     .action((title: string) => {

[Killed] BlockStatement
product/src/cli/program.ts:159:32
     .command('next')
     .argument('<title>', 'title of the decision')
     .description('Print the filename for the next ADR, numbered by @on-par/adr-kit')
-    .action((title: string) => {
-      deps.write(nextAdrFilename(deps.listAdrs(resolveAdrHome(deps.repoRoot)), title));
-    });
+    .action((title: string) => {});
 
   program
killedBy: main prints the next ADR filename for `adr next <title>`
statusReason: expected "vi.fn()" to be called with arguments: [ '/repo/docs/adr' ]

Number of calls: 0

[Killed] CallExpression
product/src/cli/program.ts:160:7
     .argument('<title>', 'title of the decision')
     .description('Print the filename for the next ADR, numbered by @on-par/adr-kit')
     .action((title: string) => {
-      deps.write(nextAdrFilename(deps.listAdrs(resolveAdrHome(deps.repoRoot)), title));
+      ;
     });
 
killedBy: main prints the next ADR filename for `adr next <title>`
statusReason: expected "vi.fn()" to be called with arguments: [ '/repo/docs/adr' ]

Number of calls: 0

[Killed] CallExpression
product/src/cli/program.ts:163:3
       deps.write(nextAdrFilename(deps.listAdrs(resolveAdrHome(deps.repoRoot)), title));
     });
 
-  program
-    .command('interview')
-    .description('Interview a brain-dump: ask clarifying questions until intent is pinned')
-    .option('-t, --text <text>', 'the brain-dump as an inline string')
-    .option('-f, --file <path>', 'read the brain-dump from a file')
-    .option('-b, --budget <n>', 'max clarifying questions', String(DEFAULT_QUESTION_BUDGET))
-    .action(async (opts: { text?: string; file?: string; budget: string }) => {
-      const brainDump = await resolveBrainDump(opts, deps, 'interview');
-      const questionBudget = parseBudget(opts.budget, 'interview');
-      const prompter = deps.createPrompter();
-      try {
-        const result = await runInterview(
-          brainDump,
-          { ask: (question) => prompter.ask(formatQuestion(question)) },
-          { questionBudget },
-        );
-        for (const line of renderInterviewSummary(result)) {
-          deps.write(line);
-        }
-      } finally {
-        prompter.close();
-      }
-    });
+  ;
 
   program
killedBy: buildProgram names the program product and lists the adr and interview commands in help
statusReason: expected 'Usage: product [options] [command]\n\…' to contain 'interview'

[Survived] StringLiteral
product/src/cli/program.ts:168:33
     .description('Interview a brain-dump: ask clarifying questions until intent is pinned')
     .option('-t, --text <text>', 'the brain-dump as an inline string')
     .option('-f, --file <path>', 'read the brain-dump from a file')
-    .option('-b, --budget <n>', 'max clarifying questions', String(DEFAULT_QUESTION_BUDGET))
+    .option('-b, --budget <n>', "", String(DEFAULT_QUESTION_BUDGET))
     .action(async (opts: { text?: string; file?: string; budget: string }) => {
       const brainDump = await resolveBrainDump(opts, deps, 'interview');

[Killed] BlockStatement
product/src/cli/program.ts:169:79
     .option('-t, --text <text>', 'the brain-dump as an inline string')
     .option('-f, --file <path>', 'read the brain-dump from a file')
     .option('-b, --budget <n>', 'max clarifying questions', String(DEFAULT_QUESTION_BUDGET))
-    .action(async (opts: { text?: string; file?: string; budget: string }) => {
-      const brainDump = await resolveBrainDump(opts, deps, 'interview');
-      const questionBudget = parseBudget(opts.budget, 'interview');
-      const prompter = deps.createPrompter();
-      try {
-        const result = await runInterview(
-          brainDump,
-          { ask: (question) => prompter.ask(formatQuestion(question)) },
-          { questionBudget },
-        );
-        for (const line of renderInterviewSummary(result)) {
-          deps.write(line);
-        }
-      } finally {
-        prompter.close();
-      }
-    });
+    .action(async (opts: { text?: string; file?: string; budget: string }) => {});
 
   program
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
product/src/cli/program.ts:173:11
       const brainDump = await resolveBrainDump(opts, deps, 'interview');
       const questionBudget = parseBudget(opts.budget, 'interview');
       const prompter = deps.createPrompter();
-      try {
-        const result = await runInterview(
-          brainDump,
-          { ask: (question) => prompter.ask(formatQuestion(question)) },
-          { questionBudget },
-        );
-        for (const line of renderInterviewSummary(result)) {
-          deps.write(line);
-        }
-      } finally {
+      try {} finally {
         prompter.close();
       }
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
product/src/cli/program.ts:179:60
           { ask: (question) => prompter.ask(formatQuestion(question)) },
           { questionBudget },
         );
-        for (const line of renderInterviewSummary(result)) {
-          deps.write(line);
-        }
+        for (const line of renderInterviewSummary(result)) {}
       } finally {
         prompter.close();
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching{…} ]

Number of calls: 0
