[Killed] BlockStatement
packages/product/src/cli.ts:6:23
 
 import { main } from './cli/program.js';
 
-main().catch((err) => {
-  console.error(err.message);
-  process.exit(1);
-});
+main().catch((err) => {});
 
killedBy: cli entrypoint prints the error and exits 1 when main rejects
statusReason: expected "Mock" to be called with arguments: [ 1 ]

Number of calls: 0

[Killed] CallExpression
packages/product/src/cli.ts:7:3
 import { main } from './cli/program.js';
 
 main().catch((err) => {
-  console.error(err.message);
+  ;
   process.exit(1);
 });
killedBy: cli entrypoint prints the error and exits 1 when main rejects
statusReason: expected "error" to be called with arguments: [ 'entry failed' ]

Number of calls: 0

[Killed] CallExpression
packages/product/src/cli.ts:8:3
 
 main().catch((err) => {
   console.error(err.message);
-  process.exit(1);
+  ;
 });
 
killedBy: cli entrypoint prints the error and exits 1 when main rejects
statusReason: expected "Mock" to be called with arguments: [ 1 ]

Number of calls: 0
