[Killed] StringLiteral
product/src/decompose/story-map.ts:40:7
       'login',
       'sign up',
       'register',
-      'authenticate',
+      "",
       'onboard',
       'invite',
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [ Array(4) ] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] StringLiteral
product/src/decompose/story-map.ts:42:7
       'register',
       'authenticate',
       'onboard',
-      'invite',
+      "",
       'permission',
       'access',
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [ Array(4) ] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] ObjectLiteral
product/src/decompose/story-map.ts:47:3
       'access',
     ],
   },
-  {
-    id: 'discover',
-    label: 'Find the work',
-    cues: ['find', 'search', 'browse', 'discover', 'list', 'filter', 'view', 'see the'],
-  },
+  {},
   {
     id: 'capture',
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrayDeclaration
product/src/decompose/story-map.ts:50:11
   {
     id: 'discover',
     label: 'Find the work',
-    cues: ['find', 'search', 'browse', 'discover', 'list', 'filter', 'view', 'see the'],
+    cues: [],
   },
   {
killedBy: planSlices orders slices along the story-map backbone, not raw doc order
statusReason: expected [ Array(6) ] to deeply equal [ Array(6) ]

[Killed] StringLiteral
product/src/decompose/story-map.ts:50:78
   {
     id: 'discover',
     label: 'Find the work',
-    cues: ['find', 'search', 'browse', 'discover', 'list', 'filter', 'view', 'see the'],
+    cues: ['find', 'search', 'browse', 'discover', 'list', 'filter', 'view', ""],
   },
   {
killedBy: planSlices orders slices along the story-map backbone, not raw doc order
statusReason: expected [ Array(6) ] to deeply equal [ Array(6) ]

[Killed] StringLiteral
product/src/decompose/story-map.ts:53:9
     cues: ['find', 'search', 'browse', 'discover', 'list', 'filter', 'view', 'see the'],
   },
   {
-    id: 'capture',
+    id: "",
     label: 'Capture the work',
     cues: ['create', 'add ', 'enter', 'upload', 'import', 'submit', 'record', 'draft'],
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [ '', 'deliver', 'learn' ] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] StringLiteral
product/src/decompose/story-map.ts:55:49
   {
     id: 'capture',
     label: 'Capture the work',
-    cues: ['create', 'add ', 'enter', 'upload', 'import', 'submit', 'record', 'draft'],
+    cues: ['create', 'add ', 'enter', 'upload', "", 'submit', 'record', 'draft'],
   },
   {
killedBy: stagesMatching returns an empty array for text with no cue
statusReason: expected [ { id: 'capture', …(2) } ] to deeply equal []

[Killed] StringLiteral
product/src/decompose/story-map.ts:55:59
   {
     id: 'capture',
     label: 'Capture the work',
-    cues: ['create', 'add ', 'enter', 'upload', 'import', 'submit', 'record', 'draft'],
+    cues: ['create', 'add ', 'enter', 'upload', 'import', "", 'record', 'draft'],
   },
   {
killedBy: planSlices orders slices along the story-map backbone, not raw doc order
statusReason: expected [ Array(6) ] to deeply equal [ Array(6) ]

[Killed] ObjectLiteral
product/src/decompose/story-map.ts:57:3
     label: 'Capture the work',
     cues: ['create', 'add ', 'enter', 'upload', 'import', 'submit', 'record', 'draft'],
   },
-  {
-    id: 'process',
-    label: 'Act on the work',
-    cues: [
-      'process',
-      'validate',
-      'approve',
-      'review',
-      'edit',
-      'update',
-      'retry',
-      'run ',
-      'resolve',
-      'cancel',
-      'delete',
-    ],
-  },
+  {},
   {
     id: 'deliver',
killedBy: planSlices plans one slice per scope statement, sharing the context arrays
statusReason: Cannot read properties of undefined (reading 'some')

[Survived] ArrayDeclaration
product/src/decompose/story-map.ts:60:11
   {
     id: 'process',
     label: 'Act on the work',
-    cues: [
-      'process',
-      'validate',
-      'approve',
-      'review',
-      'edit',
-      'update',
-      'retry',
-      'run ',
-      'resolve',
-      'cancel',
-      'delete',
-    ],
+    cues: [],
   },
   {

[Killed] StringLiteral
product/src/decompose/story-map.ts:66:7
       'approve',
       'review',
       'edit',
-      'update',
+      "",
       'retry',
       'run ',
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [ 'capture', 'process', …(2) ] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] ObjectLiteral
product/src/decompose/story-map.ts:74:3
       'delete',
     ],
   },
-  {
-    id: 'deliver',
-    label: 'Deliver the result',
-    cues: ['export', 'send', 'publish', 'notify', 'share', 'deliver', 'download', 'email', 'print'],
-  },
+  {},
   {
     id: 'learn',
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] StringLiteral
product/src/decompose/story-map.ts:75:9
     ],
   },
   {
-    id: 'deliver',
+    id: "",
     label: 'Deliver the result',
     cues: ['export', 'send', 'publish', 'notify', 'share', 'deliver', 'download', 'email', 'print'],
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [ 'capture', '', 'learn' ] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] StringLiteral
product/src/decompose/story-map.ts:77:51
   {
     id: 'deliver',
     label: 'Deliver the result',
-    cues: ['export', 'send', 'publish', 'notify', 'share', 'deliver', 'download', 'email', 'print'],
+    cues: ['export', 'send', 'publish', 'notify', "", 'deliver', 'download', 'email', 'print'],
   },
   {
killedBy: stagesMatching returns an empty array for text with no cue
statusReason: expected [ { id: 'deliver', …(2) } ] to deeply equal []

[Killed] StringLiteral
product/src/decompose/story-map.ts:77:22
   {
     id: 'deliver',
     label: 'Deliver the result',
-    cues: ['export', 'send', 'publish', 'notify', 'share', 'deliver', 'download', 'email', 'print'],
+    cues: ['export', "", 'publish', 'notify', 'share', 'deliver', 'download', 'email', 'print'],
   },
   {
killedBy: stagesMatching returns an empty array for text with no cue
statusReason: expected [ { id: 'deliver', …(2) } ] to deeply equal []

[Killed] ObjectLiteral
product/src/decompose/story-map.ts:79:3
     label: 'Deliver the result',
     cues: ['export', 'send', 'publish', 'notify', 'share', 'deliver', 'download', 'email', 'print'],
   },
-  {
-    id: 'learn',
-    label: 'Learn from it',
-    cues: ['report', 'dashboard', 'metric', 'analytic', 'audit', 'history', 'measure', 'chart', 'insight'],
-  },
+  {},
   { id: 'other', label: 'Unmapped', cues: [] },
 ];
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] StringLiteral
product/src/decompose/story-map.ts:82:22
   {
     id: 'learn',
     label: 'Learn from it',
-    cues: ['report', 'dashboard', 'metric', 'analytic', 'audit', 'history', 'measure', 'chart', 'insight'],
+    cues: ['report', "", 'metric', 'analytic', 'audit', 'history', 'measure', 'chart', 'insight'],
   },
   { id: 'other', label: 'Unmapped', cues: [] },
killedBy: stagesMatching returns an empty array for text with no cue
statusReason: expected [ { id: 'learn', …(2) } ] to deeply equal []

[Killed] StringLiteral
product/src/decompose/story-map.ts:82:57
   {
     id: 'learn',
     label: 'Learn from it',
-    cues: ['report', 'dashboard', 'metric', 'analytic', 'audit', 'history', 'measure', 'chart', 'insight'],
+    cues: ['report', 'dashboard', 'metric', 'analytic', "", 'history', 'measure', 'chart', 'insight'],
   },
   { id: 'other', label: 'Unmapped', cues: [] },
killedBy: stagesMatching returns an empty array for text with no cue
statusReason: expected [ { id: 'learn', …(2) } ] to deeply equal []

[Killed] BlockStatement
product/src/decompose/story-map.ts:88:71
 ];
 
 /** Every stage (catalog order) with at least one cue that is a substring of `text`. Never includes `other`. */
-export function stagesMatching(text: string): readonly JourneyStage[] {
-  const lowered = text.toLowerCase();
-  return JOURNEY_STAGES.filter((stage) => stage.cues.some((cue) => lowered.includes(cue)));
-}
+export function stagesMatching(text: string): readonly JourneyStage[] {}
 
 const OTHER_STAGE = JOURNEY_STAGES.find((s) => s.id === 'other')!;
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
product/src/decompose/story-map.ts:89:19
 
 /** Every stage (catalog order) with at least one cue that is a substring of `text`. Never includes `other`. */
 export function stagesMatching(text: string): readonly JourneyStage[] {
-  const lowered = text.toLowerCase();
+  const lowered = text.toUpperCase();
   return JOURNEY_STAGES.filter((stage) => stage.cues.some((cue) => lowered.includes(cue)));
 }
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] MethodExpression
product/src/decompose/story-map.ts:90:43
 /** Every stage (catalog order) with at least one cue that is a substring of `text`. Never includes `other`. */
 export function stagesMatching(text: string): readonly JourneyStage[] {
   const lowered = text.toLowerCase();
-  return JOURNEY_STAGES.filter((stage) => stage.cues.some((cue) => lowered.includes(cue)));
+  return JOURNEY_STAGES.filter((stage) => stage.cues.every(cue => lowered.includes(cue)));
 }
 
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [ 'other' ] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] ArrowFunction
product/src/decompose/story-map.ts:90:59
 /** Every stage (catalog order) with at least one cue that is a substring of `text`. Never includes `other`. */
 export function stagesMatching(text: string): readonly JourneyStage[] {
   const lowered = text.toLowerCase();
-  return JOURNEY_STAGES.filter((stage) => stage.cues.some((cue) => lowered.includes(cue)));
+  return JOURNEY_STAGES.filter((stage) => stage.cues.some(() => undefined));
 }
 
killedBy: stagesMatching returns catalog-ordered stages for text spanning multiple stages
statusReason: expected [] to deeply equal [ 'capture', 'deliver', 'learn' ]

[Killed] ArrowFunction
product/src/decompose/story-map.ts:93:41
   return JOURNEY_STAGES.filter((stage) => stage.cues.some((cue) => lowered.includes(cue)));
 }
 
-const OTHER_STAGE = JOURNEY_STAGES.find((s) => s.id === 'other')!;
+const OTHER_STAGE = JOURNEY_STAGES.find(() => undefined)!;
 
 /** The earliest-matching stage for `text`, falling back to the terminal `other` stage. */
killedBy: buildStoryMap lands a scope statement matching no cue on the other step, which ranks last
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
product/src/decompose/story-map.ts:93:48
   return JOURNEY_STAGES.filter((stage) => stage.cues.some((cue) => lowered.includes(cue)));
 }
 
-const OTHER_STAGE = JOURNEY_STAGES.find((s) => s.id === 'other')!;
+const OTHER_STAGE = JOURNEY_STAGES.find((s) => s.id !== 'other')!;
 
 /** The earliest-matching stage for `text`, falling back to the terminal `other` stage. */
killedBy: buildStoryMap lands a scope statement matching no cue on the other step, which ranks last
statusReason: expected undefined to be defined

[Killed] BlockStatement
product/src/decompose/story-map.ts:96:51
 const OTHER_STAGE = JOURNEY_STAGES.find((s) => s.id === 'other')!;
 
 /** The earliest-matching stage for `text`, falling back to the terminal `other` stage. */
-function primaryStage(text: string): JourneyStage {
-  return stagesMatching(text)[0] ?? OTHER_STAGE;
-}
+function primaryStage(text: string): JourneyStage {}
 
 /** Derive the journey backbone from a doc's scope and outcome statements. Pure. */
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
product/src/decompose/story-map.ts:97:10
 
 /** The earliest-matching stage for `text`, falling back to the terminal `other` stage. */
 function primaryStage(text: string): JourneyStage {
-  return stagesMatching(text)[0] ?? OTHER_STAGE;
+  return stagesMatching(text)[0] && OTHER_STAGE;
 }
 
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: expected undefined to deeply equal [ 'INT-SCOPE-01', 'INT-SCOPE-02' ]

[Killed] ConditionalExpression
product/src/decompose/story-map.ts:102:47
 
 /** Derive the journey backbone from a doc's scope and outcome statements. Pure. */
 export function buildStoryMap(doc: IntentDoc): StoryMap {
-  const scopes = doc.statements.filter((s) => s.dimension === 'scope');
+  const scopes = doc.statements.filter((s) => true);
   const outcomes = doc.statements.filter((s) => s.dimension === 'outcome');
 
killedBy: buildStoryMap admits a stage to the backbone via an outcome mention, with empty scopeIds
statusReason: expected [ 'INT-OUTCOME-01' ] to deeply equal []

[Killed] EqualityOperator
product/src/decompose/story-map.ts:102:47
 
 /** Derive the journey backbone from a doc's scope and outcome statements. Pure. */
 export function buildStoryMap(doc: IntentDoc): StoryMap {
-  const scopes = doc.statements.filter((s) => s.dimension === 'scope');
+  const scopes = doc.statements.filter((s) => s.dimension !== 'scope');
   const outcomes = doc.statements.filter((s) => s.dimension === 'outcome');
 
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: expected undefined to deeply equal [ 'INT-SCOPE-01', 'INT-SCOPE-02' ]

[Killed] MethodExpression
product/src/decompose/story-map.ts:103:20
 /** Derive the journey backbone from a doc's scope and outcome statements. Pure. */
 export function buildStoryMap(doc: IntentDoc): StoryMap {
   const scopes = doc.statements.filter((s) => s.dimension === 'scope');
-  const outcomes = doc.statements.filter((s) => s.dimension === 'outcome');
+  const outcomes = doc.statements;
 
   const scopeIdsByStage = new Map<JourneyStageId, IntentStatementId[]>();
killedBy: buildStoryMap returns an empty backbone for a doc with no scope or outcome statements
statusReason: expected [ { …(3) } ] to deeply equal []

[Killed] ConditionalExpression
product/src/decompose/story-map.ts:103:49
 /** Derive the journey backbone from a doc's scope and outcome statements. Pure. */
 export function buildStoryMap(doc: IntentDoc): StoryMap {
   const scopes = doc.statements.filter((s) => s.dimension === 'scope');
-  const outcomes = doc.statements.filter((s) => s.dimension === 'outcome');
+  const outcomes = doc.statements.filter((s) => false);
 
   const scopeIdsByStage = new Map<JourneyStageId, IntentStatementId[]>();
killedBy: buildStoryMap admits a stage to the backbone via an outcome mention, with empty scopeIds
statusReason: expected undefined to be defined

[Killed] BlockStatement
product/src/decompose/story-map.ts:106:31
   const outcomes = doc.statements.filter((s) => s.dimension === 'outcome');
 
   const scopeIdsByStage = new Map<JourneyStageId, IntentStatementId[]>();
-  for (const scope of scopes) {
-    const stageId = primaryStage(scope.text).id;
-    const bucket = scopeIdsByStage.get(stageId);
-    if (bucket) {
-      bucket.push(scope.id);
-    } else {
-      scopeIdsByStage.set(stageId, [scope.id]);
-    }
-  }
+  for (const scope of scopes) {}
 
   const outcomeStageIds = new Set<JourneyStageId>(
killedBy: main: decompose approves the intent doc and writes the rendered decomposition
statusReason: Cannot read properties of undefined (reading 'stage')

[Killed] ConditionalExpression
product/src/decompose/story-map.ts:109:9
   for (const scope of scopes) {
     const stageId = primaryStage(scope.text).id;
     const bucket = scopeIdsByStage.get(stageId);
-    if (bucket) {
+    if (true) {
       bucket.push(scope.id);
     } else {
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
product/src/decompose/story-map.ts:109:9
   for (const scope of scopes) {
     const stageId = primaryStage(scope.text).id;
     const bucket = scopeIdsByStage.get(stageId);
-    if (bucket) {
+    if (false) {
       bucket.push(scope.id);
     } else {
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: expected [ 'INT-SCOPE-02' ] to deeply equal [ 'INT-SCOPE-01', 'INT-SCOPE-02' ]

[Killed] CallExpression
product/src/decompose/story-map.ts:110:7
     const stageId = primaryStage(scope.text).id;
     const bucket = scopeIdsByStage.get(stageId);
     if (bucket) {
-      bucket.push(scope.id);
+      ;
     } else {
       scopeIdsByStage.set(stageId, [scope.id]);
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: expected [ 'INT-SCOPE-01' ] to deeply equal [ 'INT-SCOPE-01', 'INT-SCOPE-02' ]

[Killed] BlockStatement
product/src/decompose/story-map.ts:111:12
     const bucket = scopeIdsByStage.get(stageId);
     if (bucket) {
       bucket.push(scope.id);
-    } else {
-      scopeIdsByStage.set(stageId, [scope.id]);
-    }
+    } else {}
   }
 
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: expected undefined to deeply equal [ 'INT-SCOPE-01', 'INT-SCOPE-02' ]

[Killed] ArrowFunction
product/src/decompose/story-map.ts:117:73
   }
 
   const outcomeStageIds = new Set<JourneyStageId>(
-    outcomes.flatMap((o: IntentStatement) => stagesMatching(o.text).map((stage) => stage.id)),
+    outcomes.flatMap((o: IntentStatement) => stagesMatching(o.text).map(() => undefined)),
   );
 
killedBy: buildStoryMap admits a stage to the backbone via an outcome mention, with empty scopeIds
statusReason: expected undefined to be defined

[Killed] ArrowFunction
product/src/decompose/story-map.ts:117:22
   }
 
   const outcomeStageIds = new Set<JourneyStageId>(
-    outcomes.flatMap((o: IntentStatement) => stagesMatching(o.text).map((stage) => stage.id)),
+    outcomes.flatMap(() => undefined),
   );
 
killedBy: buildStoryMap admits a stage to the backbone via an outcome mention, with empty scopeIds
statusReason: expected undefined to be defined

[Killed] BlockStatement
product/src/decompose/story-map.ts:122:39
 
   const backbone: BackboneStep[] = [];
   let rank = 0;
-  for (const stage of JOURNEY_STAGES) {
-    const scopeIds = scopeIdsByStage.get(stage.id) ?? [];
-    if (scopeIds.length === 0 && !outcomeStageIds.has(stage.id)) {
-      continue;
-    }
-    rank += 1;
-    backbone.push({ stage, rank, scopeIds });
-  }
+  for (const stage of JOURNEY_STAGES) {}
 
   return { backbone };
killedBy: main: decompose approves the intent doc and writes the rendered decomposition
statusReason: Cannot read properties of undefined (reading 'stage')

[Killed] LogicalOperator
product/src/decompose/story-map.ts:123:22
   const backbone: BackboneStep[] = [];
   let rank = 0;
   for (const stage of JOURNEY_STAGES) {
-    const scopeIds = scopeIdsByStage.get(stage.id) ?? [];
+    const scopeIds = scopeIdsByStage.get(stage.id) && [];
     if (scopeIds.length === 0 && !outcomeStageIds.has(stage.id)) {
       continue;
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
product/src/decompose/story-map.ts:124:9
   let rank = 0;
   for (const stage of JOURNEY_STAGES) {
     const scopeIds = scopeIdsByStage.get(stage.id) ?? [];
-    if (scopeIds.length === 0 && !outcomeStageIds.has(stage.id)) {
+    if (scopeIds.length === 0 || !outcomeStageIds.has(stage.id)) {
       continue;
     }
killedBy: buildStoryMap places each scope statement on its earliest matching stage, preserving doc order in scopeIds
statusReason: expected undefined to deeply equal [ 'INT-SCOPE-01', 'INT-SCOPE-02' ]

[Killed] BooleanLiteral
product/src/decompose/story-map.ts:124:34
   let rank = 0;
   for (const stage of JOURNEY_STAGES) {
     const scopeIds = scopeIdsByStage.get(stage.id) ?? [];
-    if (scopeIds.length === 0 && !outcomeStageIds.has(stage.id)) {
+    if (scopeIds.length === 0 && outcomeStageIds.has(stage.id)) {
       continue;
     }
killedBy: buildStoryMap compacts ranks 1..n over only the stages present, skipping stages with nothing on them
statusReason: expected [ 'access', 'discover', …(5) ] to deeply equal [ 'access', 'deliver' ]

[Killed] AssignmentOperator
product/src/decompose/story-map.ts:127:5
     if (scopeIds.length === 0 && !outcomeStageIds.has(stage.id)) {
       continue;
     }
-    rank += 1;
+    rank -= 1;
     backbone.push({ stage, rank, scopeIds });
   }
killedBy: buildStoryMap compacts ranks 1..n over only the stages present, skipping stages with nothing on them
statusReason: expected [ -1, -2 ] to deeply equal [ 1, 2 ]
