[Killed] BlockStatement
product/src/export/bundle.ts:20:69
   files: readonly BundleFile[];
 }
 
-function toFile(path: string, lines: readonly string[]): BundleFile {
-  return { path, content: `${lines.join('\n')}\n` };
-}
+function toFile(path: string, lines: readonly string[]): BundleFile {}
 
 function issueFile(path: string, title: string, body: string): BundleFile {
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: Cannot read properties of undefined (reading 'path')

[Killed] BlockStatement
product/src/export/bundle.ts:24:75
   return { path, content: `${lines.join('\n')}\n` };
 }
 
-function issueFile(path: string, title: string, body: string): BundleFile {
-  return toFile(path, [`# ${title}`, '', body]);
-}
+function issueFile(path: string, title: string, body: string): BundleFile {}
 
 function padOrdinal(ordinal: number): string {
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: Cannot read properties of undefined (reading 'path')

[Survived] StringLiteral
product/src/export/bundle.ts:25:24
 }
 
 function issueFile(path: string, title: string, body: string): BundleFile {
-  return toFile(path, [`# ${title}`, '', body]);
+  return toFile(path, [``, '', body]);
 }
 

[Killed] BlockStatement
product/src/export/bundle.ts:28:46
   return toFile(path, [`# ${title}`, '', body]);
 }
 
-function padOrdinal(ordinal: number): string {
-  return String(ordinal).padStart(2, '0');
-}
+function padOrdinal(ordinal: number): string {}
 
 function renderTargetTypes(targetTypes: readonly TargetType[]): string[] {
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: expected [ 'intent.md', 'issues/epic.md', …(4) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(4) ]

[Killed] StringLiteral
product/src/export/bundle.ts:29:38
 }
 
 function padOrdinal(ordinal: number): string {
-  return String(ordinal).padStart(2, '0');
+  return String(ordinal).padStart(2, "");
 }
 
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(6) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] BlockStatement
product/src/export/bundle.ts:32:74
   return String(ordinal).padStart(2, '0');
 }
 
-function renderTargetTypes(targetTypes: readonly TargetType[]): string[] {
-  if (targetTypes.length === 0) {
-    return [];
-  }
-  return targetTypes.map((t) => `- ${t.name} (${t.kind}) — ${t.file}`);
-}
+function renderTargetTypes(targetTypes: readonly TargetType[]): string[] {}
 
 function renderSignatures(signatures: readonly Signature[]): string[] {
killedBy: renderArchitectureReport includes the renderEpicArchitecture body, ADR conformance markers, and deviations
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
product/src/export/bundle.ts:33:7
 }
 
 function renderTargetTypes(targetTypes: readonly TargetType[]): string[] {
-  if (targetTypes.length === 0) {
+  if (true) {
     return [];
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Target types\n- Thing (added) — so…'

[Killed] EqualityOperator
product/src/export/bundle.ts:33:7
 }
 
 function renderTargetTypes(targetTypes: readonly TargetType[]): string[] {
-  if (targetTypes.length === 0) {
+  if (targetTypes.length !== 0) {
     return [];
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Target types\n- Thing (added) — so…'

[Killed] ArrayDeclaration
product/src/export/bundle.ts:34:12
 
 function renderTargetTypes(targetTypes: readonly TargetType[]): string[] {
   if (targetTypes.length === 0) {
-    return [];
+    return ["Stryker was here"];
   }
   return targetTypes.map((t) => `- ${t.name} (${t.kind}) — ${t.file}`);
killedBy: renderEpicArchitecture skips targetTypes/signatures/callGraph sections and prints "None." for empty openQuestions
statusReason: expected '# Epic architecture\n\n## Problem\npr…' not to contain '## Target types'

[Killed] ArrowFunction
product/src/export/bundle.ts:36:26
   if (targetTypes.length === 0) {
     return [];
   }
-  return targetTypes.map((t) => `- ${t.name} (${t.kind}) — ${t.file}`);
+  return targetTypes.map(() => undefined);
 }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Target types\n- Thing (added) — so…'

[Killed] BlockStatement
product/src/export/bundle.ts:39:71
   return targetTypes.map((t) => `- ${t.name} (${t.kind}) — ${t.file}`);
 }
 
-function renderSignatures(signatures: readonly Signature[]): string[] {
-  if (signatures.length === 0) {
-    return [];
-  }
-  return signatures.map((s) => `- ${s.symbol} — ${s.signature}`);
-}
+function renderSignatures(signatures: readonly Signature[]): string[] {}
 
 function renderCallGraph(callGraph: readonly CallEdge[]): string[] {
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
product/src/export/bundle.ts:40:7
 }
 
 function renderSignatures(signatures: readonly Signature[]): string[] {
-  if (signatures.length === 0) {
+  if (signatures.length !== 0) {
     return [];
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Signatures\n- doThing — () => void'

[Killed] ConditionalExpression
product/src/export/bundle.ts:40:7
 }
 
 function renderSignatures(signatures: readonly Signature[]): string[] {
-  if (signatures.length === 0) {
+  if (true) {
     return [];
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Signatures\n- doThing — () => void'

[Killed] ArrowFunction
product/src/export/bundle.ts:43:25
   if (signatures.length === 0) {
     return [];
   }
-  return signatures.map((s) => `- ${s.symbol} — ${s.signature}`);
+  return signatures.map(() => undefined);
 }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Signatures\n- doThing — () => void'

[Killed] BlockStatement
product/src/export/bundle.ts:46:68
   return signatures.map((s) => `- ${s.symbol} — ${s.signature}`);
 }
 
-function renderCallGraph(callGraph: readonly CallEdge[]): string[] {
-  if (callGraph.length === 0) {
-    return [];
-  }
-  return callGraph.map((edge) => `- ${edge.from} -> ${edge.to}${edge.note !== undefined ? `: ${edge.note}` : ''}`);
-}
+function renderCallGraph(callGraph: readonly CallEdge[]): string[] {}
 
 /** Renders an epic-level DesignArtifact into architecture.md's body lines. */
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
product/src/export/bundle.ts:47:7
 }
 
 function renderCallGraph(callGraph: readonly CallEdge[]): string[] {
-  if (callGraph.length === 0) {
+  if (true) {
     return [];
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Call graph\n- a -> b: calls b'

[Killed] EqualityOperator
product/src/export/bundle.ts:47:7
 }
 
 function renderCallGraph(callGraph: readonly CallEdge[]): string[] {
-  if (callGraph.length === 0) {
+  if (callGraph.length !== 0) {
     return [];
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Call graph\n- a -> b: calls b'

[Killed] ArrayDeclaration
product/src/export/bundle.ts:48:12
 
 function renderCallGraph(callGraph: readonly CallEdge[]): string[] {
   if (callGraph.length === 0) {
-    return [];
+    return ["Stryker was here"];
   }
   return callGraph.map((edge) => `- ${edge.from} -> ${edge.to}${edge.note !== undefined ? `: ${edge.note}` : ''}`);
killedBy: renderEpicArchitecture skips targetTypes/signatures/callGraph sections and prints "None." for empty openQuestions
statusReason: expected '# Epic architecture\n\n## Problem\npr…' not to contain '## Call graph'

[Killed] ConditionalExpression
product/src/export/bundle.ts:50:65
   if (callGraph.length === 0) {
     return [];
   }
-  return callGraph.map((edge) => `- ${edge.from} -> ${edge.to}${edge.note !== undefined ? `: ${edge.note}` : ''}`);
+  return callGraph.map((edge) => `- ${edge.from} -> ${edge.to}${false ? `: ${edge.note}` : ''}`);
 }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Call graph\n- a -> b: calls b'

[Killed] ConditionalExpression
product/src/export/bundle.ts:50:65
   if (callGraph.length === 0) {
     return [];
   }
-  return callGraph.map((edge) => `- ${edge.from} -> ${edge.to}${edge.note !== undefined ? `: ${edge.note}` : ''}`);
+  return callGraph.map((edge) => `- ${edge.from} -> ${edge.to}${true ? `: ${edge.note}` : ''}`);
 }
 
killedBy: renderEpicArchitecture renders a call graph edge without a note using only "from -> to"
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '- a -> b\n'

[Killed] ArrayDeclaration
product/src/export/bundle.ts:55:27
 
 /** Renders an epic-level DesignArtifact into architecture.md's body lines. */
 export function renderEpicArchitecture(artifact: DesignArtifact): string[] {
-  const lines: string[] = ['# Epic architecture', '', '## Problem', artifact.restatedProblem];
+  const lines: string[] = [];
 
   lines.push('', '## Approach', artifact.approach.chosen);
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '\n## Approach\nchosen approach\n\nRej…' to contain '## Problem\nproblem restated'

[Survived] StringLiteral
product/src/export/bundle.ts:57:14
 export function renderEpicArchitecture(artifact: DesignArtifact): string[] {
   const lines: string[] = ['# Epic architecture', '', '## Problem', artifact.restatedProblem];
 
-  lines.push('', '## Approach', artifact.approach.chosen);
+  lines.push("Stryker was here!", '## Approach', artifact.approach.chosen);
   if (artifact.approach.rejected.length > 0) {
     lines.push('', 'Rejected:');

[Killed] EqualityOperator
product/src/export/bundle.ts:58:7
   const lines: string[] = ['# Epic architecture', '', '## Problem', artifact.restatedProblem];
 
   lines.push('', '## Approach', artifact.approach.chosen);
-  if (artifact.approach.rejected.length > 0) {
+  if (artifact.approach.rejected.length <= 0) {
     lines.push('', 'Rejected:');
     for (const rejected of artifact.approach.rejected) {
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain 'Rejected:\n- alt — worse'

[Killed] ConditionalExpression
product/src/export/bundle.ts:58:7
   const lines: string[] = ['# Epic architecture', '', '## Problem', artifact.restatedProblem];
 
   lines.push('', '## Approach', artifact.approach.chosen);
-  if (artifact.approach.rejected.length > 0) {
+  if (false) {
     lines.push('', 'Rejected:');
     for (const rejected of artifact.approach.rejected) {
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain 'Rejected:\n- alt — worse'

[Killed] BlockStatement
product/src/export/bundle.ts:60:56
   lines.push('', '## Approach', artifact.approach.chosen);
   if (artifact.approach.rejected.length > 0) {
     lines.push('', 'Rejected:');
-    for (const rejected of artifact.approach.rejected) {
-      lines.push(`- ${rejected.option} — ${rejected.reason}`);
-    }
+    for (const rejected of artifact.approach.rejected) {}
   }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain 'Rejected:\n- alt — worse'

[Killed] BlockStatement
product/src/export/bundle.ts:66:50
   }
 
   lines.push('', '## Interfaces touched');
-  for (const item of artifact.interfacesTouched) {
-    lines.push(`- ${item}`);
-  }
+  for (const item of artifact.interfacesTouched) {}
 
   const targetTypeLines = renderTargetTypes(artifact.targetTypes);
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Interfaces touched\n- some/file.ts'

[Killed] StringLiteral
product/src/export/bundle.ts:67:16
 
   lines.push('', '## Interfaces touched');
   for (const item of artifact.interfacesTouched) {
-    lines.push(`- ${item}`);
+    lines.push(``);
   }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Interfaces touched\n- some/file.ts'

[Killed] EqualityOperator
product/src/export/bundle.ts:71:7
   }
 
   const targetTypeLines = renderTargetTypes(artifact.targetTypes);
-  if (targetTypeLines.length > 0) {
+  if (targetTypeLines.length >= 0) {
     lines.push('', '## Target types', ...targetTypeLines);
   }
killedBy: renderEpicArchitecture skips targetTypes/signatures/callGraph sections and prints "None." for empty openQuestions
statusReason: expected '# Epic architecture\n\n## Problem\npr…' not to contain '## Target types'

[Killed] ConditionalExpression
product/src/export/bundle.ts:71:7
   }
 
   const targetTypeLines = renderTargetTypes(artifact.targetTypes);
-  if (targetTypeLines.length > 0) {
+  if (true) {
     lines.push('', '## Target types', ...targetTypeLines);
   }
killedBy: renderEpicArchitecture skips targetTypes/signatures/callGraph sections and prints "None." for empty openQuestions
statusReason: expected '# Epic architecture\n\n## Problem\npr…' not to contain '## Target types'

[Killed] BlockStatement
product/src/export/bundle.ts:76:34
   }
 
   const signatureLines = renderSignatures(artifact.signatures);
-  if (signatureLines.length > 0) {
-    lines.push('', '## Signatures', ...signatureLines);
-  }
+  if (signatureLines.length > 0) {}
 
   const callGraphLines = renderCallGraph(artifact.callGraph);
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Signatures\n- doThing — () => void'

[Killed] EqualityOperator
product/src/export/bundle.ts:76:7
   }
 
   const signatureLines = renderSignatures(artifact.signatures);
-  if (signatureLines.length > 0) {
+  if (signatureLines.length <= 0) {
     lines.push('', '## Signatures', ...signatureLines);
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Signatures\n- doThing — () => void'

[Killed] EqualityOperator
product/src/export/bundle.ts:81:7
   }
 
   const callGraphLines = renderCallGraph(artifact.callGraph);
-  if (callGraphLines.length > 0) {
+  if (callGraphLines.length <= 0) {
     lines.push('', '## Call graph', ...callGraphLines);
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Call graph\n- a -> b: calls b'

[Killed] ConditionalExpression
product/src/export/bundle.ts:81:7
   }
 
   const callGraphLines = renderCallGraph(artifact.callGraph);
-  if (callGraphLines.length > 0) {
+  if (false) {
     lines.push('', '## Call graph', ...callGraphLines);
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Call graph\n- a -> b: calls b'

[Killed] StringLiteral
product/src/export/bundle.ts:82:20
 
   const callGraphLines = renderCallGraph(artifact.callGraph);
   if (callGraphLines.length > 0) {
-    lines.push('', '## Call graph', ...callGraphLines);
+    lines.push('', "", ...callGraphLines);
   }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Call graph\n- a -> b: calls b'

[Killed] BlockStatement
product/src/export/bundle.ts:86:49
   }
 
   lines.push('', '## Behavior contract');
-  for (const item of artifact.behaviorContract) {
-    lines.push(`- ${item}`);
-  }
+  for (const item of artifact.behaviorContract) {}
 
   lines.push('', '## Verification');
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Behavior contract\n- does the thing'

[Killed] BlockStatement
product/src/export/bundle.ts:91:49
   }
 
   lines.push('', '## Verification');
-  for (const step of artifact.verificationPlan) {
-    lines.push(`- ${step.command} — passes when: ${step.passWhen}`);
-  }
+  for (const step of artifact.verificationPlan) {}
 
   lines.push('', '## Risk / blast radius', artifact.riskBlastRadius);
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Verification\n- npm test — passes …'

[Killed] StringLiteral
product/src/export/bundle.ts:92:16
 
   lines.push('', '## Verification');
   for (const step of artifact.verificationPlan) {
-    lines.push(`- ${step.command} — passes when: ${step.passWhen}`);
+    lines.push(``);
   }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Verification\n- npm test — passes …'

[Survived] StringLiteral
product/src/export/bundle.ts:97:14
 
   lines.push('', '## Risk / blast radius', artifact.riskBlastRadius);
 
-  lines.push('', '## Open questions');
+  lines.push("Stryker was here!", '## Open questions');
   if (artifact.openQuestions.length === 0) {
     lines.push('None.');

[Killed] EqualityOperator
product/src/export/bundle.ts:98:7
   lines.push('', '## Risk / blast radius', artifact.riskBlastRadius);
 
   lines.push('', '## Open questions');
-  if (artifact.openQuestions.length === 0) {
+  if (artifact.openQuestions.length !== 0) {
     lines.push('None.');
   } else {
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Open questions\n- what about x?'

[Killed] BlockStatement
product/src/export/bundle.ts:98:44
   lines.push('', '## Risk / blast radius', artifact.riskBlastRadius);
 
   lines.push('', '## Open questions');
-  if (artifact.openQuestions.length === 0) {
-    lines.push('None.');
-  } else {
+  if (artifact.openQuestions.length === 0) {} else {
     for (const question of artifact.openQuestions) {
       lines.push(`- ${question}`);
killedBy: renderEpicArchitecture skips targetTypes/signatures/callGraph sections and prints "None." for empty openQuestions
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Open questions\nNone.'

[Killed] BlockStatement
product/src/export/bundle.ts:100:10
   lines.push('', '## Open questions');
   if (artifact.openQuestions.length === 0) {
     lines.push('None.');
-  } else {
-    for (const question of artifact.openQuestions) {
-      lines.push(`- ${question}`);
-    }
-  }
+  } else {}
 
   return lines;
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Open questions\n- what about x?'

[Killed] BlockStatement
product/src/export/bundle.ts:101:52
   if (artifact.openQuestions.length === 0) {
     lines.push('None.');
   } else {
-    for (const question of artifact.openQuestions) {
-      lines.push(`- ${question}`);
-    }
+    for (const question of artifact.openQuestions) {}
   }
 
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Open questions\n- what about x?'

[Killed] StringLiteral
product/src/export/bundle.ts:102:18
     lines.push('None.');
   } else {
     for (const question of artifact.openQuestions) {
-      lines.push(`- ${question}`);
+      lines.push(``);
     }
   }
killedBy: renderEpicArchitecture renders every populated section
statusReason: expected '# Epic architecture\n\n## Problem\npr…' to contain '## Open questions\n- what about x?'

[Killed] BlockStatement
product/src/export/bundle.ts:110:76
 }
 
 /** Renders one proposed ADR draft into a bundle file, forced Status: Proposed, no number/date. */
-export function adrDraftFile(draft: AdrDraft, ordinal: number): BundleFile {
-  const adr = createAdr({
-    title: draft.title,
-    status: 'Proposed',
-    context: draft.context,
-    decision: draft.decision,
-    consequences: draft.consequences,
-    references: draft.references.map((r) => ({ text: r.text, url: r.url, marker: '-' })),
-  });
-
-  return { path: `adr-drafts/draft-${padOrdinal(ordinal)}-${adrSlug(draft.title)}.md`, content: serializeAdr(adr) };
-}
+export function adrDraftFile(draft: AdrDraft, ordinal: number): BundleFile {}
 
 /** Assembles the in-memory markdown handoff bundle from the proposer's artifacts and readiness report. */
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'path')

[Killed] ArrowFunction
product/src/export/bundle.ts:117:38
     context: draft.context,
     decision: draft.decision,
     consequences: draft.consequences,
-    references: draft.references.map((r) => ({ text: r.text, url: r.url, marker: '-' })),
+    references: draft.references.map(() => undefined),
   });
 
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] ObjectLiteral
product/src/export/bundle.ts:117:46
     context: draft.context,
     decision: draft.decision,
     consequences: draft.consequences,
-    references: draft.references.map((r) => ({ text: r.text, url: r.url, marker: '-' })),
+    references: draft.references.map((r) => ({})),
   });
 
killedBy: buildDesignBundle forces every ADR draft file to Status: Proposed regardless of the draft status, with no Accepted, number, or date
statusReason: expected '# Use a readiness module\n\n- Status:…' to contain '- [Issue #475](https://example.com/47…'

[Killed] ObjectLiteral
product/src/export/bundle.ts:120:10
     references: draft.references.map((r) => ({ text: r.text, url: r.url, marker: '-' })),
   });
 
-  return { path: `adr-drafts/draft-${padOrdinal(ordinal)}-${adrSlug(draft.title)}.md`, content: serializeAdr(adr) };
+  return {};
 }
 
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(6) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] StringLiteral
product/src/export/bundle.ts:120:18
     references: draft.references.map((r) => ({ text: r.text, url: r.url, marker: '-' })),
   });
 
-  return { path: `adr-drafts/draft-${padOrdinal(ordinal)}-${adrSlug(draft.title)}.md`, content: serializeAdr(adr) };
+  return { path: ``, content: serializeAdr(adr) };
 }
 
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(6) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] ConditionalExpression
product/src/export/bundle.ts:127:7
 export function buildDesignBundle(artifacts: ProposerArtifacts, report: ReadinessReport): DesignBundle {
   const files: BundleFile[] = [];
 
-  if (artifacts.intent !== undefined) {
+  if (true) {
     files.push(toFile('intent.md', renderIntentDoc(artifacts.intent)));
   }
killedBy: buildDesignBundle omits files whose optional artifact is absent, while readiness.md is always present
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
product/src/export/bundle.ts:127:7
 export function buildDesignBundle(artifacts: ProposerArtifacts, report: ReadinessReport): DesignBundle {
   const files: BundleFile[] = [];
 
-  if (artifacts.intent !== undefined) {
+  if (artifacts.intent === undefined) {
     files.push(toFile('intent.md', renderIntentDoc(artifacts.intent)));
   }
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'issues/epic.md', …(6) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] BlockStatement
product/src/export/bundle.ts:131:46
     files.push(toFile('intent.md', renderIntentDoc(artifacts.intent)));
   }
 
-  if (artifacts.decomposition !== undefined) {
-    const { epic, stories } = artifacts.decomposition;
-    const epicPayload = renderEpicIssue(epic);
-    files.push(issueFile('issues/epic.md', epicPayload.title, epicPayload.body));
-
-    stories.forEach((story, i) => {
-      const payload = renderStoryIssue(story);
-      files.push(issueFile(`issues/story-${padOrdinal(i + 1)}.md`, payload.title, payload.body));
-    });
-  }
+  if (artifacts.decomposition !== undefined) {}
 
   if (artifacts.epicArchitecture !== undefined) {
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ Array(5) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] ConditionalExpression
product/src/export/bundle.ts:131:7
     files.push(toFile('intent.md', renderIntentDoc(artifacts.intent)));
   }
 
-  if (artifacts.decomposition !== undefined) {
+  if (true) {
     const { epic, stories } = artifacts.decomposition;
     const epicPayload = renderEpicIssue(epic);
killedBy: buildDesignBundle omits the decomposition-derived files entirely when there is no decomposition
statusReason: Cannot destructure property 'epic' of 'artifacts.decomposition' as it is undefined.

[Killed] BlockStatement
product/src/export/bundle.ts:136:35
     const epicPayload = renderEpicIssue(epic);
     files.push(issueFile('issues/epic.md', epicPayload.title, epicPayload.body));
 
-    stories.forEach((story, i) => {
-      const payload = renderStoryIssue(story);
-      files.push(issueFile(`issues/story-${padOrdinal(i + 1)}.md`, payload.title, payload.body));
-    });
+    stories.forEach((story, i) => {});
   }
 
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(4) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] ArithmeticOperator
product/src/export/bundle.ts:138:55
 
     stories.forEach((story, i) => {
       const payload = renderStoryIssue(story);
-      files.push(issueFile(`issues/story-${padOrdinal(i + 1)}.md`, payload.title, payload.body));
+      files.push(issueFile(`issues/story-${padOrdinal(i - 1)}.md`, payload.title, payload.body));
     });
   }
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(6) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] StringLiteral
product/src/export/bundle.ts:138:28
 
     stories.forEach((story, i) => {
       const payload = renderStoryIssue(story);
-      files.push(issueFile(`issues/story-${padOrdinal(i + 1)}.md`, payload.title, payload.body));
+      files.push(issueFile(``, payload.title, payload.body));
     });
   }
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(6) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] BlockStatement
product/src/export/bundle.ts:142:49
     });
   }
 
-  if (artifacts.epicArchitecture !== undefined) {
-    files.push(toFile('architecture.md', renderEpicArchitecture(artifacts.epicArchitecture)));
-  }
+  if (artifacts.epicArchitecture !== undefined) {}
 
   if (artifacts.adrConformance !== undefined) {
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(5) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]

[Killed] ConditionalExpression
product/src/export/bundle.ts:142:7
     });
   }
 
-  if (artifacts.epicArchitecture !== undefined) {
+  if (false) {
     files.push(toFile('architecture.md', renderEpicArchitecture(artifacts.epicArchitecture)));
   }
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: expected [ 'intent.md', 'issues/epic.md', …(5) ] to deeply equal [ 'intent.md', 'issues/epic.md', …(6) ]
