[Killed] ObjectLiteral
product/src/export/github.ts:46:31
 
   const epicPayload = renderEpicIssue(plan.epic);
   const createdEpic = await client.createIssue({ owner, repo, ...epicPayload });
-  const epic: ExportedIssue = {
-    kind: 'epic',
-    title: plan.epic.title,
-    number: createdEpic.number,
-    url: createdEpic.url,
-  };
+  const epic: ExportedIssue = {};
 
   const stories: ExportedIssue[] = [];
killedBy: exportToGitHub creates the epic first, then each story in plan order carrying "Part of #<epic>"
statusReason: expected 'As a user, I want a thing, so that va…' to contain 'Part of #100'

[Killed] StringLiteral
product/src/export/github.ts:47:11
   const epicPayload = renderEpicIssue(plan.epic);
   const createdEpic = await client.createIssue({ owner, repo, ...epicPayload });
   const epic: ExportedIssue = {
-    kind: 'epic',
+    kind: "",
     title: plan.epic.title,
     number: createdEpic.number,
killedBy: exportToGitHub returns the created epic/story numbers and urls, and the bundle comment count
statusReason: expected { kind: '', title: 'Epic', …(2) } to deeply equal { kind: 'epic', title: 'Epic', …(2) }

[Killed] BlockStatement
product/src/export/github.ts:54:37
   };
 
   const stories: ExportedIssue[] = [];
-  for (const story of plan.stories) {
-    const payload = renderStoryIssue(story, epic.number);
-    const created = await client.createIssue({ owner, repo, ...payload });
-    stories.push({ kind: 'story', title: story.title, number: created.number, url: created.url });
-  }
+  for (const story of plan.stories) {}
 
   for (const file of plan.bundle.files) {
killedBy: exportToGitHub creates the epic first, then each story in plan order carrying "Part of #<epic>"
statusReason: expected [ { owner: 'on-par', …(4) } ] to have a length of 3 but got 1

[Killed] ObjectLiteral
product/src/export/github.ts:56:46
   const stories: ExportedIssue[] = [];
   for (const story of plan.stories) {
     const payload = renderStoryIssue(story, epic.number);
-    const created = await client.createIssue({ owner, repo, ...payload });
+    const created = await client.createIssue({});
     stories.push({ kind: 'story', title: story.title, number: created.number, url: created.url });
   }
killedBy: exportToGitHub creates the epic first, then each story in plan order carrying "Part of #<epic>"
statusReason: expected undefined to be 'Story One' // Object.is equality

[Killed] BlockStatement
product/src/export/github.ts:60:41
     stories.push({ kind: 'story', title: story.title, number: created.number, url: created.url });
   }
 
-  for (const file of plan.bundle.files) {
-    await client.commentIssue({
-      owner,
-      repo,
-      issue_number: epic.number,
-      body: `## Design Bundle — ${file.path}\n\n${file.content}`,
-    });
-  }
+  for (const file of plan.bundle.files) {}
 
   return { epic, stories, bundleComments: plan.bundle.files.length };
killedBy: exportToGitHub attaches one commentIssue per bundle file to the epic issue, each headed by the bundle path
statusReason: expected [] to have a length of 2 but got +0
