[Killed] BlockStatement
product/src/export/render.ts:5:51
 
 import type { ExportedIssue, GitHubExportResult } from './github.js';
 
-function issueLabel(issue: ExportedIssue): string {
-  return issue.url !== undefined ? `#${issue.number} ${issue.title} (${issue.url})` : `#${issue.number} ${issue.title}`;
-}
+function issueLabel(issue: ExportedIssue): string {}
 
 /** Human-readable markdown lines for the CLI. Matches renderReadinessReport's plain-ASCII style. */
killedBy: renderExportResult renders the epic and stories with urls when present
statusReason: expected [ '# Export', 'Epic: undefined', …(2) ] to include 'Epic: #1 Epic (https://github.com/on-…'

[Killed] ConditionalExpression
product/src/export/render.ts:6:10
 import type { ExportedIssue, GitHubExportResult } from './github.js';
 
 function issueLabel(issue: ExportedIssue): string {
-  return issue.url !== undefined ? `#${issue.number} ${issue.title} (${issue.url})` : `#${issue.number} ${issue.title}`;
+  return false ? `#${issue.number} ${issue.title} (${issue.url})` : `#${issue.number} ${issue.title}`;
 }
 
killedBy: renderExportResult renders the epic and stories with urls when present
statusReason: expected [ '# Export', 'Epic: #1 Epic', …(2) ] to include 'Epic: #1 Epic (https://github.com/on-…'

[Killed] ConditionalExpression
product/src/export/render.ts:6:10
 import type { ExportedIssue, GitHubExportResult } from './github.js';
 
 function issueLabel(issue: ExportedIssue): string {
-  return issue.url !== undefined ? `#${issue.number} ${issue.title} (${issue.url})` : `#${issue.number} ${issue.title}`;
+  return true ? `#${issue.number} ${issue.title} (${issue.url})` : `#${issue.number} ${issue.title}`;
 }
 
killedBy: renderExportResult renders the epic and stories without a url suffix when absent
statusReason: expected [ '# Export', …(3) ] to include 'Epic: #1 Epic'

[Killed] BlockStatement
product/src/export/render.ts:10:74
 }
 
 /** Human-readable markdown lines for the CLI. Matches renderReadinessReport's plain-ASCII style. */
-export function renderExportResult(result: GitHubExportResult): string[] {
-  const lines: string[] = ['# Export', `Epic: ${issueLabel(result.epic)}`];
-
-  for (const story of result.stories) {
-    lines.push(`- Story: ${issueLabel(story)}`);
-  }
-
-  lines.push(`Bundle: ${result.bundleComments} file(s) attached to the epic issue.`);
-
-  return lines;
-}
+export function renderExportResult(result: GitHubExportResult): string[] {}
 
killedBy: renderExportResult renders the epic and stories with urls when present
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] StringLiteral
product/src/export/render.ts:11:40
 
 /** Human-readable markdown lines for the CLI. Matches renderReadinessReport's plain-ASCII style. */
 export function renderExportResult(result: GitHubExportResult): string[] {
-  const lines: string[] = ['# Export', `Epic: ${issueLabel(result.epic)}`];
+  const lines: string[] = ['# Export', ``];
 
   for (const story of result.stories) {
killedBy: renderExportResult renders the epic and stories with urls when present
statusReason: expected [ '# Export', '', …(2) ] to include 'Epic: #1 Epic (https://github.com/on-…'

[Killed] ArrayDeclaration
product/src/export/render.ts:11:27
 
 /** Human-readable markdown lines for the CLI. Matches renderReadinessReport's plain-ASCII style. */
 export function renderExportResult(result: GitHubExportResult): string[] {
-  const lines: string[] = ['# Export', `Epic: ${issueLabel(result.epic)}`];
+  const lines: string[] = [];
 
   for (const story of result.stories) {
killedBy: renderExportResult renders the epic and stories with urls when present
statusReason: expected [ …(2) ] to include '# Export'

[Killed] BlockStatement
product/src/export/render.ts:13:39
 export function renderExportResult(result: GitHubExportResult): string[] {
   const lines: string[] = ['# Export', `Epic: ${issueLabel(result.epic)}`];
 
-  for (const story of result.stories) {
-    lines.push(`- Story: ${issueLabel(story)}`);
-  }
+  for (const story of result.stories) {}
 
   lines.push(`Bundle: ${result.bundleComments} file(s) attached to the epic issue.`);
killedBy: renderExportResult renders the epic and stories with urls when present
statusReason: expected [ '# Export', …(2) ] to include '- Story: #2 Story One (https://github…'
