[Killed] BlockStatement
product/src/intent/render.ts:7:59
 import type { IntentDoc } from './intent-doc.js';
 
 /** Human-readable markdown lines for the CLI and the handoff bundle. */
-export function renderIntentDoc(doc: IntentDoc): string[] {
-  const lines: string[] = ['# Intent Doc', `Status: ${doc.status}`];
-
-  if (doc.approvedBy !== undefined) {
-    lines.push(`Approved by: ${doc.approvedBy}`);
-  }
-
-  lines.push(
-    `Statements: ${doc.statements.length}; open gaps: ${doc.gaps.length > 0 ? doc.gaps.join(', ') : '(none)'}`,
-  );
-
-  for (const dimension of INTENT_DIMENSIONS) {
-    const statements = doc.statements.filter((statement) => statement.dimension === dimension);
-    if (statements.length === 0) {
-      continue;
-    }
-    lines.push('', `## ${probeFor(dimension).label}`);
-    for (const statement of statements) {
-      lines.push(`- ${statement.id} — ${statement.text}`);
-    }
-  }
-
-  return lines;
-}
+export function renderIntentDoc(doc: IntentDoc): string[] {}
 
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] StringLiteral
product/src/intent/render.ts:8:28
 
 /** Human-readable markdown lines for the CLI and the handoff bundle. */
 export function renderIntentDoc(doc: IntentDoc): string[] {
-  const lines: string[] = ['# Intent Doc', `Status: ${doc.status}`];
+  const lines: string[] = ["", `Status: ${doc.status}`];
 
   if (doc.approvedBy !== undefined) {
killedBy: main: intent builds the intent doc from --text and writes it, closing the prompter
statusReason: expected "vi.fn()" to be called with arguments: [ '# Intent Doc' ]

Received:

  1st vi.fn() call:

  [
-   "# Intent Doc",

[Killed] BlockStatement
product/src/intent/render.ts:10:37
 export function renderIntentDoc(doc: IntentDoc): string[] {
   const lines: string[] = ['# Intent Doc', `Status: ${doc.status}`];
 
-  if (doc.approvedBy !== undefined) {
-    lines.push(`Approved by: ${doc.approvedBy}`);
-  }
+  if (doc.approvedBy !== undefined) {}
 
   lines.push(
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: expected "vi.fn()" to be called with arguments: [ 'Approved by: Pat' ]

Received:

  1st vi.fn() call:

  [
-   "Approved by: Pat",

[Killed] ConditionalExpression
product/src/intent/render.ts:10:7
 export function renderIntentDoc(doc: IntentDoc): string[] {
   const lines: string[] = ['# Intent Doc', `Status: ${doc.status}`];
 
-  if (doc.approvedBy !== undefined) {
+  if (false) {
     lines.push(`Approved by: ${doc.approvedBy}`);
   }
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: expected "vi.fn()" to be called with arguments: [ 'Approved by: Pat' ]

Received:

  1st vi.fn() call:

  [
-   "Approved by: Pat",

[Killed] StringLiteral
product/src/intent/render.ts:11:16
   const lines: string[] = ['# Intent Doc', `Status: ${doc.status}`];
 
   if (doc.approvedBy !== undefined) {
-    lines.push(`Approved by: ${doc.approvedBy}`);
+    lines.push(``);
   }
 
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: expected "vi.fn()" to be called with arguments: [ 'Approved by: Pat' ]

Received:

  1st vi.fn() call:

  [
-   "Approved by: Pat",

[Killed] EqualityOperator
product/src/intent/render.ts:15:57
   }
 
   lines.push(
-    `Statements: ${doc.statements.length}; open gaps: ${doc.gaps.length > 0 ? doc.gaps.join(', ') : '(none)'}`,
+    `Statements: ${doc.statements.length}; open gaps: ${doc.gaps.length >= 0 ? doc.gaps.join(', ') : '(none)'}`,
   );
 
killedBy: renderIntentDoc renders Approved by immediately after Status: approved, and open gaps: (none)
statusReason: expected 'Statements: 1; open gaps: ' to be 'Statements: 1; open gaps: (none)' // Object.is equality

[Killed] ConditionalExpression
product/src/intent/render.ts:15:57
   }
 
   lines.push(
-    `Statements: ${doc.statements.length}; open gaps: ${doc.gaps.length > 0 ? doc.gaps.join(', ') : '(none)'}`,
+    `Statements: ${doc.statements.length}; open gaps: ${true ? doc.gaps.join(', ') : '(none)'}`,
   );
 
killedBy: renderIntentDoc renders Approved by immediately after Status: approved, and open gaps: (none)
statusReason: expected 'Statements: 1; open gaps: ' to be 'Statements: 1; open gaps: (none)' // Object.is equality

[Killed] BlockStatement
product/src/intent/render.ts:18:46
     `Statements: ${doc.statements.length}; open gaps: ${doc.gaps.length > 0 ? doc.gaps.join(', ') : '(none)'}`,
   );
 
-  for (const dimension of INTENT_DIMENSIONS) {
-    const statements = doc.statements.filter((statement) => statement.dimension === dimension);
-    if (statements.length === 0) {
-      continue;
-    }
-    lines.push('', `## ${probeFor(dimension).label}`);
-    for (const statement of statements) {
-      lines.push(`- ${statement.id} — ${statement.text}`);
-    }
-  }
+  for (const dimension of INTENT_DIMENSIONS) {}
 
   return lines;
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(2) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] MethodExpression
product/src/intent/render.ts:19:24
   );
 
   for (const dimension of INTENT_DIMENSIONS) {
-    const statements = doc.statements.filter((statement) => statement.dimension === dimension);
+    const statements = doc.statements;
     if (statements.length === 0) {
       continue;
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(20) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] ConditionalExpression
product/src/intent/render.ts:19:61
   );
 
   for (const dimension of INTENT_DIMENSIONS) {
-    const statements = doc.statements.filter((statement) => statement.dimension === dimension);
+    const statements = doc.statements.filter((statement) => true);
     if (statements.length === 0) {
       continue;
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(20) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] ConditionalExpression
product/src/intent/render.ts:20:9
 
   for (const dimension of INTENT_DIMENSIONS) {
     const statements = doc.statements.filter((statement) => statement.dimension === dimension);
-    if (statements.length === 0) {
+    if (true) {
       continue;
     }
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(2) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] ConditionalExpression
product/src/intent/render.ts:20:9
 
   for (const dimension of INTENT_DIMENSIONS) {
     const statements = doc.statements.filter((statement) => statement.dimension === dimension);
-    if (statements.length === 0) {
+    if (false) {
       continue;
     }
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(15) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] StringLiteral
product/src/intent/render.ts:23:20
     if (statements.length === 0) {
       continue;
     }
-    lines.push('', `## ${probeFor(dimension).label}`);
+    lines.push('', ``);
     for (const statement of statements) {
       lines.push(`- ${statement.id} — ${statement.text}`);
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(5) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] StringLiteral
product/src/intent/render.ts:23:16
     if (statements.length === 0) {
       continue;
     }
-    lines.push('', `## ${probeFor(dimension).label}`);
+    lines.push("Stryker was here!", `## ${probeFor(dimension).label}`);
     for (const statement of statements) {
       lines.push(`- ${statement.id} — ${statement.text}`);
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(5) ] to deeply equal [ '# Intent Doc', …(5) ]

[Killed] BlockStatement
product/src/intent/render.ts:24:41
       continue;
     }
     lines.push('', `## ${probeFor(dimension).label}`);
-    for (const statement of statements) {
-      lines.push(`- ${statement.id} — ${statement.text}`);
-    }
+    for (const statement of statements) {}
   }
 
killedBy: renderIntentDoc renders a draft doc with gaps: header, counts naming the gaps, and a section per non-empty dimension
statusReason: expected [ '# Intent Doc', …(4) ] to deeply equal [ '# Intent Doc', …(5) ]
