[Killed] Regex
product/src/intent/statements.ts:13:24
   source: 'answer' | 'brain-dump';
 }
 
-const LEADING_MARKER = /^\s*(?:[-*+]|\d+[.)])\s+/;
+const LEADING_MARKER = /^\s(?:[-*+]|\d+[.)])\s+/;
 const SENTENCE_SPLIT = /(?<=[.!?])\s+/;
 
killedBy: splitStatements strips a leading bullet or ordered-list marker
statusReason: expected [ '- a dash bullet here', …(3) ] to deeply equal [ 'a dash bullet here', …(3) ]

[Survived] Regex
product/src/intent/statements.ts:14:24
 }
 
 const LEADING_MARKER = /^\s*(?:[-*+]|\d+[.)])\s+/;
-const SENTENCE_SPLIT = /(?<=[.!?])\s+/;
+const SENTENCE_SPLIT = /(?<=[.!?])\s/;
 
 /** Split prose into statement-sized pieces: one per line, bullet, or sentence. */

[Killed] BlockStatement
product/src/intent/statements.ts:17:57
 const SENTENCE_SPLIT = /(?<=[.!?])\s+/;
 
 /** Split prose into statement-sized pieces: one per line, bullet, or sentence. */
-export function splitStatements(text: string): string[] {
-  return text
-    .split(/\r?\n/)
-    .flatMap((line) => line.split(SENTENCE_SPLIT))
-    .map((piece) => piece.replace(LEADING_MARKER, '').trim())
-    .filter((piece) => piece.length >= 3);
-}
+export function splitStatements(text: string): string[] {}
 
 /** Statements for every dimension the interview pinned, in canonical dimension order. */
killedBy: main: intent builds the intent doc from --text and writes it, closing the prompter
statusReason: dumpStatements is not iterable

[Killed] MethodExpression
product/src/intent/statements.ts:18:10
 
 /** Split prose into statement-sized pieces: one per line, bullet, or sentence. */
 export function splitStatements(text: string): string[] {
-  return text
-    .split(/\r?\n/)
-    .flatMap((line) => line.split(SENTENCE_SPLIT))
-    .map((piece) => piece.replace(LEADING_MARKER, '').trim())
-    .filter((piece) => piece.length >= 3);
+  return text.split(/\r?\n/).flatMap(line => line.split(SENTENCE_SPLIT)).map(piece => piece.replace(LEADING_MARKER, '').trim());
 }
 
killedBy: splitStatements strips a leading bullet or ordered-list marker
statusReason: expected [ 'a dash bullet here', …(4) ] to deeply equal [ 'a dash bullet here', …(3) ]

[Killed] ArrowFunction
product/src/intent/statements.ts:20:14
 export function splitStatements(text: string): string[] {
   return text
     .split(/\r?\n/)
-    .flatMap((line) => line.split(SENTENCE_SPLIT))
+    .flatMap(() => undefined)
     .map((piece) => piece.replace(LEADING_MARKER, '').trim())
     .filter((piece) => piece.length >= 3);
killedBy: main: intent builds the intent doc from --text and writes it, closing the prompter
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] MethodExpression
product/src/intent/statements.ts:21:21
   return text
     .split(/\r?\n/)
     .flatMap((line) => line.split(SENTENCE_SPLIT))
-    .map((piece) => piece.replace(LEADING_MARKER, '').trim())
+    .map((piece) => piece.replace(LEADING_MARKER, ''))
     .filter((piece) => piece.length >= 3);
 }
killedBy: splitStatements trims whitespace and drops fragments shorter than 3 characters
statusReason: expected [ '  a real fragment here  ', 'yes' ] to deeply equal [ 'a real fragment here', 'yes' ]

[Killed] ArrowFunction
product/src/intent/statements.ts:21:10
   return text
     .split(/\r?\n/)
     .flatMap((line) => line.split(SENTENCE_SPLIT))
-    .map((piece) => piece.replace(LEADING_MARKER, '').trim())
+    .map(() => undefined)
     .filter((piece) => piece.length >= 3);
 }
killedBy: main: intent builds the intent doc from --text and writes it, closing the prompter
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
product/src/intent/statements.ts:22:24
     .split(/\r?\n/)
     .flatMap((line) => line.split(SENTENCE_SPLIT))
     .map((piece) => piece.replace(LEADING_MARKER, '').trim())
-    .filter((piece) => piece.length >= 3);
+    .filter((piece) => piece.length > 3);
 }
 
killedBy: splitStatements trims whitespace and drops fragments shorter than 3 characters
statusReason: expected [ 'a real fragment here' ] to deeply equal [ 'a real fragment here', 'yes' ]

[Killed] ConditionalExpression
product/src/intent/statements.ts:22:24
     .split(/\r?\n/)
     .flatMap((line) => line.split(SENTENCE_SPLIT))
     .map((piece) => piece.replace(LEADING_MARKER, '').trim())
-    .filter((piece) => piece.length >= 3);
+    .filter((piece) => false);
 }
 
killedBy: splitStatements splits on newlines
statusReason: expected [] to deeply equal [ 'first line here', …(1) ]

[Killed] ArrayDeclaration
product/src/intent/statements.ts:27:42
 
 /** Statements for every dimension the interview pinned, in canonical dimension order. */
 export function extractStatements(result: InterviewResult): IntentStatementDraft[] {
-  const drafts: IntentStatementDraft[] = [];
+  const drafts: IntentStatementDraft[] = ["Stryker was here"];
   const dumpStatements = splitStatements(result.brainDump);
 
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [ undefined, 'problem', 'outcome' ] to deeply equal [ 'problem', 'outcome' ]

[Killed] BlockStatement
product/src/intent/statements.ts:30:46
   const drafts: IntentStatementDraft[] = [];
   const dumpStatements = splitStatements(result.brainDump);
 
-  for (const dimension of INTENT_DIMENSIONS) {
-    const exchanges = result.transcript.filter(
-      (candidate) => candidate.question.dimension === dimension && candidate.pinned,
-    );
-    if (exchanges.length > 0) {
-      for (const exchange of exchanges) {
-        for (const text of splitStatements(exchange.answer)) {
-          drafts.push({ dimension, text, source: 'answer' });
-        }
-      }
-      continue;
-    }
-
-    if (result.coveredByDump.includes(dimension)) {
-      const cues = probeFor(dimension).cues;
-      for (const text of dumpStatements) {
-        if (cues.some((cue) => text.toLowerCase().includes(cue))) {
-          drafts.push({ dimension, text, source: 'brain-dump' });
-        }
-      }
-    }
-  }
+  for (const dimension of INTENT_DIMENSIONS) {}
 
   return drafts;
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [] to deeply equal [ 'problem', 'outcome' ]

[Killed] MethodExpression
product/src/intent/statements.ts:31:23
   const dumpStatements = splitStatements(result.brainDump);
 
   for (const dimension of INTENT_DIMENSIONS) {
-    const exchanges = result.transcript.filter(
-      (candidate) => candidate.question.dimension === dimension && candidate.pinned,
-    );
+    const exchanges = result.transcript;
     if (exchanges.length > 0) {
       for (const exchange of exchanges) {
killedBy: decomposeIntent Gherkin: given an approved intent doc, decomposeIntent returns one epic and one story per scope statement, and every story and criterion traces to intent
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
product/src/intent/statements.ts:32:22
 
   for (const dimension of INTENT_DIMENSIONS) {
     const exchanges = result.transcript.filter(
-      (candidate) => candidate.question.dimension === dimension && candidate.pinned,
+      (candidate) => candidate.question.dimension !== dimension && candidate.pinned,
     );
     if (exchanges.length > 0) {
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [ 'problem', 'audience', …(8) ] to deeply equal [ 'problem', 'outcome' ]

[Killed] LogicalOperator
product/src/intent/statements.ts:32:22
 
   for (const dimension of INTENT_DIMENSIONS) {
     const exchanges = result.transcript.filter(
-      (candidate) => candidate.question.dimension === dimension && candidate.pinned,
+      (candidate) => candidate.question.dimension === dimension || candidate.pinned,
     );
     if (exchanges.length > 0) {
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [ 'problem', 'problem', …(10) ] to deeply equal [ 'problem', 'outcome' ]

[Killed] ConditionalExpression
product/src/intent/statements.ts:34:9
     const exchanges = result.transcript.filter(
       (candidate) => candidate.question.dimension === dimension && candidate.pinned,
     );
-    if (exchanges.length > 0) {
+    if (false) {
       for (const exchange of exchanges) {
         for (const text of splitStatements(exchange.answer)) {
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [] to deeply equal [ 'problem', 'outcome' ]

[Killed] EqualityOperator
product/src/intent/statements.ts:34:9
     const exchanges = result.transcript.filter(
       (candidate) => candidate.question.dimension === dimension && candidate.pinned,
     );
-    if (exchanges.length > 0) {
+    if (exchanges.length <= 0) {
       for (const exchange of exchanges) {
         for (const text of splitStatements(exchange.answer)) {
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [] to deeply equal [ 'problem', 'outcome' ]

[Killed] BlockStatement
product/src/intent/statements.ts:35:41
       (candidate) => candidate.question.dimension === dimension && candidate.pinned,
     );
     if (exchanges.length > 0) {
-      for (const exchange of exchanges) {
-        for (const text of splitStatements(exchange.answer)) {
-          drafts.push({ dimension, text, source: 'answer' });
-        }
-      }
+      for (const exchange of exchanges) {}
       continue;
     }
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [] to deeply equal [ 'problem', 'outcome' ]

[Killed] BlockStatement
product/src/intent/statements.ts:36:62
     );
     if (exchanges.length > 0) {
       for (const exchange of exchanges) {
-        for (const text of splitStatements(exchange.answer)) {
-          drafts.push({ dimension, text, source: 'answer' });
-        }
+        for (const text of splitStatements(exchange.answer)) {}
       }
       continue;
killedBy: extractStatements returns statements in canonical dimension order, tagged source: answer, for a transcript that pinned several dimensions
statusReason: expected [] to deeply equal [ 'problem', 'outcome' ]

[Killed] ConditionalExpression
product/src/intent/statements.ts:43:9
       continue;
     }
 
-    if (result.coveredByDump.includes(dimension)) {
+    if (false) {
       const cues = probeFor(dimension).cues;
       for (const text of dumpStatements) {
killedBy: extractStatements extracts only brain-dump sentences containing a cue for a dimension covered by the dump
statusReason: expected [] to deeply equal [ { dimension: 'problem', …(2) } ]

[Killed] BlockStatement
product/src/intent/statements.ts:43:51
       continue;
     }
 
-    if (result.coveredByDump.includes(dimension)) {
-      const cues = probeFor(dimension).cues;
-      for (const text of dumpStatements) {
-        if (cues.some((cue) => text.toLowerCase().includes(cue))) {
-          drafts.push({ dimension, text, source: 'brain-dump' });
-        }
-      }
-    }
+    if (result.coveredByDump.includes(dimension)) {}
   }
 
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — the intent doc has no statements

[Killed] BlockStatement
product/src/intent/statements.ts:45:42
 
     if (result.coveredByDump.includes(dimension)) {
       const cues = probeFor(dimension).cues;
-      for (const text of dumpStatements) {
-        if (cues.some((cue) => text.toLowerCase().includes(cue))) {
-          drafts.push({ dimension, text, source: 'brain-dump' });
-        }
-      }
+      for (const text of dumpStatements) {}
     }
   }
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — the intent doc has no statements

[Killed] ArrowFunction
product/src/intent/statements.ts:46:23
     if (result.coveredByDump.includes(dimension)) {
       const cues = probeFor(dimension).cues;
       for (const text of dumpStatements) {
-        if (cues.some((cue) => text.toLowerCase().includes(cue))) {
+        if (cues.some(() => undefined)) {
           drafts.push({ dimension, text, source: 'brain-dump' });
         }
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — the intent doc has no statements

[Killed] MethodExpression
product/src/intent/statements.ts:46:13
     if (result.coveredByDump.includes(dimension)) {
       const cues = probeFor(dimension).cues;
       for (const text of dumpStatements) {
-        if (cues.some((cue) => text.toLowerCase().includes(cue))) {
+        if (cues.every(cue => text.toLowerCase().includes(cue))) {
           drafts.push({ dimension, text, source: 'brain-dump' });
         }
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — the intent doc has no statements
