[Killed] BlockStatement
product/src/intent/trace.ts:16:97
 }
 
 /** Grade downstream artifacts against the doc: does every reference land, and is every statement claimed? */
-export function checkTraceability(doc: IntentDoc, artifacts: readonly Traceable[]): TraceReport {
-  const known = new Set<string>(doc.statements.map((statement) => statement.id));
-  const referenced = artifacts.flatMap((artifact) => artifact.tracesTo ?? []);
-  const referencedSet = new Set(referenced);
-
-  const unknownIds: string[] = [];
-  const seenUnknown = new Set<string>();
-  for (const id of referenced) {
-    if (!known.has(id) && !seenUnknown.has(id)) {
-      seenUnknown.add(id);
-      unknownIds.push(id);
-    }
-  }
-
-  const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => !referencedSet.has(id));
-
-  return { ok: unknownIds.length === 0 && untracedIds.length === 0, unknownIds, untracedIds };
-}
+export function checkTraceability(doc: IntentDoc, artifacts: readonly Traceable[]): TraceReport {}
 
killedBy: decomposeIntent satisfies the totality invariant — checkTraceability reports no unknownIds and no untracedIds
statusReason: expected undefined to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] ArrowFunction
product/src/intent/trace.ts:17:52
 
 /** Grade downstream artifacts against the doc: does every reference land, and is every statement claimed? */
 export function checkTraceability(doc: IntentDoc, artifacts: readonly Traceable[]): TraceReport {
-  const known = new Set<string>(doc.statements.map((statement) => statement.id));
+  const known = new Set<string>(doc.statements.map(() => undefined));
   const referenced = artifacts.flatMap((artifact) => artifact.tracesTo ?? []);
   const referencedSet = new Set(referenced);
killedBy: decomposeIntent satisfies the totality invariant — checkTraceability reports no unknownIds and no untracedIds
statusReason: expected { ok: false, …(2) } to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] ArrowFunction
product/src/intent/trace.ts:18:40
 /** Grade downstream artifacts against the doc: does every reference land, and is every statement claimed? */
 export function checkTraceability(doc: IntentDoc, artifacts: readonly Traceable[]): TraceReport {
   const known = new Set<string>(doc.statements.map((statement) => statement.id));
-  const referenced = artifacts.flatMap((artifact) => artifact.tracesTo ?? []);
+  const referenced = artifacts.flatMap(() => undefined);
   const referencedSet = new Set(referenced);
 
killedBy: decomposeIntent satisfies the totality invariant — checkTraceability reports no unknownIds and no untracedIds
statusReason: expected { ok: false, …(2) } to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] LogicalOperator
product/src/intent/trace.ts:18:54
 /** Grade downstream artifacts against the doc: does every reference land, and is every statement claimed? */
 export function checkTraceability(doc: IntentDoc, artifacts: readonly Traceable[]): TraceReport {
   const known = new Set<string>(doc.statements.map((statement) => statement.id));
-  const referenced = artifacts.flatMap((artifact) => artifact.tracesTo ?? []);
+  const referenced = artifacts.flatMap((artifact) => artifact.tracesTo && []);
   const referencedSet = new Set(referenced);
 
killedBy: checkTraceability is ok with both lists empty when every statement is referenced
statusReason: expected { ok: false, unknownIds: [], …(1) } to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] BlockStatement
product/src/intent/trace.ts:23:32
 
   const unknownIds: string[] = [];
   const seenUnknown = new Set<string>();
-  for (const id of referenced) {
-    if (!known.has(id) && !seenUnknown.has(id)) {
-      seenUnknown.add(id);
-      unknownIds.push(id);
-    }
-  }
+  for (const id of referenced) {}
 
   const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => !referencedSet.has(id));
killedBy: checkTraceability reports a reference to an ID the doc does not define in unknownIds
statusReason: expected [] to deeply equal [ 'INT-PROBLEM-99' ]

[Killed] BooleanLiteral
product/src/intent/trace.ts:24:27
   const unknownIds: string[] = [];
   const seenUnknown = new Set<string>();
   for (const id of referenced) {
-    if (!known.has(id) && !seenUnknown.has(id)) {
+    if (!known.has(id) && seenUnknown.has(id)) {
       seenUnknown.add(id);
       unknownIds.push(id);
killedBy: checkTraceability reports a reference to an ID the doc does not define in unknownIds
statusReason: expected [] to deeply equal [ 'INT-PROBLEM-99' ]

[Killed] BooleanLiteral
product/src/intent/trace.ts:24:9
   const unknownIds: string[] = [];
   const seenUnknown = new Set<string>();
   for (const id of referenced) {
-    if (!known.has(id) && !seenUnknown.has(id)) {
+    if (known.has(id) && !seenUnknown.has(id)) {
       seenUnknown.add(id);
       unknownIds.push(id);
killedBy: checkTraceability Gherkin: downstream artifacts can traces-to those IDs — a real Story parsed via StorySchema is accepted
statusReason: expected [ 'INT-PROBLEM-01' ] to deeply equal []

[Killed] CallExpression
product/src/intent/trace.ts:25:7
   const seenUnknown = new Set<string>();
   for (const id of referenced) {
     if (!known.has(id) && !seenUnknown.has(id)) {
-      seenUnknown.add(id);
+      ;
       unknownIds.push(id);
     }
killedBy: checkTraceability de-duplicates the same unknown reference cited by two artifacts
statusReason: expected [ 'INT-PROBLEM-99', 'INT-PROBLEM-99' ] to deeply equal [ 'INT-PROBLEM-99' ]

[Killed] CallExpression
product/src/intent/trace.ts:26:7
   for (const id of referenced) {
     if (!known.has(id) && !seenUnknown.has(id)) {
       seenUnknown.add(id);
-      unknownIds.push(id);
+      ;
     }
   }
killedBy: checkTraceability reports a reference to an ID the doc does not define in unknownIds
statusReason: expected [] to deeply equal [ 'INT-PROBLEM-99' ]

[Killed] BooleanLiteral
product/src/intent/trace.ts:30:86
     }
   }
 
-  const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => !referencedSet.has(id));
+  const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => referencedSet.has(id));
 
   return { ok: unknownIds.length === 0 && untracedIds.length === 0, unknownIds, untracedIds };
killedBy: decomposeIntent satisfies the totality invariant — checkTraceability reports no unknownIds and no untracedIds
statusReason: expected { ok: false, unknownIds: [], …(1) } to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] MethodExpression
product/src/intent/trace.ts:30:23
     }
   }
 
-  const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => !referencedSet.has(id));
+  const untracedIds = doc.statements.map(statement => statement.id);
 
   return { ok: unknownIds.length === 0 && untracedIds.length === 0, unknownIds, untracedIds };
killedBy: checkTraceability is ok with both lists empty when every statement is referenced
statusReason: expected { ok: false, unknownIds: [], …(1) } to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] EqualityOperator
product/src/intent/trace.ts:32:43
 
   const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => !referencedSet.has(id));
 
-  return { ok: unknownIds.length === 0 && untracedIds.length === 0, unknownIds, untracedIds };
+  return { ok: unknownIds.length === 0 && untracedIds.length !== 0, unknownIds, untracedIds };
 }
 
killedBy: checkTraceability is ok with both lists empty when every statement is referenced
statusReason: expected { ok: false, unknownIds: [], …(1) } to deeply equal { ok: true, unknownIds: [], …(1) }

[Killed] LogicalOperator
product/src/intent/trace.ts:32:16
 
   const untracedIds = doc.statements.map((statement) => statement.id).filter((id) => !referencedSet.has(id));
 
-  return { ok: unknownIds.length === 0 && untracedIds.length === 0, unknownIds, untracedIds };
+  return { ok: unknownIds.length === 0 || untracedIds.length === 0, unknownIds, untracedIds };
 }
 
killedBy: checkTraceability lists statements nothing references in untracedIds, in doc order
statusReason: expected true to be false // Object.is equality
