[Killed] BlockStatement
product/src/interview/coverage.ts:7:74
 import { DIMENSION_PROBES } from './dimensions.js';
 
 /** Dimensions the text already says something about, in canonical ask order. */
-export function detectCoverage(text: string): readonly IntentDimension[] {
-  const haystack = text.toLowerCase();
-  return DIMENSION_PROBES.filter((probe) => probe.cues.some((cue) => haystack.includes(cue))).map((p) => p.dimension);
-}
+export function detectCoverage(text: string): readonly IntentDimension[] {}
 
 /** Answers that decline the question — they must not pin a dimension. */
killedBy: main: intent builds the intent doc from --text and writes it, closing the prompter
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] MethodExpression
product/src/interview/coverage.ts:8:20
 
 /** Dimensions the text already says something about, in canonical ask order. */
 export function detectCoverage(text: string): readonly IntentDimension[] {
-  const haystack = text.toLowerCase();
+  const haystack = text.toUpperCase();
   return DIMENSION_PROBES.filter((probe) => probe.cues.some((cue) => haystack.includes(cue))).map((p) => p.dimension);
 }
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — the intent doc has no statements; intent is not pinned: problem, audience, outcome, scope, nonGoals, constraints

[Killed] MethodExpression
product/src/interview/coverage.ts:9:10
 /** Dimensions the text already says something about, in canonical ask order. */
 export function detectCoverage(text: string): readonly IntentDimension[] {
   const haystack = text.toLowerCase();
-  return DIMENSION_PROBES.filter((probe) => probe.cues.some((cue) => haystack.includes(cue))).map((p) => p.dimension);
+  return DIMENSION_PROBES.map((p) => p.dimension);
 }
 
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
product/src/interview/coverage.ts:9:61
 /** Dimensions the text already says something about, in canonical ask order. */
 export function detectCoverage(text: string): readonly IntentDimension[] {
   const haystack = text.toLowerCase();
-  return DIMENSION_PROBES.filter((probe) => probe.cues.some((cue) => haystack.includes(cue))).map((p) => p.dimension);
+  return DIMENSION_PROBES.filter((probe) => probe.cues.some(() => undefined)).map((p) => p.dimension);
 }
 
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — the intent doc has no statements; intent is not pinned: problem, audience, outcome, scope, nonGoals, constraints

[Killed] Regex
product/src/interview/coverage.ts:13:18
 }
 
 /** Answers that decline the question — they must not pin a dimension. */
-const DECLINED = /^(i\s+)?(don'?t\s+know|dunno|no\s+idea|not\s+sure|unsure|unknown|n\/?a|tbd|skip|pass)\b/i;
+const DECLINED = /^(i\s+)(don'?t\s+know|dunno|no\s+idea|not\s+sure|unsure|unknown|n\/?a|tbd|skip|pass)\b/i;
 
 /** True when an answer is substantive enough to pin its dimension. */
killedBy: isSubstantiveAnswer isSubstantiveAnswer("dunno") === false
statusReason: expected true to be false // Object.is equality

[Survived] Regex
product/src/interview/coverage.ts:13:18
 }
 
 /** Answers that decline the question — they must not pin a dimension. */
-const DECLINED = /^(i\s+)?(don'?t\s+know|dunno|no\s+idea|not\s+sure|unsure|unknown|n\/?a|tbd|skip|pass)\b/i;
+const DECLINED = /(i\s+)?(don'?t\s+know|dunno|no\s+idea|not\s+sure|unsure|unknown|n\/?a|tbd|skip|pass)\b/i;
 
 /** True when an answer is substantive enough to pin its dimension. */

[Killed] BlockStatement
product/src/interview/coverage.ts:16:62
 const DECLINED = /^(i\s+)?(don'?t\s+know|dunno|no\s+idea|not\s+sure|unsure|unknown|n\/?a|tbd|skip|pass)\b/i;
 
 /** True when an answer is substantive enough to pin its dimension. */
-export function isSubstantiveAnswer(answer: string): boolean {
-  const trimmed = answer.trim();
-  return trimmed.length >= 3 && !DECLINED.test(trimmed);
-}
+export function isSubstantiveAnswer(answer: string): boolean {}
 
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'no-questions-left' to be 'pinned' // Object.is equality

[Killed] MethodExpression
product/src/interview/coverage.ts:17:19
 
 /** True when an answer is substantive enough to pin its dimension. */
 export function isSubstantiveAnswer(answer: string): boolean {
-  const trimmed = answer.trim();
+  const trimmed = answer;
   return trimmed.length >= 3 && !DECLINED.test(trimmed);
 }
killedBy: isSubstantiveAnswer isSubstantiveAnswer("   ") === false
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
product/src/interview/coverage.ts:18:10
 /** True when an answer is substantive enough to pin its dimension. */
 export function isSubstantiveAnswer(answer: string): boolean {
   const trimmed = answer.trim();
-  return trimmed.length >= 3 && !DECLINED.test(trimmed);
+  return trimmed.length < 3 && !DECLINED.test(trimmed);
 }
 
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'no-questions-left' to be 'pinned' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/coverage.ts:18:10
 /** True when an answer is substantive enough to pin its dimension. */
 export function isSubstantiveAnswer(answer: string): boolean {
   const trimmed = answer.trim();
-  return trimmed.length >= 3 && !DECLINED.test(trimmed);
+  return true;
 }
 
killedBy: runInterview leaves declined dimensions in gaps, asked exactly once, stopping no-questions-left
statusReason: expected 'pinned' to be 'no-questions-left' // Object.is equality
