[Killed] ArrayDeclaration
product/src/interview/followup.ts:19:52
 }
 
 /** The laddering angles, in rung order. Guidance passed to the seam — never asked verbatim. */
-export const FOLLOW_UP_ANGLES: readonly string[] = [
-  'why does that matter — what value does it unlock, and for whom?',
-  'what happens today without this — what does the status quo cost?',
-];
+export const FOLLOW_UP_ANGLES: readonly string[] = [];
 
 /** Rungs per dimension: one pass over the angles. */
killedBy: followUpAngle returns distinct non-empty angles for rungs 1 and 2
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] StringLiteral
product/src/interview/followup.ts:20:3
 
 /** The laddering angles, in rung order. Guidance passed to the seam — never asked verbatim. */
 export const FOLLOW_UP_ANGLES: readonly string[] = [
-  'why does that matter — what value does it unlock, and for whom?',
+  "",
   'what happens today without this — what does the status quo cost?',
 ];
killedBy: followUpAngle returns distinct non-empty angles for rungs 1 and 2
statusReason: expected '' not to be '' // Object.is equality

[Killed] StringLiteral
product/src/interview/followup.ts:21:3
 /** The laddering angles, in rung order. Guidance passed to the seam — never asked verbatim. */
 export const FOLLOW_UP_ANGLES: readonly string[] = [
   'why does that matter — what value does it unlock, and for whom?',
-  'what happens today without this — what does the status quo cost?',
+  "",
 ];
 
killedBy: followUpAngle returns distinct non-empty angles for rungs 1 and 2
statusReason: expected '' not to be '' // Object.is equality

[Killed] BlockStatement
product/src/interview/followup.ts:31:54
 export const DEFAULT_FOLLOW_UP_BUDGET = 2;
 
 /** The angle for a 1-based rung. Rungs past the list reuse the last angle. */
-export function followUpAngle(depth: number): string {
-  const index = Math.min(Math.max(Math.trunc(depth), 1), FOLLOW_UP_ANGLES.length) - 1;
-  return FOLLOW_UP_ANGLES[index]!;
-}
+export function followUpAngle(depth: number): string {}
 
 /** True when the seam returned a real, non-repeating follow-up. Blank or repeat = the seam declined. */
killedBy: followUpAngle returns distinct non-empty angles for rungs 1 and 2
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] MethodExpression
product/src/interview/followup.ts:32:26
 
 /** The angle for a 1-based rung. Rungs past the list reuse the last angle. */
 export function followUpAngle(depth: number): string {
-  const index = Math.min(Math.max(Math.trunc(depth), 1), FOLLOW_UP_ANGLES.length) - 1;
+  const index = Math.min(Math.min(Math.trunc(depth), 1), FOLLOW_UP_ANGLES.length) - 1;
   return FOLLOW_UP_ANGLES[index]!;
 }
killedBy: followUpAngle returns distinct non-empty angles for rungs 1 and 2
statusReason: expected 'why does that matter — what value doe…' not to be 'why does that matter — what value doe…' // Object.is equality

[Killed] ArithmeticOperator
product/src/interview/followup.ts:32:17
 
 /** The angle for a 1-based rung. Rungs past the list reuse the last angle. */
 export function followUpAngle(depth: number): string {
-  const index = Math.min(Math.max(Math.trunc(depth), 1), FOLLOW_UP_ANGLES.length) - 1;
+  const index = Math.min(Math.max(Math.trunc(depth), 1), FOLLOW_UP_ANGLES.length) + 1;
   return FOLLOW_UP_ANGLES[index]!;
 }
killedBy: followUpAngle returns distinct non-empty angles for rungs 1 and 2
statusReason: expected undefined not to be undefined // Object.is equality

[Killed] BlockStatement
product/src/interview/followup.ts:37:102
 }
 
 /** True when the seam returned a real, non-repeating follow-up. Blank or repeat = the seam declined. */
-export function isUsableFollowUp(text: string | undefined, asked: readonly string[]): text is string {
-  const trimmed = text?.trim() ?? '';
-  if (trimmed === '') return false;
-  const key = normalize(trimmed);
-  return !asked.some((question) => normalize(question) === key);
-}
+export function isUsableFollowUp(text: string | undefined, asked: readonly string[]): text is string {}
 
 const TRAILING_PUNCTUATION = new Set(['?', '.', '!']);
killedBy: runInterview AC1: a shallow dump surfaces a concrete follow-up before the dimension is covered
statusReason: expected -1 to be greater than 0

[Killed] MethodExpression
product/src/interview/followup.ts:38:19
 
 /** True when the seam returned a real, non-repeating follow-up. Blank or repeat = the seam declined. */
 export function isUsableFollowUp(text: string | undefined, asked: readonly string[]): text is string {
-  const trimmed = text?.trim() ?? '';
+  const trimmed = text ?? '';
   if (trimmed === '') return false;
   const key = normalize(trimmed);
killedBy: isUsableFollowUp rejects blank/whitespace-only text
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
product/src/interview/followup.ts:38:19
 
 /** True when the seam returned a real, non-repeating follow-up. Blank or repeat = the seam declined. */
 export function isUsableFollowUp(text: string | undefined, asked: readonly string[]): text is string {
-  const trimmed = text?.trim() ?? '';
+  const trimmed = text?.trim() && '';
   if (trimmed === '') return false;
   const key = normalize(trimmed);
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BooleanLiteral
product/src/interview/followup.ts:39:30
 /** True when the seam returned a real, non-repeating follow-up. Blank or repeat = the seam declined. */
 export function isUsableFollowUp(text: string | undefined, asked: readonly string[]): text is string {
   const trimmed = text?.trim() ?? '';
-  if (trimmed === '') return false;
+  if (trimmed === '') return true;
   const key = normalize(trimmed);
   return !asked.some((question) => normalize(question) === key);
killedBy: isUsableFollowUp rejects undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/interview/followup.ts:39:7
 /** True when the seam returned a real, non-repeating follow-up. Blank or repeat = the seam declined. */
 export function isUsableFollowUp(text: string | undefined, asked: readonly string[]): text is string {
   const trimmed = text?.trim() ?? '';
-  if (trimmed === '') return false;
+  if (true) return false;
   const key = normalize(trimmed);
   return !asked.some((question) => normalize(question) === key);
killedBy: isUsableFollowUp accepts a fresh question
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
product/src/interview/followup.ts:41:36
   const trimmed = text?.trim() ?? '';
   if (trimmed === '') return false;
   const key = normalize(trimmed);
-  return !asked.some((question) => normalize(question) === key);
+  return !asked.some((question) => false);
 }
 
killedBy: isUsableFollowUp rejects a repeat differing only by case
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
product/src/interview/followup.ts:41:36
   const trimmed = text?.trim() ?? '';
   if (trimmed === '') return false;
   const key = normalize(trimmed);
-  return !asked.some((question) => normalize(question) === key);
+  return !asked.some((question) => normalize(question) !== key);
 }
 
killedBy: isUsableFollowUp accepts a fresh question
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
product/src/interview/followup.ts:44:39
   return !asked.some((question) => normalize(question) === key);
 }
 
-const TRAILING_PUNCTUATION = new Set(['?', '.', '!']);
+const TRAILING_PUNCTUATION = new Set(["", '.', '!']);
 
 function normalize(text: string): string {
killedBy: isUsableFollowUp rejects a repeat differing only by trailing punctuation
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
product/src/interview/followup.ts:46:42
 
 const TRAILING_PUNCTUATION = new Set(['?', '.', '!']);
 
-function normalize(text: string): string {
-  const collapsed = text.trim().toLowerCase().replace(/\s+/g, ' ');
-  let end = collapsed.length;
-  while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {
-    end -= 1;
-  }
-  return collapsed.slice(0, end);
-}
+function normalize(text: string): string {}
 
killedBy: runInterview AC1: a shallow dump surfaces a concrete follow-up before the dimension is covered
statusReason: expected -1 to be greater than 0

[Survived] MethodExpression
product/src/interview/followup.ts:47:21
 const TRAILING_PUNCTUATION = new Set(['?', '.', '!']);
 
 function normalize(text: string): string {
-  const collapsed = text.trim().toLowerCase().replace(/\s+/g, ' ');
+  const collapsed = text.trim().toUpperCase().replace(/\s+/g, ' ');
   let end = collapsed.length;
   while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {

[Survived] MethodExpression
product/src/interview/followup.ts:47:21
 const TRAILING_PUNCTUATION = new Set(['?', '.', '!']);
 
 function normalize(text: string): string {
-  const collapsed = text.trim().toLowerCase().replace(/\s+/g, ' ');
+  const collapsed = text.toLowerCase().replace(/\s+/g, ' ');
   let end = collapsed.length;
   while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {

[Killed] EqualityOperator
product/src/interview/followup.ts:49:10
 function normalize(text: string): string {
   const collapsed = text.trim().toLowerCase().replace(/\s+/g, ' ');
   let end = collapsed.length;
-  while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {
+  while (end <= 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {
     end -= 1;
   }
killedBy: isUsableFollowUp rejects a repeat differing only by trailing punctuation
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
product/src/interview/followup.ts:49:56
 function normalize(text: string): string {
   const collapsed = text.trim().toLowerCase().replace(/\s+/g, ' ');
   let end = collapsed.length;
-  while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {
+  while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end + 1]!)) {
     end -= 1;
   }
killedBy: isUsableFollowUp rejects a repeat differing only by trailing punctuation
statusReason: expected true to be false // Object.is equality

[Killed] AssignmentOperator
product/src/interview/followup.ts:50:5
   const collapsed = text.trim().toLowerCase().replace(/\s+/g, ' ');
   let end = collapsed.length;
   while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {
-    end -= 1;
+    end += 1;
   }
   return collapsed.slice(0, end);
killedBy: isUsableFollowUp rejects a repeat differing only by trailing punctuation
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
product/src/interview/followup.ts:52:10
   while (end > 0 && TRAILING_PUNCTUATION.has(collapsed[end - 1]!)) {
     end -= 1;
   }
-  return collapsed.slice(0, end);
+  return collapsed;
 }
 
killedBy: isUsableFollowUp rejects a repeat differing only by trailing punctuation
statusReason: expected true to be false // Object.is equality
