[Killed] BlockStatement
product/src/interview/interview.ts:62:69
 /** One pass over the gap list — the interviewer never re-asks, so this is its natural ceiling. */
 export const DEFAULT_QUESTION_BUDGET = DIMENSION_PROBES.length;
 
-export function formatQuestion(question: InterviewQuestion): string {
-  const label = probeFor(question.dimension).label;
-  const tag = question.followUpDepth === undefined ? label : `${label} follow-up ${question.followUpDepth}`;
-  return `Q${question.index} [${tag}] ${question.text}`;
-}
+export function formatQuestion(question: InterviewQuestion): string {}
 
 export async function runInterview(
killedBy: formatQuestion formats the index, label, and question text
statusReason: expected undefined to be 'Q1 [Problem] X?' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/interview.ts:64:15
 
 export function formatQuestion(question: InterviewQuestion): string {
   const label = probeFor(question.dimension).label;
-  const tag = question.followUpDepth === undefined ? label : `${label} follow-up ${question.followUpDepth}`;
+  const tag = true ? label : `${label} follow-up ${question.followUpDepth}`;
   return `Q${question.index} [${tag}] ${question.text}`;
 }
killedBy: formatQuestion formats a follow-up with its rung number
statusReason: expected 'Q3 [Problem] Why?' to be 'Q3 [Problem follow-up 1] Why?' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/interview.ts:64:15
 
 export function formatQuestion(question: InterviewQuestion): string {
   const label = probeFor(question.dimension).label;
-  const tag = question.followUpDepth === undefined ? label : `${label} follow-up ${question.followUpDepth}`;
+  const tag = false ? label : `${label} follow-up ${question.followUpDepth}`;
   return `Q${question.index} [${tag}] ${question.text}`;
 }
killedBy: formatQuestion formats the index, label, and question text
statusReason: expected 'Q1 [Problem follow-up undefined] X?' to be 'Q1 [Problem] X?' // Object.is equality

[Killed] MethodExpression
product/src/interview/interview.ts:73:26
   deps: InterviewDeps,
   options: InterviewOptions = {},
 ): Promise<InterviewResult> {
-  const questionBudget = Math.max(0, Math.trunc(options.questionBudget ?? DEFAULT_QUESTION_BUDGET));
+  const questionBudget = Math.min(0, Math.trunc(options.questionBudget ?? DEFAULT_QUESTION_BUDGET));
   const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
   const coveredByDump = detectCoverage(brainDump);
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'budget-exhausted' to be 'pinned' // Object.is equality

[Killed] LogicalOperator
product/src/interview/interview.ts:73:49
   deps: InterviewDeps,
   options: InterviewOptions = {},
 ): Promise<InterviewResult> {
-  const questionBudget = Math.max(0, Math.trunc(options.questionBudget ?? DEFAULT_QUESTION_BUDGET));
+  const questionBudget = Math.max(0, Math.trunc(options.questionBudget && DEFAULT_QUESTION_BUDGET));
   const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
   const coveredByDump = detectCoverage(brainDump);
killedBy: runInterview stops on a bounded budget with gaps remaining
statusReason: expected 5 to be 2 // Object.is equality

[Killed] MethodExpression
product/src/interview/interview.ts:74:26
   options: InterviewOptions = {},
 ): Promise<InterviewResult> {
   const questionBudget = Math.max(0, Math.trunc(options.questionBudget ?? DEFAULT_QUESTION_BUDGET));
-  const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
+  const followUpBudget = Math.min(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
   const coveredByDump = detectCoverage(brainDump);
   const pinned = new Set<IntentDimension>(coveredByDump);
killedBy: runInterview AC1: a shallow dump surfaces a concrete follow-up before the dimension is covered
statusReason: expected -1 to be greater than 0

[Killed] LogicalOperator
product/src/interview/interview.ts:74:49
   options: InterviewOptions = {},
 ): Promise<InterviewResult> {
   const questionBudget = Math.max(0, Math.trunc(options.questionBudget ?? DEFAULT_QUESTION_BUDGET));
-  const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
+  const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget && DEFAULT_FOLLOW_UP_BUDGET));
   const coveredByDump = detectCoverage(brainDump);
   const pinned = new Set<IntentDimension>(coveredByDump);
killedBy: runInterview AC1: a shallow dump surfaces a concrete follow-up before the dimension is covered
statusReason: expected -1 to be greater than 0

[Killed] MethodExpression
product/src/interview/interview.ts:77:17
   const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
   const coveredByDump = detectCoverage(brainDump);
   const pinned = new Set<IntentDimension>(coveredByDump);
-  const queue = DIMENSION_PROBES.filter((probe) => !pinned.has(probe.dimension));
+  const queue = DIMENSION_PROBES;
   const transcript: InterviewExchange[] = [];
 
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected [ 'problem' ] to not include 'problem'

[Killed] BooleanLiteral
product/src/interview/interview.ts:77:52
   const followUpBudget = Math.max(0, Math.trunc(options.followUpBudget ?? DEFAULT_FOLLOW_UP_BUDGET));
   const coveredByDump = detectCoverage(brainDump);
   const pinned = new Set<IntentDimension>(coveredByDump);
-  const queue = DIMENSION_PROBES.filter((probe) => !pinned.has(probe.dimension));
+  const queue = DIMENSION_PROBES.filter((probe) => pinned.has(probe.dimension));
   const transcript: InterviewExchange[] = [];
 
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected [ 'problem' ] to not include 'problem'

[Killed] EqualityOperator
product/src/interview/interview.ts:80:41
   const queue = DIMENSION_PROBES.filter((probe) => !pinned.has(probe.dimension));
   const transcript: InterviewExchange[] = [];
 
-  let stopReason: InterviewStopReason = queue.length === 0 ? 'pinned' : 'no-questions-left';
+  let stopReason: InterviewStopReason = queue.length !== 0 ? 'pinned' : 'no-questions-left';
   let baseAsked = 0;
   let followUpsAsked = 0;
killedBy: runInterview leaves declined dimensions in gaps, asked exactly once, stopping no-questions-left
statusReason: expected 'pinned' to be 'no-questions-left' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/interview.ts:80:41
   const queue = DIMENSION_PROBES.filter((probe) => !pinned.has(probe.dimension));
   const transcript: InterviewExchange[] = [];
 
-  let stopReason: InterviewStopReason = queue.length === 0 ? 'pinned' : 'no-questions-left';
+  let stopReason: InterviewStopReason = true ? 'pinned' : 'no-questions-left';
   let baseAsked = 0;
   let followUpsAsked = 0;
killedBy: runInterview leaves declined dimensions in gaps, asked exactly once, stopping no-questions-left
statusReason: expected 'pinned' to be 'no-questions-left' // Object.is equality

[Killed] EqualityOperator
product/src/interview/interview.ts:85:9
   let followUpsAsked = 0;
 
   for (const probe of queue) {
-    if (baseAsked >= questionBudget) {
+    if (baseAsked > questionBudget) {
       stopReason = 'budget-exhausted';
       break;
killedBy: runInterview stops on a bounded budget with gaps remaining
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
product/src/interview/interview.ts:85:9
   let followUpsAsked = 0;
 
   for (const probe of queue) {
-    if (baseAsked >= questionBudget) {
+    if (false) {
       stopReason = 'budget-exhausted';
       break;
killedBy: runInterview stops on a bounded budget with gaps remaining
statusReason: expected 5 to be 2 // Object.is equality

[Killed] OptionalChaining
product/src/interview/interview.ts:89:21
       stopReason = 'budget-exhausted';
       break;
     }
-    const phrased = (await deps.phraseQuestion?.(probe, brainDump))?.trim();
+    const phrased = (await deps.phraseQuestion?.(probe, brainDump)).trim();
     const question: InterviewQuestion = {
       index: transcript.length + 1,
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] OptionalChaining
product/src/interview/interview.ts:89:28
       stopReason = 'budget-exhausted';
       break;
     }
-    const phrased = (await deps.phraseQuestion?.(probe, brainDump))?.trim();
+    const phrased = (await deps.phraseQuestion(probe, brainDump))?.trim();
     const question: InterviewQuestion = {
       index: transcript.length + 1,
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: deps.phraseQuestion is not a function

[Killed] ArithmeticOperator
product/src/interview/interview.ts:91:14
     }
     const phrased = (await deps.phraseQuestion?.(probe, brainDump))?.trim();
     const question: InterviewQuestion = {
-      index: transcript.length + 1,
+      index: transcript.length - 1,
       dimension: probe.dimension,
       text: phrased ? phrased : probe.question,
killedBy: runInterview assigns a 1-based index that increments by one across the transcript
statusReason: expected -1 to be 1 // Object.is equality

[Killed] AssignmentOperator
product/src/interview/interview.ts:96:5
       text: phrased ? phrased : probe.question,
     };
     const answer = await deps.ask(question);
-    baseAsked += 1;
+    baseAsked -= 1;
     const answered = isSubstantiveAnswer(answer);
     transcript.push({ question, answer, pinned: answered });
killedBy: runInterview stops on a bounded budget with gaps remaining
statusReason: expected -5 to be 2 // Object.is equality

[Killed] ObjectLiteral
product/src/interview/interview.ts:98:21
     const answer = await deps.ask(question);
     baseAsked += 1;
     const answered = isSubstantiveAnswer(answer);
-    transcript.push({ question, answer, pinned: answered });
+    transcript.push({});
     if (!answered) continue;
 
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: Cannot read properties of undefined (reading 'dimension')

[Killed] ConditionalExpression
product/src/interview/interview.ts:99:9
     baseAsked += 1;
     const answered = isSubstantiveAnswer(answer);
     transcript.push({ question, answer, pinned: answered });
-    if (!answered) continue;
+    if (false) continue;
 
     const asked: string[] = [question.text];
killedBy: runInterview leaves declined dimensions in gaps, asked exactly once, stopping no-questions-left
statusReason: expected 'pinned' to be 'no-questions-left' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/interview.ts:99:9
     baseAsked += 1;
     const answered = isSubstantiveAnswer(answer);
     transcript.push({ question, answer, pinned: answered });
-    if (!answered) continue;
+    if (true) continue;
 
     const asked: string[] = [question.text];
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'no-questions-left' to be 'pinned' // Object.is equality

[Killed] ArrayDeclaration
product/src/interview/interview.ts:101:29
     transcript.push({ question, answer, pinned: answered });
     if (!answered) continue;
 
-    const asked: string[] = [question.text];
+    const asked: string[] = [];
     let latest = answer;
     for (let depth = 1; depth <= MAX_FOLLOW_UP_DEPTH && followUpsAsked < followUpBudget; depth += 1) {
killedBy: runInterview a seam that echoes the fixed question text back yields zero follow-ups
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
product/src/interview/interview.ts:103:25
 
     const asked: string[] = [question.text];
     let latest = answer;
-    for (let depth = 1; depth <= MAX_FOLLOW_UP_DEPTH && followUpsAsked < followUpBudget; depth += 1) {
+    for (let depth = 1; depth <= MAX_FOLLOW_UP_DEPTH || followUpsAsked < followUpBudget; depth += 1) {
       const context: FollowUpContext = {
         dimension: probe.dimension,
killedBy: runInterview followUpBudget caps total follow-ups across the interview
statusReason: expected 10 to be 1 // Object.is equality

[Killed] EqualityOperator
product/src/interview/interview.ts:103:25
 
     const asked: string[] = [question.text];
     let latest = answer;
-    for (let depth = 1; depth <= MAX_FOLLOW_UP_DEPTH && followUpsAsked < followUpBudget; depth += 1) {
+    for (let depth = 1; depth > MAX_FOLLOW_UP_DEPTH && followUpsAsked < followUpBudget; depth += 1) {
       const context: FollowUpContext = {
         dimension: probe.dimension,
killedBy: runInterview AC1: a shallow dump surfaces a concrete follow-up before the dimension is covered
statusReason: expected -1 to be greater than 0

[Survived] ArrayDeclaration
product/src/interview/interview.ts:108:16
         dimension: probe.dimension,
         answer: latest,
         depth,
-        asked: [...asked],
+        asked: [],
         angle: followUpAngle(depth),
       };

[Killed] OptionalChaining
product/src/interview/interview.ts:111:27
         asked: [...asked],
         angle: followUpAngle(depth),
       };
-      const text = (await deps.phraseQuestion?.(probe, brainDump, context))?.trim();
+      const text = (await deps.phraseQuestion(probe, brainDump, context))?.trim();
       if (!isUsableFollowUp(text, asked)) break;
       const followUp: InterviewQuestion = {
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: deps.phraseQuestion is not a function

[Killed] OptionalChaining
product/src/interview/interview.ts:111:20
         asked: [...asked],
         angle: followUpAngle(depth),
       };
-      const text = (await deps.phraseQuestion?.(probe, brainDump, context))?.trim();
+      const text = (await deps.phraseQuestion?.(probe, brainDump, context)).trim();
       if (!isUsableFollowUp(text, asked)) break;
       const followUp: InterviewQuestion = {
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] BooleanLiteral
product/src/interview/interview.ts:112:11
         angle: followUpAngle(depth),
       };
       const text = (await deps.phraseQuestion?.(probe, brainDump, context))?.trim();
-      if (!isUsableFollowUp(text, asked)) break;
+      if (isUsableFollowUp(text, asked)) break;
       const followUp: InterviewQuestion = {
         index: transcript.length + 1,
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching{…} ]

Received:

  1st vi.fn() call:

  [
-   StringMatching /^Asked \d+ of \d+ question\(s\); stopped: /,

[Killed] ConditionalExpression
product/src/interview/interview.ts:112:11
         angle: followUpAngle(depth),
       };
       const text = (await deps.phraseQuestion?.(probe, brainDump, context))?.trim();
-      if (!isUsableFollowUp(text, asked)) break;
+      if (false) break;
       const followUp: InterviewQuestion = {
         index: transcript.length + 1,
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 5 to be 7 // Object.is equality

[Killed] ArithmeticOperator
product/src/interview/interview.ts:114:16
       const text = (await deps.phraseQuestion?.(probe, brainDump, context))?.trim();
       if (!isUsableFollowUp(text, asked)) break;
       const followUp: InterviewQuestion = {
-        index: transcript.length + 1,
+        index: transcript.length - 1,
         dimension: probe.dimension,
         text,
killedBy: runInterview keeps indices 1-based and contiguous across mixed fixed and follow-up questions
statusReason: expected +0 to be 2 // Object.is equality

[Killed] AssignmentOperator
product/src/interview/interview.ts:120:7
         followUpDepth: depth,
       };
       const followUpAnswer = await deps.ask(followUp);
-      followUpsAsked += 1;
+      followUpsAsked -= 1;
       asked.push(followUp.text);
       const followUpAnswered = isSubstantiveAnswer(followUpAnswer);
killedBy: runInterview followUpBudget caps total follow-ups across the interview
statusReason: expected 10 to be 1 // Object.is equality

[Killed] CallExpression
product/src/interview/interview.ts:121:7
       };
       const followUpAnswer = await deps.ask(followUp);
       followUpsAsked += 1;
-      asked.push(followUp.text);
+      ;
       const followUpAnswered = isSubstantiveAnswer(followUpAnswer);
       transcript.push({ question: followUp, answer: followUpAnswer, pinned: followUpAnswered });
killedBy: runInterview AC1: a shallow dump surfaces a concrete follow-up before the dimension is covered
statusReason: expected [ …(7) ] to not include 'Why does "a substantive answer here" …'

[Killed] ConditionalExpression
product/src/interview/interview.ts:124:11
       asked.push(followUp.text);
       const followUpAnswered = isSubstantiveAnswer(followUpAnswer);
       transcript.push({ question: followUp, answer: followUpAnswer, pinned: followUpAnswered });
-      if (!followUpAnswered) break;
+      if (false) break;
       latest = followUpAnswer;
     }
killedBy: runInterview a declined follow-up answer ends the ladder but keeps the dimension pinned
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
product/src/interview/interview.ts:124:11
       asked.push(followUp.text);
       const followUpAnswered = isSubstantiveAnswer(followUpAnswer);
       transcript.push({ question: followUp, answer: followUpAnswer, pinned: followUpAnswered });
-      if (!followUpAnswered) break;
+      if (followUpAnswered) break;
       latest = followUpAnswer;
     }
killedBy: runInterview a declined follow-up answer ends the ladder but keeps the dimension pinned
statusReason: expected 2 to be 1 // Object.is equality

[Killed] CallExpression
product/src/interview/interview.ts:128:5
       latest = followUpAnswer;
     }
 
-    pinned.add(probe.dimension);
+    ;
   }
 
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'no-questions-left' to be 'pinned' // Object.is equality

[Killed] EqualityOperator
product/src/interview/interview.ts:131:44
     pinned.add(probe.dimension);
   }
 
-  if (stopReason !== 'budget-exhausted' && pinned.size === DIMENSION_PROBES.length) {
+  if (stopReason !== 'budget-exhausted' && pinned.size !== DIMENSION_PROBES.length) {
     stopReason = 'pinned';
   }
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'no-questions-left' to be 'pinned' // Object.is equality

[Killed] EqualityOperator
product/src/interview/interview.ts:131:7
     pinned.add(probe.dimension);
   }
 
-  if (stopReason !== 'budget-exhausted' && pinned.size === DIMENSION_PROBES.length) {
+  if (stopReason === 'budget-exhausted' && pinned.size === DIMENSION_PROBES.length) {
     stopReason = 'pinned';
   }
killedBy: runInterview clarifies until pinned: asks only uncovered dimensions, never repeats, and ends pinned
statusReason: expected 'no-questions-left' to be 'pinned' // Object.is equality

[Killed] ArrowFunction
product/src/interview/interview.ts:139:38
     brainDump,
     coveredByDump,
     transcript,
-    pinned: INTENT_DIMENSIONS.filter((d) => pinned.has(d)),
+    pinned: INTENT_DIMENSIONS.filter(() => undefined),
     gaps: INTENT_DIMENSIONS.filter((d) => !pinned.has(d)),
     stopReason,
killedBy: runInterview partitions pinned and gaps in canonical order for a mixed run
statusReason: expected 2 to be 6 // Object.is equality

[Survived] MethodExpression
product/src/interview/interview.ts:139:13
     brainDump,
     coveredByDump,
     transcript,
-    pinned: INTENT_DIMENSIONS.filter((d) => pinned.has(d)),
+    pinned: INTENT_DIMENSIONS,
     gaps: INTENT_DIMENSIONS.filter((d) => !pinned.has(d)),
     stopReason,

[Killed] MethodExpression
product/src/interview/interview.ts:140:11
     coveredByDump,
     transcript,
     pinned: INTENT_DIMENSIONS.filter((d) => pinned.has(d)),
-    gaps: INTENT_DIMENSIONS.filter((d) => !pinned.has(d)),
+    gaps: INTENT_DIMENSIONS,
     stopReason,
     questionsAsked: baseAsked,
killedBy: main: intent approves and writes Status: approved plus Approved by when the interview pins everything
statusReason: product intent: cannot approve — intent is not pinned: problem, audience, outcome, scope, nonGoals, constraints

[Killed] ArrowFunction
product/src/interview/interview.ts:140:36
     coveredByDump,
     transcript,
     pinned: INTENT_DIMENSIONS.filter((d) => pinned.has(d)),
-    gaps: INTENT_DIMENSIONS.filter((d) => !pinned.has(d)),
+    gaps: INTENT_DIMENSIONS.filter(() => undefined),
     stopReason,
     questionsAsked: baseAsked,
killedBy: runInterview stops on a bounded budget with gaps remaining
statusReason: expected 0 to be greater than 0
