[Killed] BlockStatement
product/src/interview/render.ts:6:75
 import type { InterviewResult } from './interview.js';
 
 /** Human-readable summary lines for the CLI. */
-export function renderInterviewSummary(result: InterviewResult): string[] {
-  const followUps = result.transcript.filter((exchange) => exchange.question.followUpDepth !== undefined).length;
-  const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
-  return [
-    `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
-    `Pinned: ${result.pinned.length > 0 ? result.pinned.join(', ') : '(none)'}`,
-    `Open gaps: ${result.gaps.length > 0 ? result.gaps.join(', ') : '(none)'}`,
-  ];
-}
+export function renderInterviewSummary(result: InterviewResult): string[] {}
 
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: renderInterviewSummary is not a function or its return value is not iterable

[Killed] ArrowFunction
product/src/interview/render.ts:7:46
 
 /** Human-readable summary lines for the CLI. */
 export function renderInterviewSummary(result: InterviewResult): string[] {
-  const followUps = result.transcript.filter((exchange) => exchange.question.followUpDepth !== undefined).length;
+  const followUps = result.transcript.filter(() => undefined).length;
   const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
   return [
killedBy: renderInterviewSummary appends the follow-up count when the transcript contains follow-up exchanges
statusReason: expected 'Asked 6 of 6 question(s); stopped: pi…' to be 'Asked 6 of 6 question(s) plus 2 follo…' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/render.ts:7:60
 
 /** Human-readable summary lines for the CLI. */
 export function renderInterviewSummary(result: InterviewResult): string[] {
-  const followUps = result.transcript.filter((exchange) => exchange.question.followUpDepth !== undefined).length;
+  const followUps = result.transcript.filter((exchange) => false).length;
   const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
   return [
killedBy: renderInterviewSummary appends the follow-up count when the transcript contains follow-up exchanges
statusReason: expected 'Asked 6 of 6 question(s); stopped: pi…' to be 'Asked 6 of 6 question(s) plus 2 follo…' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/render.ts:8:17
 /** Human-readable summary lines for the CLI. */
 export function renderInterviewSummary(result: InterviewResult): string[] {
   const followUps = result.transcript.filter((exchange) => exchange.question.followUpDepth !== undefined).length;
-  const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
+  const depth = false ? ` plus ${followUps} follow-up(s)` : '';
   return [
     `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
killedBy: renderInterviewSummary appends the follow-up count when the transcript contains follow-up exchanges
statusReason: expected 'Asked 6 of 6 question(s); stopped: pi…' to be 'Asked 6 of 6 question(s) plus 2 follo…' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/render.ts:8:17
 /** Human-readable summary lines for the CLI. */
 export function renderInterviewSummary(result: InterviewResult): string[] {
   const followUps = result.transcript.filter((exchange) => exchange.question.followUpDepth !== undefined).length;
-  const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
+  const depth = true ? ` plus ${followUps} follow-up(s)` : '';
   return [
     `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
killedBy: main: interview runs the loop from --text, asks via the prompter, and writes the summary lines
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching{…} ]

Received:

  1st vi.fn() call:

  [
-   StringMatching /^Asked \d+ of \d+ question\(s\); stopped: /,

[Killed] ConditionalExpression
product/src/interview/render.ts:11:16
   const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
   return [
     `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
-    `Pinned: ${result.pinned.length > 0 ? result.pinned.join(', ') : '(none)'}`,
+    `Pinned: ${true ? result.pinned.join(', ') : '(none)'}`,
     `Open gaps: ${result.gaps.length > 0 ? result.gaps.join(', ') : '(none)'}`,
   ];
killedBy: renderInterviewSummary renders an all-gaps result with no pinned dimensions
statusReason: expected 'Pinned: ' to be 'Pinned: (none)' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/render.ts:11:16
   const depth = followUps > 0 ? ` plus ${followUps} follow-up(s)` : '';
   return [
     `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
-    `Pinned: ${result.pinned.length > 0 ? result.pinned.join(', ') : '(none)'}`,
+    `Pinned: ${false ? result.pinned.join(', ') : '(none)'}`,
     `Open gaps: ${result.gaps.length > 0 ? result.gaps.join(', ') : '(none)'}`,
   ];
killedBy: renderInterviewSummary renders a pinned result with no open gaps
statusReason: expected 'Pinned: (none)' to be 'Pinned: problem, audience, outcome, s…' // Object.is equality

[Killed] EqualityOperator
product/src/interview/render.ts:12:19
   return [
     `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
     `Pinned: ${result.pinned.length > 0 ? result.pinned.join(', ') : '(none)'}`,
-    `Open gaps: ${result.gaps.length > 0 ? result.gaps.join(', ') : '(none)'}`,
+    `Open gaps: ${result.gaps.length >= 0 ? result.gaps.join(', ') : '(none)'}`,
   ];
 }
killedBy: renderInterviewSummary renders a pinned result with no open gaps
statusReason: expected 'Open gaps: ' to be 'Open gaps: (none)' // Object.is equality

[Killed] ConditionalExpression
product/src/interview/render.ts:12:19
   return [
     `Asked ${result.questionsAsked} of ${result.questionBudget} question(s)${depth}; stopped: ${result.stopReason}`,
     `Pinned: ${result.pinned.length > 0 ? result.pinned.join(', ') : '(none)'}`,
-    `Open gaps: ${result.gaps.length > 0 ? result.gaps.join(', ') : '(none)'}`,
+    `Open gaps: ${false ? result.gaps.join(', ') : '(none)'}`,
   ];
 }
killedBy: renderInterviewSummary renders an all-gaps result with no pinned dimensions
statusReason: expected 'Open gaps: (none)' to be 'Open gaps: problem, audience, outcome…' // Object.is equality
