[Killed] BlockStatement
product/src/judge/loop.ts:46:62
 export const DEFAULT_JUDGE_THRESHOLD = 80;
 export const DEFAULT_MAX_REWORK_ITERATIONS = 3;
 
-function resolveThreshold(options: JudgeLoopOptions): number {
-  const threshold = options.threshold ?? DEFAULT_JUDGE_THRESHOLD;
-  if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
-    throw new Error('judge loop: threshold must be a finite number between 0 and 100');
-  }
-  return threshold;
-}
+function resolveThreshold(options: JudgeLoopOptions): number {}
 
 function resolveMaxIterations(options: JudgeLoopOptions): number {
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: expected 'no-improvement' to be 'passed' // Object.is equality

[Killed] LogicalOperator
product/src/judge/loop.ts:47:21
 export const DEFAULT_MAX_REWORK_ITERATIONS = 3;
 
 function resolveThreshold(options: JudgeLoopOptions): number {
-  const threshold = options.threshold ?? DEFAULT_JUDGE_THRESHOLD;
+  const threshold = options.threshold && DEFAULT_JUDGE_THRESHOLD;
   if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
     throw new Error('judge loop: threshold must be a finite number between 0 and 100');
killedBy: reworkStoryMechanically converges to passed through judgeStory with default deps when only fixable checks fail
statusReason: judge loop: threshold must be a finite number between 0 and 100

[Killed] ConditionalExpression
product/src/judge/loop.ts:48:7
 
 function resolveThreshold(options: JudgeLoopOptions): number {
   const threshold = options.threshold ?? DEFAULT_JUDGE_THRESHOLD;
-  if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
+  if (true) {
     throw new Error('judge loop: threshold must be a finite number between 0 and 100');
   }
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: judge loop: threshold must be a finite number between 0 and 100

[Killed] EqualityOperator
product/src/judge/loop.ts:48:38
 
 function resolveThreshold(options: JudgeLoopOptions): number {
   const threshold = options.threshold ?? DEFAULT_JUDGE_THRESHOLD;
-  if (!Number.isFinite(threshold) || threshold < 0 || threshold > 100) {
+  if (!Number.isFinite(threshold) || threshold >= 0 || threshold > 100) {
     throw new Error('judge loop: threshold must be a finite number between 0 and 100');
   }
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: judge loop: threshold must be a finite number between 0 and 100

[Killed] BlockStatement
product/src/judge/loop.ts:54:66
   return threshold;
 }
 
-function resolveMaxIterations(options: JudgeLoopOptions): number {
-  const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
-    throw new Error('judge loop: maxIterations must be a non-negative integer');
-  }
-  return maxIterations;
-}
+function resolveMaxIterations(options: JudgeLoopOptions): number {}
 
 /**
killedBy: judgeStory reworks a below-threshold story with the story, verdict, and doc
statusReason: expected "vi.fn()" to be called with arguments: [ { schemaVersion: 1, …(13) }, …(2) ]

Number of calls: 0

[Killed] LogicalOperator
product/src/judge/loop.ts:55:25
 }
 
 function resolveMaxIterations(options: JudgeLoopOptions): number {
-  const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
+  const maxIterations = options.maxIterations && DEFAULT_MAX_REWORK_ITERATIONS;
   if (!Number.isInteger(maxIterations) || maxIterations < 0) {
     throw new Error('judge loop: maxIterations must be a non-negative integer');
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: judge loop: maxIterations must be a non-negative integer

[Killed] ConditionalExpression
product/src/judge/loop.ts:56:7
 
 function resolveMaxIterations(options: JudgeLoopOptions): number {
   const maxIterations = options.maxIterations ?? DEFAULT_MAX_REWORK_ITERATIONS;
-  if (!Number.isInteger(maxIterations) || maxIterations < 0) {
+  if (true) {
     throw new Error('judge loop: maxIterations must be a non-negative integer');
   }
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: judge loop: maxIterations must be a non-negative integer

[Killed] LogicalOperator
product/src/judge/loop.ts:73:17
   deps: JudgeLoopDeps = {},
   options: JudgeLoopOptions = {},
 ): Promise<JudgedStory> {
-  const judge = deps.judge ?? judgeStoryAgainstIntent;
+  const judge = deps.judge && judgeStoryAgainstIntent;
   const rework = deps.rework ?? reworkStoryMechanically;
   const threshold = resolveThreshold(options);
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: expected [ 100 ] to deeply equal [ 90 ]

[Killed] LogicalOperator
product/src/judge/loop.ts:74:18
   options: JudgeLoopOptions = {},
 ): Promise<JudgedStory> {
   const judge = deps.judge ?? judgeStoryAgainstIntent;
-  const rework = deps.rework ?? reworkStoryMechanically;
+  const rework = deps.rework && reworkStoryMechanically;
   const threshold = resolveThreshold(options);
   const maxIterations = resolveMaxIterations(options);
killedBy: judgeStory reworks a below-threshold story with the story, verdict, and doc
statusReason: expected "vi.fn()" to be called with arguments: [ { schemaVersion: 1, …(13) }, …(2) ]

Number of calls: 0

[Killed] ArrayDeclaration
product/src/judge/loop.ts:79:34
   const maxIterations = resolveMaxIterations(options);
 
   let best = { story, verdict: await judge(story, doc) };
-  const scoreHistory: number[] = [best.verdict.score];
+  const scoreHistory: number[] = [];
 
   if (best.verdict.score >= threshold) {
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: expected [] to deeply equal [ 90 ]

[Killed] BlockStatement
product/src/judge/loop.ts:81:40
   let best = { story, verdict: await judge(story, doc) };
   const scoreHistory: number[] = [best.verdict.score];
 
-  if (best.verdict.score >= threshold) {
-    return { story: best.story, verdict: best.verdict, iterations: 0, stopReason: 'passed', scoreHistory };
-  }
+  if (best.verdict.score >= threshold) {}
 
   for (let i = 1; i <= maxIterations; i++) {
killedBy: judgeStory passes immediately when the judge scores at or above threshold, without reworking
statusReason: expected 'no-improvement' to be 'passed' // Object.is equality

[Killed] ConditionalExpression
product/src/judge/loop.ts:81:7
   let best = { story, verdict: await judge(story, doc) };
   const scoreHistory: number[] = [best.verdict.score];
 
-  if (best.verdict.score >= threshold) {
+  if (true) {
     return { story: best.story, verdict: best.verdict, iterations: 0, stopReason: 'passed', scoreHistory };
   }
killedBy: judgeStory reworks a below-threshold story with the story, verdict, and doc
statusReason: expected "vi.fn()" to be called with arguments: [ { schemaVersion: 1, …(13) }, …(2) ]

Number of calls: 0

[Killed] BlockStatement
product/src/judge/loop.ts:85:44
     return { story: best.story, verdict: best.verdict, iterations: 0, stopReason: 'passed', scoreHistory };
   }
 
-  for (let i = 1; i <= maxIterations; i++) {
-    const candidate = await rework(best.story, best.verdict, doc);
-    const verdict = await judge(candidate, doc);
-    scoreHistory.push(verdict.score);
-
-    if (verdict.score <= best.verdict.score) {
-      return { story: best.story, verdict: best.verdict, iterations: i, stopReason: 'no-improvement', scoreHistory };
-    }
-
-    best = { story: candidate, verdict };
-    if (verdict.score >= threshold) {
-      return { story: best.story, verdict: best.verdict, iterations: i, stopReason: 'passed', scoreHistory };
-    }
-  }
+  for (let i = 1; i <= maxIterations; i++) {}
 
   return {
killedBy: judgeStory reworks a below-threshold story with the story, verdict, and doc
statusReason: expected "vi.fn()" to be called with arguments: [ { schemaVersion: 1, …(13) }, …(2) ]

Number of calls: 0

[Killed] CallExpression
product/src/judge/loop.ts:88:5
   for (let i = 1; i <= maxIterations; i++) {
     const candidate = await rework(best.story, best.verdict, doc);
     const verdict = await judge(candidate, doc);
-    scoreHistory.push(verdict.score);
+    ;
 
     if (verdict.score <= best.verdict.score) {
killedBy: judgeStory stops at max-iterations when scores improve but never reach threshold
statusReason: expected [ 10 ] to deeply equal [ 10, 20, 30, 40 ]

[Killed] EqualityOperator
product/src/judge/loop.ts:90:9
     const verdict = await judge(candidate, doc);
     scoreHistory.push(verdict.score);
 
-    if (verdict.score <= best.verdict.score) {
+    if (verdict.score > best.verdict.score) {
       return { story: best.story, verdict: best.verdict, iterations: i, stopReason: 'no-improvement', scoreHistory };
     }
killedBy: judgeStory stops at max-iterations when scores improve but never reach threshold
statusReason: expected 'no-improvement' to be 'max-iterations' // Object.is equality

[Killed] EqualityOperator
product/src/judge/loop.ts:95:9
     }
 
     best = { story: candidate, verdict };
-    if (verdict.score >= threshold) {
+    if (verdict.score < threshold) {
       return { story: best.story, verdict: best.verdict, iterations: i, stopReason: 'passed', scoreHistory };
     }
killedBy: judgeStory stops at max-iterations when scores improve but never reach threshold
statusReason: expected 'passed' to be 'max-iterations' // Object.is equality

[Killed] ConditionalExpression
product/src/judge/loop.ts:95:9
     }
 
     best = { story: candidate, verdict };
-    if (verdict.score >= threshold) {
+    if (true) {
       return { story: best.story, verdict: best.verdict, iterations: i, stopReason: 'passed', scoreHistory };
     }
killedBy: judgeStory stops at max-iterations when scores improve but never reach threshold
statusReason: expected 'passed' to be 'max-iterations' // Object.is equality

[Killed] ObjectLiteral
product/src/judge/loop.ts:96:14
 
     best = { story: candidate, verdict };
     if (verdict.score >= threshold) {
-      return { story: best.story, verdict: best.verdict, iterations: i, stopReason: 'passed', scoreHistory };
+      return {};
     }
   }
killedBy: judgeStory passes mid-loop and keeps the reworked candidate that crossed the threshold
statusReason: expected undefined to be 'passed' // Object.is equality

[Killed] BlockStatement
product/src/judge/loop.ts:115:25
   doc: IntentDoc,
   deps: JudgeLoopDeps = {},
   options: JudgeLoopOptions = {},
-): Promise<JudgeReport> {
-  const threshold = resolveThreshold(options);
-  const maxIterations = resolveMaxIterations(options);
-
-  const stories: JudgedStory[] = [];
-  for (const story of decomposition.stories) {
-    stories.push(await judgeStory(story, doc, deps, { threshold, maxIterations }));
-  }
-
-  return { stories, threshold, maxIterations, allPassed: stories.every((s) => s.stopReason === 'passed') };
-}
+): Promise<JudgeReport> {}
 
killedBy: judgeDecomposition preserves story order, echoes threshold/maxIterations, and reports allPassed
statusReason: Cannot read properties of undefined (reading 'stories')

[Killed] BlockStatement
product/src/judge/loop.ts:120:46
   const maxIterations = resolveMaxIterations(options);
 
   const stories: JudgedStory[] = [];
-  for (const story of decomposition.stories) {
-    stories.push(await judgeStory(story, doc, deps, { threshold, maxIterations }));
-  }
+  for (const story of decomposition.stories) {}
 
   return { stories, threshold, maxIterations, allPassed: stories.every((s) => s.stopReason === 'passed') };
killedBy: judgeDecomposition preserves story order, echoes threshold/maxIterations, and reports allPassed
statusReason: expected [] to deeply equal [ 'Story A', 'Story B' ]

[Killed] MethodExpression
product/src/judge/loop.ts:124:58
     stories.push(await judgeStory(story, doc, deps, { threshold, maxIterations }));
   }
 
-  return { stories, threshold, maxIterations, allPassed: stories.every((s) => s.stopReason === 'passed') };
+  return { stories, threshold, maxIterations, allPassed: stories.some(s => s.stopReason === 'passed') };
 }
 
killedBy: judgeDecomposition preserves story order, echoes threshold/maxIterations, and reports allPassed
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/judge/loop.ts:124:79
     stories.push(await judgeStory(story, doc, deps, { threshold, maxIterations }));
   }
 
-  return { stories, threshold, maxIterations, allPassed: stories.every((s) => s.stopReason === 'passed') };
+  return { stories, threshold, maxIterations, allPassed: stories.every((s) => false) };
 }
 
killedBy: judgeDecomposition reports allPassed true when every story passes
statusReason: expected false to be true // Object.is equality
