[Survived] ArrayDeclaration
product/src/readiness/artifacts.ts:21:73
 
 export type ArtifactKind = ProposerArtifactKind | WriterArtifactKind;
 
-export const PROPOSER_ARTIFACT_KINDS: readonly ProposerArtifactKind[] = [
-  'intent',
-  'decomposition',
-  'epic-architecture',
-  'design-critique',
-  'adr-conformance',
-];
+export const PROPOSER_ARTIFACT_KINDS: readonly ProposerArtifactKind[] = [];
 
 export const WRITER_ARTIFACT_KINDS: readonly WriterArtifactKind[] = [

[Survived] StringLiteral
product/src/readiness/artifacts.ts:22:3
 export type ArtifactKind = ProposerArtifactKind | WriterArtifactKind;
 
 export const PROPOSER_ARTIFACT_KINDS: readonly ProposerArtifactKind[] = [
-  'intent',
+  "",
   'decomposition',
   'epic-architecture',

[Survived] StringLiteral
product/src/readiness/artifacts.ts:24:3
 export const PROPOSER_ARTIFACT_KINDS: readonly ProposerArtifactKind[] = [
   'intent',
   'decomposition',
-  'epic-architecture',
+  "",
   'design-critique',
   'adr-conformance',

[Survived] StringLiteral
product/src/readiness/artifacts.ts:25:3
   'intent',
   'decomposition',
   'epic-architecture',
-  'design-critique',
+  "",
   'adr-conformance',
 ];

[Killed] BlockStatement
product/src/readiness/artifacts.ts:36:69
 ];
 
 /** The one classifier the gate trusts: proposer-owned kinds gate handoff, writer-owned never do. */
-export function classifyArtifact(kind: ArtifactKind): ArtifactOwner {
-  return (PROPOSER_ARTIFACT_KINDS as readonly string[]).includes(kind) ? 'proposer' : 'writer';
-}
+export function classifyArtifact(kind: ArtifactKind): ArtifactOwner {}
 
 /** ADR conformance evidence the proposer collected against the ADR home. */
killedBy: classifyArtifact classifies every proposer-owned kind as proposer
statusReason: expected undefined to be 'proposer' // Object.is equality

[Killed] StringLiteral
product/src/readiness/artifacts.ts:37:74
 
 /** The one classifier the gate trusts: proposer-owned kinds gate handoff, writer-owned never do. */
 export function classifyArtifact(kind: ArtifactKind): ArtifactOwner {
-  return (PROPOSER_ARTIFACT_KINDS as readonly string[]).includes(kind) ? 'proposer' : 'writer';
+  return (PROPOSER_ARTIFACT_KINDS as readonly string[]).includes(kind) ? "" : 'writer';
 }
 
killedBy: classifyArtifact classifies every proposer-owned kind as proposer
statusReason: expected '' to be 'proposer' // Object.is equality
