[Killed] BlockStatement
product/src/readiness/gate.ts:10:91
   | { ok: false; report: ReadinessReport; blockers: readonly string[] };
 
 /** The explicit human gate over the handoff — mirrors approveIntentDoc (human gate #1). */
-export function gateHandoff(report: ReadinessReport, approvedBy: string): HandoffDecision {
-  const blockers: string[] = report.dimensions.filter((d) => !d.ready).map((d) => d.reason);
-
-  if (approvedBy.trim() === '') {
-    blockers.push('handoff needs a named human approver');
-  }
-
-  if (blockers.length > 0) {
-    return { ok: false, report, blockers };
-  }
-
-  return { ok: true, report, approvedBy: approvedBy.trim() };
-}
+export function gateHandoff(report: ReadinessReport, approvedBy: string): HandoffDecision {}
 
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] ArrowFunction
product/src/readiness/gate.ts:11:76
 
 /** The explicit human gate over the handoff — mirrors approveIntentDoc (human gate #1). */
 export function gateHandoff(report: ReadinessReport, approvedBy: string): HandoffDecision {
-  const blockers: string[] = report.dimensions.filter((d) => !d.ready).map((d) => d.reason);
+  const blockers: string[] = report.dimensions.filter((d) => !d.ready).map(() => undefined);
 
   if (approvedBy.trim() === '') {
killedBy: gateHandoff blocks and reports the missing epic architecture document for a not-ready report
statusReason: expected [ undefined ] to deeply equal [ Array(1) ]

[Killed] MethodExpression
product/src/readiness/gate.ts:11:30
 
 /** The explicit human gate over the handoff — mirrors approveIntentDoc (human gate #1). */
 export function gateHandoff(report: ReadinessReport, approvedBy: string): HandoffDecision {
-  const blockers: string[] = report.dimensions.filter((d) => !d.ready).map((d) => d.reason);
+  const blockers: string[] = report.dimensions.map((d) => d.reason);
 
   if (approvedBy.trim() === '') {
killedBy: gateHandoff approves a ready report with a named approver
statusReason: expected { ok: false, report: { …(3) }, …(1) } to deeply equal { ok: true, report: { …(3) }, …(1) }

[Killed] MethodExpression
product/src/readiness/gate.ts:13:7
 export function gateHandoff(report: ReadinessReport, approvedBy: string): HandoffDecision {
   const blockers: string[] = report.dimensions.filter((d) => !d.ready).map((d) => d.reason);
 
-  if (approvedBy.trim() === '') {
+  if (approvedBy === '') {
     blockers.push('handoff needs a named human approver');
   }
killedBy: gateHandoff blocks a ready report with a blank approver
statusReason: expected { ok: true, report: { …(3) }, …(1) } to deeply equal { ok: false, report: { …(3) }, …(1) }

[Killed] StringLiteral
product/src/readiness/gate.ts:14:19
   const blockers: string[] = report.dimensions.filter((d) => !d.ready).map((d) => d.reason);
 
   if (approvedBy.trim() === '') {
-    blockers.push('handoff needs a named human approver');
+    blockers.push("");
   }
 
killedBy: gateHandoff blocks a ready report with a blank approver
statusReason: expected { ok: false, report: { …(3) }, …(1) } to deeply equal { ok: false, report: { …(3) }, …(1) }

[Killed] BlockStatement
product/src/readiness/gate.ts:17:28
     blockers.push('handoff needs a named human approver');
   }
 
-  if (blockers.length > 0) {
-    return { ok: false, report, blockers };
-  }
+  if (blockers.length > 0) {}
 
   return { ok: true, report, approvedBy: approvedBy.trim() };
killedBy: gateHandoff blocks a ready report with a blank approver
statusReason: expected { ok: true, report: { …(3) }, …(1) } to deeply equal { ok: false, report: { …(3) }, …(1) }

[Killed] BooleanLiteral
product/src/readiness/gate.ts:18:18
   }
 
   if (blockers.length > 0) {
-    return { ok: false, report, blockers };
+    return { ok: true, report, blockers };
   }
 
killedBy: gateHandoff blocks a ready report with a blank approver
statusReason: expected { ok: true, report: { …(3) }, …(1) } to deeply equal { ok: false, report: { …(3) }, …(1) }

[Killed] BooleanLiteral
product/src/readiness/gate.ts:21:16
     return { ok: false, report, blockers };
   }
 
-  return { ok: true, report, approvedBy: approvedBy.trim() };
+  return { ok: false, report, approvedBy: approvedBy.trim() };
 }
 
killedBy: gateHandoff approves a ready report with a named approver
statusReason: expected { ok: false, report: { …(3) }, …(1) } to deeply equal { ok: true, report: { …(3) }, …(1) }

[Survived] MethodExpression
product/src/readiness/gate.ts:21:42
     return { ok: false, report, blockers };
   }
 
-  return { ok: true, report, approvedBy: approvedBy.trim() };
+  return { ok: true, report, approvedBy: approvedBy };
 }
 
