[Killed] BlockStatement
product/src/readiness/render.ts:6:74
 import type { ReadinessReport } from './report.js';
 
 /** Human-readable markdown lines for the CLI. Matches renderJudgeReport's plain-ASCII style. */
-export function renderReadinessReport(report: ReadinessReport): string[] {
-  const lines: string[] = ['# Readiness Report', `Status: ${report.status}`, ''];
-
-  for (const dimension of report.dimensions) {
-    lines.push(`- [${dimension.ready ? 'ready' : 'not ready'}] ${dimension.label}: ${dimension.reason}`);
-  }
-
-  lines.push('', '## Open questions for the writer');
-  if (report.openQuestions.length === 0) {
-    lines.push('No open questions.');
-  } else {
-    for (const question of report.openQuestions) {
-      lines.push(`- (${question.source}) ${question.text}`);
-    }
-  }
-
-  return lines;
-}
+export function renderReadinessReport(report: ReadinessReport): string[] {}
 
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: Cannot read properties of undefined (reading 'join')

[Killed] StringLiteral
product/src/readiness/render.ts:7:50
 
 /** Human-readable markdown lines for the CLI. Matches renderJudgeReport's plain-ASCII style. */
 export function renderReadinessReport(report: ReadinessReport): string[] {
-  const lines: string[] = ['# Readiness Report', `Status: ${report.status}`, ''];
+  const lines: string[] = ['# Readiness Report', ``, ''];
 
   for (const dimension of report.dimensions) {
killedBy: renderReadinessReport renders a ready report with all dimensions and no open questions
statusReason: expected [ '# Readiness Report', '', '', …(8) ] to include 'Status: ready'

[Survived] StringLiteral
product/src/readiness/render.ts:7:28
 
 /** Human-readable markdown lines for the CLI. Matches renderJudgeReport's plain-ASCII style. */
 export function renderReadinessReport(report: ReadinessReport): string[] {
-  const lines: string[] = ['# Readiness Report', `Status: ${report.status}`, ''];
+  const lines: string[] = ["", `Status: ${report.status}`, ''];
 
   for (const dimension of report.dimensions) {

[Killed] BlockStatement
product/src/readiness/render.ts:9:46
 export function renderReadinessReport(report: ReadinessReport): string[] {
   const lines: string[] = ['# Readiness Report', `Status: ${report.status}`, ''];
 
-  for (const dimension of report.dimensions) {
-    lines.push(`- [${dimension.ready ? 'ready' : 'not ready'}] ${dimension.label}: ${dimension.reason}`);
-  }
+  for (const dimension of report.dimensions) {}
 
   lines.push('', '## Open questions for the writer');
killedBy: renderReadinessReport renders a ready report with all dimensions and no open questions
statusReason: expected [ '# Readiness Report', …(5) ] to include '- [ready] intent: intent is ready'

[Killed] StringLiteral
product/src/readiness/render.ts:10:40
   const lines: string[] = ['# Readiness Report', `Status: ${report.status}`, ''];
 
   for (const dimension of report.dimensions) {
-    lines.push(`- [${dimension.ready ? 'ready' : 'not ready'}] ${dimension.label}: ${dimension.reason}`);
+    lines.push(`- [${dimension.ready ? "" : 'not ready'}] ${dimension.label}: ${dimension.reason}`);
   }
 
killedBy: renderReadinessReport renders a ready report with all dimensions and no open questions
statusReason: expected [ '# Readiness Report', …(10) ] to include '- [ready] intent: intent is ready'

[Survived] StringLiteral
product/src/readiness/render.ts:13:14
     lines.push(`- [${dimension.ready ? 'ready' : 'not ready'}] ${dimension.label}: ${dimension.reason}`);
   }
 
-  lines.push('', '## Open questions for the writer');
+  lines.push("Stryker was here!", '## Open questions for the writer');
   if (report.openQuestions.length === 0) {
     lines.push('No open questions.');

[Killed] EqualityOperator
product/src/readiness/render.ts:14:7
   }
 
   lines.push('', '## Open questions for the writer');
-  if (report.openQuestions.length === 0) {
+  if (report.openQuestions.length !== 0) {
     lines.push('No open questions.');
   } else {
killedBy: renderReadinessReport renders a ready report with all dimensions and no open questions
statusReason: expected [ '# Readiness Report', …(9) ] to include 'No open questions.'

[Killed] ConditionalExpression
product/src/readiness/render.ts:14:7
   }
 
   lines.push('', '## Open questions for the writer');
-  if (report.openQuestions.length === 0) {
+  if (false) {
     lines.push('No open questions.');
   } else {
killedBy: renderReadinessReport renders a ready report with all dimensions and no open questions
statusReason: expected [ '# Readiness Report', …(9) ] to include 'No open questions.'

[Killed] BlockStatement
product/src/readiness/render.ts:16:10
   lines.push('', '## Open questions for the writer');
   if (report.openQuestions.length === 0) {
     lines.push('No open questions.');
-  } else {
-    for (const question of report.openQuestions) {
-      lines.push(`- (${question.source}) ${question.text}`);
-    }
-  }
+  } else {}
 
   return lines;
killedBy: renderReadinessReport renders a not-ready report with the failing reason and both open-question sources
statusReason: expected [ '# Readiness Report', …(9) ] to include '- (epic-architecture) where does the …'

[Killed] BlockStatement
product/src/readiness/render.ts:17:50
   if (report.openQuestions.length === 0) {
     lines.push('No open questions.');
   } else {
-    for (const question of report.openQuestions) {
-      lines.push(`- (${question.source}) ${question.text}`);
-    }
+    for (const question of report.openQuestions) {}
   }
 
killedBy: renderReadinessReport renders a not-ready report with the failing reason and both open-question sources
statusReason: expected [ '# Readiness Report', …(9) ] to include '- (epic-architecture) where does the …'
