[Killed] StringLiteral
product/src/readiness/report.ts:35:3
 }
 
 export const READINESS_DIMENSION_IDS: readonly ReadinessDimensionId[] = [
-  'intent',
+  "",
   'decomposition',
   'technical-design',
killedBy: assessReadiness always returns exactly the five dimensions in fixed order
statusReason: expected [ 'intent', 'decomposition', …(3) ] to deeply equal [ '', 'decomposition', …(3) ]

[Killed] StringLiteral
product/src/readiness/report.ts:38:3
   'intent',
   'decomposition',
   'technical-design',
-  'design-critique',
+  "",
   'adr-conformance',
 ];
killedBy: assessReadiness always returns exactly the five dimensions in fixed order
statusReason: expected [ 'intent', 'decomposition', …(3) ] to deeply equal [ 'intent', 'decomposition', …(3) ]

[Killed] StringLiteral
product/src/readiness/report.ts:39:3
   'decomposition',
   'technical-design',
   'design-critique',
-  'adr-conformance',
+  "",
 ];
 
killedBy: assessReadiness always returns exactly the five dimensions in fixed order
statusReason: expected [ 'intent', 'decomposition', …(3) ] to deeply equal [ 'intent', 'decomposition', …(3) ]

[Killed] BlockStatement
product/src/readiness/report.ts:42:73
   'adr-conformance',
 ];
 
-function assessIntent(artifacts: ProposerArtifacts): ReadinessDimension {
-  const { intent } = artifacts;
-  if (!intent) {
-    return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
-  }
-  if (intent.status !== 'approved') {
-    return {
-      id: 'intent',
-      label: 'Intent',
-      ready: false,
-      reason: 'intent doc is a draft — human gate #1 (approveIntentDoc) has not passed',
-    };
-  }
-  return { id: 'intent', label: 'Intent', ready: true, reason: 'intent doc is approved' };
-}
+function assessIntent(artifacts: ProposerArtifacts): ReadinessDimension {}
 
 function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {
killedBy: designEpicArchitecture flows the epic architecture artifact into readiness as technical-design ready with forwarded open questions
statusReason: Cannot read properties of undefined (reading 'ready')

[Killed] ConditionalExpression
product/src/readiness/report.ts:44:7
 
 function assessIntent(artifacts: ProposerArtifacts): ReadinessDimension {
   const { intent } = artifacts;
-  if (!intent) {
+  if (false) {
     return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
   }
killedBy: designEpicArchitecture flows the epic architecture artifact into readiness as technical-design ready with forwarded open questions
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
product/src/readiness/report.ts:44:7
 
 function assessIntent(artifacts: ProposerArtifacts): ReadinessDimension {
   const { intent } = artifacts;
-  if (!intent) {
+  if (true) {
     return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
   }
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:45:52
 function assessIntent(artifacts: ProposerArtifacts): ReadinessDimension {
   const { intent } = artifacts;
   if (!intent) {
-    return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
+    return { id: 'intent', label: 'Intent', ready: true, reason: 'intent doc missing' };
   }
   if (intent.status !== 'approved') {
killedBy: assessReadiness flips only the intent dimension when the intent doc is missing
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
product/src/readiness/report.ts:45:18
 function assessIntent(artifacts: ProposerArtifacts): ReadinessDimension {
   const { intent } = artifacts;
   if (!intent) {
-    return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
+    return { id: "", label: 'Intent', ready: false, reason: 'intent doc missing' };
   }
   if (intent.status !== 'approved') {
killedBy: assessReadiness flips only the intent dimension when the intent doc is missing
statusReason: Cannot read properties of undefined (reading 'ready')

[Killed] ConditionalExpression
product/src/readiness/report.ts:47:7
   if (!intent) {
     return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
   }
-  if (intent.status !== 'approved') {
+  if (true) {
     return {
       id: 'intent',
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] EqualityOperator
product/src/readiness/report.ts:47:7
   if (!intent) {
     return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc missing' };
   }
-  if (intent.status !== 'approved') {
+  if (intent.status === 'approved') {
     return {
       id: 'intent',
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:51:14
     return {
       id: 'intent',
       label: 'Intent',
-      ready: false,
+      ready: true,
       reason: 'intent doc is a draft — human gate #1 (approveIntentDoc) has not passed',
     };
killedBy: assessReadiness flips only the intent dimension when the intent doc is a draft
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:55:50
       reason: 'intent doc is a draft — human gate #1 (approveIntentDoc) has not passed',
     };
   }
-  return { id: 'intent', label: 'Intent', ready: true, reason: 'intent doc is approved' };
+  return { id: 'intent', label: 'Intent', ready: false, reason: 'intent doc is approved' };
 }
 
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Survived] StringLiteral
product/src/readiness/report.ts:55:33
       reason: 'intent doc is a draft — human gate #1 (approveIntentDoc) has not passed',
     };
   }
-  return { id: 'intent', label: 'Intent', ready: true, reason: 'intent doc is approved' };
+  return { id: 'intent', label: "", ready: true, reason: 'intent doc is approved' };
 }
 

[Killed] BlockStatement
product/src/readiness/report.ts:58:80
   return { id: 'intent', label: 'Intent', ready: true, reason: 'intent doc is approved' };
 }
 
-function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {
-  const { decomposition } = artifacts;
-  if (!decomposition) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
-  }
-  if (decomposition.stories.length === 0) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition has no stories' };
-  }
-  return {
-    id: 'decomposition',
-    label: 'Decomposition',
-    ready: true,
-    reason: `decomposition has ${decomposition.stories.length} stor${decomposition.stories.length === 1 ? 'y' : 'ies'}`,
-  };
-}
+function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {}
 
 function assessTechnicalDesign(artifacts: ProposerArtifacts): ReadinessDimension {
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'ready')

[Killed] BooleanLiteral
product/src/readiness/report.ts:60:7
 
 function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {
   const { decomposition } = artifacts;
-  if (!decomposition) {
+  if (decomposition) {
     return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
   }
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] BlockStatement
product/src/readiness/report.ts:60:23
 
 function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {
   const { decomposition } = artifacts;
-  if (!decomposition) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
-  }
+  if (!decomposition) {}
   if (decomposition.stories.length === 0) {
     return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition has no stories' };
killedBy: buildDesignBundle omits the decomposition-derived files entirely when there is no decomposition
statusReason: Cannot read properties of undefined (reading 'stories')

[Killed] BooleanLiteral
product/src/readiness/report.ts:61:66
 function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {
   const { decomposition } = artifacts;
   if (!decomposition) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
+    return { id: 'decomposition', label: 'Decomposition', ready: true, reason: 'decomposition missing' };
   }
   if (decomposition.stories.length === 0) {
killedBy: assessReadiness flips only the decomposition dimension when the decomposition is missing
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
product/src/readiness/report.ts:61:81
 function assessDecomposition(artifacts: ProposerArtifacts): ReadinessDimension {
   const { decomposition } = artifacts;
   if (!decomposition) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
+    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: "" };
   }
   if (decomposition.stories.length === 0) {
killedBy: assessReadiness flips only the decomposition dimension when the decomposition is missing
statusReason: expected '' to be 'decomposition missing' // Object.is equality

[Killed] BlockStatement
product/src/readiness/report.ts:63:43
   if (!decomposition) {
     return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
   }
-  if (decomposition.stories.length === 0) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition has no stories' };
-  }
+  if (decomposition.stories.length === 0) {}
   return {
     id: 'decomposition',
killedBy: assessReadiness flips only the decomposition dimension when there are no stories
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:64:66
     return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
   }
   if (decomposition.stories.length === 0) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition has no stories' };
+    return { id: 'decomposition', label: 'Decomposition', ready: true, reason: 'decomposition has no stories' };
   }
   return {
killedBy: assessReadiness flips only the decomposition dimension when there are no stories
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
product/src/readiness/report.ts:64:81
     return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition missing' };
   }
   if (decomposition.stories.length === 0) {
-    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: 'decomposition has no stories' };
+    return { id: 'decomposition', label: 'Decomposition', ready: false, reason: "" };
   }
   return {
killedBy: assessReadiness flips only the decomposition dimension when there are no stories
statusReason: expected '' to be 'decomposition has no stories' // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:69:12
   return {
     id: 'decomposition',
     label: 'Decomposition',
-    ready: true,
+    ready: false,
     reason: `decomposition has ${decomposition.stories.length} stor${decomposition.stories.length === 1 ? 'y' : 'ies'}`,
   };
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Survived] ConditionalExpression
product/src/readiness/report.ts:70:70
     id: 'decomposition',
     label: 'Decomposition',
     ready: true,
-    reason: `decomposition has ${decomposition.stories.length} stor${decomposition.stories.length === 1 ? 'y' : 'ies'}`,
+    reason: `decomposition has ${decomposition.stories.length} stor${true ? 'y' : 'ies'}`,
   };
 }

[Survived] EqualityOperator
product/src/readiness/report.ts:70:70
     id: 'decomposition',
     label: 'Decomposition',
     ready: true,
-    reason: `decomposition has ${decomposition.stories.length} stor${decomposition.stories.length === 1 ? 'y' : 'ies'}`,
+    reason: `decomposition has ${decomposition.stories.length} stor${decomposition.stories.length !== 1 ? 'y' : 'ies'}`,
   };
 }

[Killed] BlockStatement
product/src/readiness/report.ts:74:82
   };
 }
 
-function assessTechnicalDesign(artifacts: ProposerArtifacts): ReadinessDimension {
-  const { epicArchitecture } = artifacts;
-  if (!epicArchitecture) {
-    return {
-      id: 'technical-design',
-      label: 'Technical design',
-      ready: false,
-      reason: 'missing the epic architecture document',
-    };
-  }
-  return {
-    id: 'technical-design',
-    label: 'Technical design',
-    ready: true,
-    reason: 'epic architecture document is present',
-  };
-}
+function assessTechnicalDesign(artifacts: ProposerArtifacts): ReadinessDimension {}
 
 function assessDesignCritique(artifacts: ProposerArtifacts): ReadinessDimension {
killedBy: buildDesignBundle emits every bundle file in the exact order and paths for a full artifact set
statusReason: Cannot read properties of undefined (reading 'ready')

[Killed] BooleanLiteral
product/src/readiness/report.ts:76:7
 
 function assessTechnicalDesign(artifacts: ProposerArtifacts): ReadinessDimension {
   const { epicArchitecture } = artifacts;
-  if (!epicArchitecture) {
+  if (epicArchitecture) {
     return {
       id: 'technical-design',
killedBy: designEpicArchitecture flows the epic architecture artifact into readiness as technical-design ready with forwarded open questions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
product/src/readiness/report.ts:76:7
 
 function assessTechnicalDesign(artifacts: ProposerArtifacts): ReadinessDimension {
   const { epicArchitecture } = artifacts;
-  if (!epicArchitecture) {
+  if (true) {
     return {
       id: 'technical-design',
killedBy: designEpicArchitecture flows the epic architecture artifact into readiness as technical-design ready with forwarded open questions
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
product/src/readiness/report.ts:79:14
   if (!epicArchitecture) {
     return {
       id: 'technical-design',
-      label: 'Technical design',
+      label: "",
       ready: false,
       reason: 'missing the epic architecture document',

[Killed] BooleanLiteral
product/src/readiness/report.ts:80:14
     return {
       id: 'technical-design',
       label: 'Technical design',
-      ready: false,
+      ready: true,
       reason: 'missing the epic architecture document',
     };
killedBy: assessReadiness scenario 1: missing epic architecture blocks the technical-design dimension
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
product/src/readiness/report.ts:84:10
       reason: 'missing the epic architecture document',
     };
   }
-  return {
-    id: 'technical-design',
-    label: 'Technical design',
-    ready: true,
-    reason: 'epic architecture document is present',
-  };
+  return {};
 }
 
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:87:12
   return {
     id: 'technical-design',
     label: 'Technical design',
-    ready: true,
+    ready: false,
     reason: 'epic architecture document is present',
   };
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:94:7
 
 function assessDesignCritique(artifacts: ProposerArtifacts): ReadinessDimension {
   const { designCritique } = artifacts;
-  if (!designCritique) {
+  if (designCritique) {
     return {
       id: 'design-critique',
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] ConditionalExpression
product/src/readiness/report.ts:94:7
 
 function assessDesignCritique(artifacts: ProposerArtifacts): ReadinessDimension {
   const { designCritique } = artifacts;
-  if (!designCritique) {
+  if (false) {
     return {
       id: 'design-critique',
killedBy: assessReadiness flips only the design-critique dimension when it is missing
statusReason: Cannot read properties of undefined (reading 'allPassed')

[Killed] StringLiteral
product/src/readiness/report.ts:96:11
   const { designCritique } = artifacts;
   if (!designCritique) {
     return {
-      id: 'design-critique',
+      id: "",
       label: 'Design critique',
       ready: false,
killedBy: assessReadiness flips only the design-critique dimension when it is missing
statusReason: Cannot read properties of undefined (reading 'ready')

[Killed] BooleanLiteral
product/src/readiness/report.ts:98:14
     return {
       id: 'design-critique',
       label: 'Design critique',
-      ready: false,
+      ready: true,
       reason: 'epic-design critic result missing',
     };
killedBy: assessReadiness flips only the design-critique dimension when it is missing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/readiness/report.ts:102:7
       reason: 'epic-design critic result missing',
     };
   }
-  if (!designCritique.allPassed) {
+  if (false) {
     const notPassed = designCritique.stories.filter((s) => s.stopReason !== 'passed').length;
     return {
killedBy: assessReadiness flips only the design-critique dimension when a story did not pass
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
product/src/readiness/report.ts:102:34
       reason: 'epic-design critic result missing',
     };
   }
-  if (!designCritique.allPassed) {
-    const notPassed = designCritique.stories.filter((s) => s.stopReason !== 'passed').length;
-    return {
-      id: 'design-critique',
-      label: 'Design critique',
-      ready: false,
-      reason: `${notPassed} of ${designCritique.stories.length} stories did not pass the epic-design critic`,
-    };
-  }
+  if (!designCritique.allPassed) {}
   return {
     id: 'design-critique',
killedBy: assessReadiness flips only the design-critique dimension when a story did not pass
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/readiness/report.ts:103:60
     };
   }
   if (!designCritique.allPassed) {
-    const notPassed = designCritique.stories.filter((s) => s.stopReason !== 'passed').length;
+    const notPassed = designCritique.stories.filter((s) => false).length;
     return {
       id: 'design-critique',
killedBy: assessReadiness flips only the design-critique dimension when a story did not pass
statusReason: expected '0 of 1 stories did not pass the epic-…' to be '1 of 1 stories did not pass the epic-…' // Object.is equality

[Killed] ArrowFunction
product/src/readiness/report.ts:103:53
     };
   }
   if (!designCritique.allPassed) {
-    const notPassed = designCritique.stories.filter((s) => s.stopReason !== 'passed').length;
+    const notPassed = designCritique.stories.filter(() => undefined).length;
     return {
       id: 'design-critique',
killedBy: assessReadiness flips only the design-critique dimension when a story did not pass
statusReason: expected '0 of 1 stories did not pass the epic-…' to be '1 of 1 stories did not pass the epic-…' // Object.is equality

[Survived] StringLiteral
product/src/readiness/report.ts:106:14
     const notPassed = designCritique.stories.filter((s) => s.stopReason !== 'passed').length;
     return {
       id: 'design-critique',
-      label: 'Design critique',
+      label: "",
       ready: false,
       reason: `${notPassed} of ${designCritique.stories.length} stories did not pass the epic-design critic`,

[Killed] BooleanLiteral
product/src/readiness/report.ts:114:12
   return {
     id: 'design-critique',
     label: 'Design critique',
-    ready: true,
+    ready: false,
     reason: 'all stories passed the epic-design critic',
   };
killedBy: planExport builds a plan whose epic/stories reference the decomposition and whose bundle has the expected paths, via the real gate
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
product/src/readiness/report.ts:119:41
   };
 }
 
-function isBlank(text: string): boolean {
-  return text.trim() === '';
-}
+function isBlank(text: string): boolean {}
 
 function assessAdrConformance(artifacts: ProposerArtifacts): ReadinessDimension {
killedBy: assessReadiness flips only the adr-conformance dimension when a draft has a blank context
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
product/src/readiness/report.ts:120:10
 }
 
 function isBlank(text: string): boolean {
-  return text.trim() === '';
+  return true;
 }
 
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] EqualityOperator
product/src/readiness/report.ts:120:10
 }
 
 function isBlank(text: string): boolean {
-  return text.trim() === '';
+  return text.trim() !== '';
 }
 
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] BooleanLiteral
product/src/readiness/report.ts:125:7
 
 function assessAdrConformance(artifacts: ProposerArtifacts): ReadinessDimension {
   const { adrConformance } = artifacts;
-  if (!adrConformance) {
+  if (adrConformance) {
     return {
       id: 'adr-conformance',
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] ConditionalExpression
product/src/readiness/report.ts:125:7
 
 function assessAdrConformance(artifacts: ProposerArtifacts): ReadinessDimension {
   const { adrConformance } = artifacts;
-  if (!adrConformance) {
+  if (true) {
     return {
       id: 'adr-conformance',
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] StringLiteral
product/src/readiness/report.ts:127:11
   const { adrConformance } = artifacts;
   if (!adrConformance) {
     return {
-      id: 'adr-conformance',
+      id: "",
       label: 'ADR conformance',
       ready: false,
killedBy: assessReadiness flips only the adr-conformance dimension when it is missing
statusReason: Cannot read properties of undefined (reading 'ready')

[Killed] BooleanLiteral
product/src/readiness/report.ts:129:14
     return {
       id: 'adr-conformance',
       label: 'ADR conformance',
-      ready: false,
+      ready: true,
       reason: 'ADR conformance evidence missing',
     };
killedBy: assessReadiness flips only the adr-conformance dimension when it is missing
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
product/src/readiness/report.ts:130:15
       id: 'adr-conformance',
       label: 'ADR conformance',
       ready: false,
-      reason: 'ADR conformance evidence missing',
+      reason: "",
     };
   }
killedBy: assessReadiness flips only the adr-conformance dimension when it is missing
statusReason: expected '' to be 'ADR conformance evidence missing' // Object.is equality

[Killed] MethodExpression
product/src/readiness/report.ts:133:25
       reason: 'ADR conformance evidence missing',
     };
   }
-  const nonConforming = adrConformance.drafts
-    .map((draft, i) => ({ draft, ordinal: i + 1 }))
-    .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
+  const nonConforming = adrConformance.drafts.map((draft, i) => ({
+  draft,
+  ordinal: i + 1
+}));
   if (nonConforming.length > 0) {
     const names = nonConforming.map(({ draft, ordinal }) => (isBlank(draft.title) ? `draft #${ordinal}` : draft.title));
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] ArrowFunction
product/src/readiness/report.ts:134:10
     };
   }
   const nonConforming = adrConformance.drafts
-    .map((draft, i) => ({ draft, ordinal: i + 1 }))
+    .map(() => undefined)
     .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
   if (nonConforming.length > 0) {
killedBy: assessReadiness scenario 1: missing epic architecture blocks the technical-design dimension
statusReason: Cannot destructure property 'draft' of 'undefined' as it is undefined.

[Killed] ArithmeticOperator
product/src/readiness/report.ts:134:43
     };
   }
   const nonConforming = adrConformance.drafts
-    .map((draft, i) => ({ draft, ordinal: i + 1 }))
+    .map((draft, i) => ({ draft, ordinal: i - 1 }))
     .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
   if (nonConforming.length > 0) {
killedBy: assessReadiness names the draft ordinal when a non-conforming draft has a blank title
statusReason: expected 'non-conforming ADR drafts: draft #-1' to contain 'draft #1'

[Killed] ArrowFunction
product/src/readiness/report.ts:135:13
   }
   const nonConforming = adrConformance.drafts
     .map((draft, i) => ({ draft, ordinal: i + 1 }))
-    .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
+    .filter(() => undefined);
   if (nonConforming.length > 0) {
     const names = nonConforming.map(({ draft, ordinal }) => (isBlank(draft.title) ? `draft #${ordinal}` : draft.title));
killedBy: assessReadiness flips only the adr-conformance dimension when a draft has a blank context
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
product/src/readiness/report.ts:135:28
   }
   const nonConforming = adrConformance.drafts
     .map((draft, i) => ({ draft, ordinal: i + 1 }))
-    .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
+    .filter(({ draft }) => (isBlank(draft.title) || isBlank(draft.context)) && isBlank(draft.decision));
   if (nonConforming.length > 0) {
     const names = nonConforming.map(({ draft, ordinal }) => (isBlank(draft.title) ? `draft #${ordinal}` : draft.title));
killedBy: assessReadiness flips only the adr-conformance dimension when a draft has a blank context
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
product/src/readiness/report.ts:136:7
   const nonConforming = adrConformance.drafts
     .map((draft, i) => ({ draft, ordinal: i + 1 }))
     .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
-  if (nonConforming.length > 0) {
+  if (nonConforming.length <= 0) {
     const names = nonConforming.map(({ draft, ordinal }) => (isBlank(draft.title) ? `draft #${ordinal}` : draft.title));
     return {
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] EqualityOperator
product/src/readiness/report.ts:136:7
   const nonConforming = adrConformance.drafts
     .map((draft, i) => ({ draft, ordinal: i + 1 }))
     .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
-  if (nonConforming.length > 0) {
+  if (nonConforming.length >= 0) {
     const names = nonConforming.map(({ draft, ordinal }) => (isBlank(draft.title) ? `draft #${ordinal}` : draft.title));
     return {
killedBy: assessReadiness scenario 2: a complete proposer set is ready without any writer-owned artifact
statusReason: expected 'not-ready' to be 'ready' // Object.is equality

[Killed] ArrowFunction
product/src/readiness/report.ts:137:37
     .map((draft, i) => ({ draft, ordinal: i + 1 }))
     .filter(({ draft }) => isBlank(draft.title) || isBlank(draft.context) || isBlank(draft.decision));
   if (nonConforming.length > 0) {
-    const names = nonConforming.map(({ draft, ordinal }) => (isBlank(draft.title) ? `draft #${ordinal}` : draft.title));
+    const names = nonConforming.map(() => undefined);
     return {
       id: 'adr-conformance',
killedBy: assessReadiness flips only the adr-conformance dimension when a draft has a blank context
statusReason: expected 'non-conforming ADR drafts: ' to contain 'Use a readiness module'
