[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:40:24
   onDegrade?: OnDegrade;
 }
 
-const nodeFs: FsLike = {
-  stat: (p) => stat(p),
-  readdir: (p, o) => readdir(p, o),
-  readFile: (p, e) => readFile(p, e),
-  realpath: (p) => realpath(p),
-};
+const nodeFs: FsLike = {};
 
 function classifyFsError(error: unknown): DegradeReason {
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ArrowFunction
packages/repo-context/src/fs.ts:41:9
 }
 
 const nodeFs: FsLike = {
-  stat: (p) => stat(p),
+  stat: () => undefined,
   readdir: (p, o) => readdir(p, o),
   readFile: (p, e) => readFile(p, e),
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: Cannot read properties of undefined (reading 'isDirectory')

[Killed] ArrowFunction
packages/repo-context/src/fs.ts:42:12
 
 const nodeFs: FsLike = {
   stat: (p) => stat(p),
-  readdir: (p, o) => readdir(p, o),
+  readdir: () => undefined,
   readFile: (p, e) => readFile(p, e),
   realpath: (p) => realpath(p),
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: dirents is not iterable

[Killed] ArrowFunction
packages/repo-context/src/fs.ts:43:13
 const nodeFs: FsLike = {
   stat: (p) => stat(p),
   readdir: (p, o) => readdir(p, o),
-  readFile: (p, e) => readFile(p, e),
+  readFile: () => undefined,
   realpath: (p) => realpath(p),
 };
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ArrowFunction
packages/repo-context/src/fs.ts:44:13
   stat: (p) => stat(p),
   readdir: (p, o) => readdir(p, o),
   readFile: (p, e) => readFile(p, e),
-  realpath: (p) => realpath(p),
+  realpath: () => undefined,
 };
 
killedBy: fs reader honors the RepoContextReader contract reads a nested file
statusReason: Cannot read properties of undefined (reading 'catch')

[Killed] BlockStatement
packages/repo-context/src/fs.ts:47:57
   realpath: (p) => realpath(p),
 };
 
-function classifyFsError(error: unknown): DegradeReason {
-  const code = (error as NodeJS.ErrnoException | undefined)?.code;
-  switch (code) {
-    case 'ENOENT':
-    case 'ENOTDIR':
-      return 'not-found';
-    case 'EACCES':
-    case 'EPERM':
-      return 'unauthorized';
-    case 'ELOOP':
-    case 'ENAMETOOLONG':
-      return 'invalid-path';
-    default:
-      return 'invalid-response';
-  }
-}
+function classifyFsError(error: unknown): DegradeReason {}
 
 export function createFsReader(options: FsReaderOptions): RepoContextReader {
killedBy: createFsReader degrade paths classifies an injected EACCES error as unauthorized
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Survived] OptionalChaining
packages/repo-context/src/fs.ts:48:16
 };
 
 function classifyFsError(error: unknown): DegradeReason {
-  const code = (error as NodeJS.ErrnoException | undefined)?.code;
+  const code = (error as NodeJS.ErrnoException | undefined).code;
   switch (code) {
     case 'ENOENT':

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:51:5
   const code = (error as NodeJS.ErrnoException | undefined)?.code;
   switch (code) {
     case 'ENOENT':
-    case 'ENOTDIR':
-      return 'not-found';
+    case 'ENOTDIR':
     case 'EACCES':
     case 'EPERM':
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal []

[Killed] StringLiteral
packages/repo-context/src/fs.ts:52:14
   switch (code) {
     case 'ENOENT':
     case 'ENOTDIR':
-      return 'not-found';
+      return "";
     case 'EACCES':
     case 'EPERM':
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal []

[Killed] StringLiteral
packages/repo-context/src/fs.ts:53:10
     case 'ENOENT':
     case 'ENOTDIR':
       return 'not-found';
-    case 'EACCES':
+    case "":
     case 'EPERM':
       return 'unauthorized';
killedBy: createFsReader degrade paths classifies an injected EACCES error as unauthorized
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:54:5
     case 'ENOTDIR':
       return 'not-found';
     case 'EACCES':
-    case 'EPERM':
-      return 'unauthorized';
+    case 'EPERM':
     case 'ELOOP':
     case 'ENAMETOOLONG':
killedBy: createFsReader degrade paths classifies an injected EACCES error as unauthorized
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:57:5
     case 'EPERM':
       return 'unauthorized';
     case 'ELOOP':
-    case 'ENAMETOOLONG':
-      return 'invalid-path';
+    case 'ENAMETOOLONG':
     default:
       return 'invalid-response';
killedBy: createFsReader degrade paths classifies an injected ELOOP error as invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:59:5
     case 'ELOOP':
     case 'ENAMETOOLONG':
       return 'invalid-path';
-    default:
-      return 'invalid-response';
+    default:
   }
 }
killedBy: createFsReader degrade paths classifies an injected bare Error as invalid-response
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:60:14
     case 'ENAMETOOLONG':
       return 'invalid-path';
     default:
-      return 'invalid-response';
+      return "";
   }
 }
killedBy: createFsReader degrade paths classifies an injected bare Error as invalid-response
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] LogicalOperator
packages/repo-context/src/fs.ts:66:14
 
 export function createFsReader(options: FsReaderOptions): RepoContextReader {
   const { root, onDegrade } = options;
-  const fs = options.fs ?? nodeFs;
+  const fs = options.fs && nodeFs;
   const maxFileBytes = options.maxFileBytes ?? DEFAULT_MAX_FILE_BYTES;
 
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] LogicalOperator
packages/repo-context/src/fs.ts:67:24
 export function createFsReader(options: FsReaderOptions): RepoContextReader {
   const { root, onDegrade } = options;
   const fs = options.fs ?? nodeFs;
-  const maxFileBytes = options.maxFileBytes ?? DEFAULT_MAX_FILE_BYTES;
+  const maxFileBytes = options.maxFileBytes && DEFAULT_MAX_FILE_BYTES;
 
   let rootRealPromise: Promise<string | undefined> | undefined;
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected { path: 'big.md', …(2) } to be undefined

[Killed] BlockStatement
packages/repo-context/src/fs.ts:70:52
   const maxFileBytes = options.maxFileBytes ?? DEFAULT_MAX_FILE_BYTES;
 
   let rootRealPromise: Promise<string | undefined> | undefined;
-  function rootReal(): Promise<string | undefined> {
-    rootRealPromise ??= fs.realpath(root).catch(() => undefined);
-    return rootRealPromise;
-  }
+  function rootReal(): Promise<string | undefined> {}
 
   function emit(event: DegradeEvent): void {
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] AssignmentOperator
packages/repo-context/src/fs.ts:71:5
 
   let rootRealPromise: Promise<string | undefined> | undefined;
   function rootReal(): Promise<string | undefined> {
-    rootRealPromise ??= fs.realpath(root).catch(() => undefined);
+    rootRealPromise &&= fs.realpath(root).catch(() => undefined);
     return rootRealPromise;
   }
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:75:44
     return rootRealPromise;
   }
 
-  function emit(event: DegradeEvent): void {
-    if (!onDegrade) {
-      return;
-    }
-    try {
-      onDegrade(event);
-    } catch {
-      // Never let a throwing observer break the "never throws" contract.
-    }
-  }
+  function emit(event: DegradeEvent): void {}
 
   type ResolveResult = { ok: true; abs: string } | { ok: false; reason: DegradeReason };
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: expected [] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:76:9
   }
 
   function emit(event: DegradeEvent): void {
-    if (!onDegrade) {
+    if (true) {
       return;
     }
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: expected [] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:76:9
   }
 
   function emit(event: DegradeEvent): void {
-    if (!onDegrade) {
+    if (onDegrade) {
       return;
     }
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: expected [] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:79:9
     if (!onDegrade) {
       return;
     }
-    try {
-      onDegrade(event);
-    } catch {
+    try {} catch {
       // Never let a throwing observer break the "never throws" contract.
     }
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: expected [] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] CallExpression
packages/repo-context/src/fs.ts:80:7
       return;
     }
     try {
-      onDegrade(event);
+      ;
     } catch {
       // Never let a throwing observer break the "never throws" contract.
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: expected [] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:88:76
 
   type ResolveResult = { ok: true; abs: string } | { ok: false; reason: DegradeReason };
 
-  async function resolveWithin(normalized: string): Promise<ResolveResult> {
-    const abs = normalized === '' ? root : join(root, normalized);
-    let real: string;
-    try {
-      real = await fs.realpath(abs);
-    } catch (error) {
-      return { ok: false, reason: classifyFsError(error) };
-    }
-    const base = await rootReal();
-    if (base === undefined) {
-      return { ok: false, reason: 'not-found' };
-    }
-    if (real !== base && !real.startsWith(base + sep)) {
-      return { ok: false, reason: 'invalid-path' };
-    }
-    return { ok: true, abs: real };
-  }
+  async function resolveWithin(normalized: string): Promise<ResolveResult> {}
 
   return {
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] EqualityOperator
packages/repo-context/src/fs.ts:89:17
   type ResolveResult = { ok: true; abs: string } | { ok: false; reason: DegradeReason };
 
   async function resolveWithin(normalized: string): Promise<ResolveResult> {
-    const abs = normalized === '' ? root : join(root, normalized);
+    const abs = normalized !== '' ? root : join(root, normalized);
     let real: string;
     try {
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:89:17
   type ResolveResult = { ok: true; abs: string } | { ok: false; reason: DegradeReason };
 
   async function resolveWithin(normalized: string): Promise<ResolveResult> {
-    const abs = normalized === '' ? root : join(root, normalized);
+    const abs = true ? root : join(root, normalized);
     let real: string;
     try {
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:91:9
   async function resolveWithin(normalized: string): Promise<ResolveResult> {
     const abs = normalized === '' ? root : join(root, normalized);
     let real: string;
-    try {
-      real = await fs.realpath(abs);
-    } catch (error) {
+    try {} catch (error) {
       return { ok: false, reason: classifyFsError(error) };
     }
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BlockStatement
packages/repo-context/src/fs.ts:93:21
     let real: string;
     try {
       real = await fs.realpath(abs);
-    } catch (error) {
-      return { ok: false, reason: classifyFsError(error) };
-    }
+    } catch (error) {}
     const base = await rootReal();
     if (base === undefined) {
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:94:20
     try {
       real = await fs.realpath(abs);
     } catch (error) {
-      return { ok: false, reason: classifyFsError(error) };
+      return { ok: true, reason: classifyFsError(error) };
     }
     const base = await rootReal();
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:94:14
     try {
       real = await fs.realpath(abs);
     } catch (error) {
-      return { ok: false, reason: classifyFsError(error) };
+      return {};
     }
     const base = await rootReal();
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal []

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:97:9
       return { ok: false, reason: classifyFsError(error) };
     }
     const base = await rootReal();
-    if (base === undefined) {
+    if (true) {
       return { ok: false, reason: 'not-found' };
     }
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:97:9
       return { ok: false, reason: classifyFsError(error) };
     }
     const base = await rootReal();
-    if (base === undefined) {
+    if (false) {
       return { ok: false, reason: 'not-found' };
     }
killedBy: createFsReader degrade paths degrades to not-found when the root itself cannot be realpath-ed
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal []

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:98:20
     }
     const base = await rootReal();
     if (base === undefined) {
-      return { ok: false, reason: 'not-found' };
+      return { ok: true, reason: 'not-found' };
     }
     if (real !== base && !real.startsWith(base + sep)) {
killedBy: createFsReader degrade paths degrades to not-found when the root itself cannot be realpath-ed
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:98:14
     }
     const base = await rootReal();
     if (base === undefined) {
-      return { ok: false, reason: 'not-found' };
+      return {};
     }
     if (real !== base && !real.startsWith(base + sep)) {
killedBy: createFsReader degrade paths degrades to not-found when the root itself cannot be realpath-ed
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal []

[Killed] MethodExpression
packages/repo-context/src/fs.ts:100:27
     if (base === undefined) {
       return { ok: false, reason: 'not-found' };
     }
-    if (real !== base && !real.startsWith(base + sep)) {
+    if (real !== base && !real.endsWith(base + sep)) {
       return { ok: false, reason: 'invalid-path' };
     }
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:100:56
     if (base === undefined) {
       return { ok: false, reason: 'not-found' };
     }
-    if (real !== base && !real.startsWith(base + sep)) {
-      return { ok: false, reason: 'invalid-path' };
-    }
+    if (real !== base && !real.startsWith(base + sep)) {}
     return { ok: true, abs: real };
   }
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected { path: 'escape.md', …(2) } to be undefined

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:101:20
       return { ok: false, reason: 'not-found' };
     }
     if (real !== base && !real.startsWith(base + sep)) {
-      return { ok: false, reason: 'invalid-path' };
+      return { ok: true, reason: 'invalid-path' };
     }
     return { ok: true, abs: real };
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:101:35
       return { ok: false, reason: 'not-found' };
     }
     if (real !== base && !real.startsWith(base + sep)) {
-      return { ok: false, reason: 'invalid-path' };
+      return { ok: false, reason: "" };
     }
     return { ok: true, abs: real };
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:103:18
     if (real !== base && !real.startsWith(base + sep)) {
       return { ok: false, reason: 'invalid-path' };
     }
-    return { ok: true, abs: real };
+    return { ok: false, abs: real };
   }
 
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:109:11
   return {
     async readFile(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
-      if (normalized === undefined) {
+      if (true) {
         emit({ operation: 'readFile', path: rawPath, reason: 'invalid-path' });
         return undefined;
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] EqualityOperator
packages/repo-context/src/fs.ts:109:11
   return {
     async readFile(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
-      if (normalized === undefined) {
+      if (normalized !== undefined) {
         emit({ operation: 'readFile', path: rawPath, reason: 'invalid-path' });
         return undefined;
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: The "path" argument must be of type string. Received undefined

[Killed] StringLiteral
packages/repo-context/src/fs.ts:110:27
     async readFile(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
       if (normalized === undefined) {
-        emit({ operation: 'readFile', path: rawPath, reason: 'invalid-path' });
+        emit({ operation: "", path: rawPath, reason: 'invalid-path' });
         return undefined;
       }
killedBy: createFsReader degrade paths readFile of a path escaping the root via ../ degrades to invalid-path
statusReason: expected [ { operation: '', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:115:11
       }
 
       const resolved = await resolveWithin(normalized);
-      if (!resolved.ok) {
+      if (true) {
         emit({ operation: 'readFile', path: normalized, reason: resolved.reason });
         return undefined;
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:115:25
       }
 
       const resolved = await resolveWithin(normalized);
-      if (!resolved.ok) {
-        emit({ operation: 'readFile', path: normalized, reason: resolved.reason });
-        return undefined;
-      }
+      if (!resolved.ok) {}
 
       let fileStat: FsStatLike;
killedBy: createFsReader degrade paths a symlink inside the root pointing outside it degrades to invalid-path
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:121:11
       }
 
       let fileStat: FsStatLike;
-      try {
-        fileStat = await fs.stat(resolved.abs);
-      } catch (error) {
+      try {} catch (error) {
         emit({ operation: 'readFile', path: normalized, reason: classifyFsError(error) });
         return undefined;
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: Cannot read properties of undefined (reading 'isDirectory')

[Killed] BlockStatement
packages/repo-context/src/fs.ts:123:23
       let fileStat: FsStatLike;
       try {
         fileStat = await fs.stat(resolved.abs);
-      } catch (error) {
-        emit({ operation: 'readFile', path: normalized, reason: classifyFsError(error) });
-        return undefined;
-      }
+      } catch (error) {}
 
       if (fileStat.isDirectory()) {
killedBy: createFsReader degrade paths classifies an injected EACCES error as unauthorized
statusReason: Cannot read properties of undefined (reading 'isDirectory')

[Killed] StringLiteral
packages/repo-context/src/fs.ts:124:27
       try {
         fileStat = await fs.stat(resolved.abs);
       } catch (error) {
-        emit({ operation: 'readFile', path: normalized, reason: classifyFsError(error) });
+        emit({ operation: "", path: normalized, reason: classifyFsError(error) });
         return undefined;
       }
killedBy: createFsReader degrade paths classifies an injected EACCES error as unauthorized
statusReason: expected [ { operation: '', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:128:11
         return undefined;
       }
 
-      if (fileStat.isDirectory()) {
+      if (true) {
         emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
         return undefined;
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Survived] BlockStatement
packages/repo-context/src/fs.ts:128:35
         return undefined;
       }
 
-      if (fileStat.isDirectory()) {
-        emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
-        return undefined;
-      }
+      if (fileStat.isDirectory()) {}
       if (fileStat.size > maxFileBytes) {
         emit({ operation: 'readFile', path: normalized, reason: 'too-large' });

[Survived] StringLiteral
packages/repo-context/src/fs.ts:129:27
       }
 
       if (fileStat.isDirectory()) {
-        emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
+        emit({ operation: "", path: normalized, reason: 'wrong-type' });
         return undefined;
       }

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:132:11
         emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
         return undefined;
       }
-      if (fileStat.size > maxFileBytes) {
+      if (false) {
         emit({ operation: 'readFile', path: normalized, reason: 'too-large' });
         return undefined;
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected { path: 'big.md', …(2) } to be undefined

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:132:11
         emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
         return undefined;
       }
-      if (fileStat.size > maxFileBytes) {
+      if (true) {
         emit({ operation: 'readFile', path: normalized, reason: 'too-large' });
         return undefined;
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:133:65
         return undefined;
       }
       if (fileStat.size > maxFileBytes) {
-        emit({ operation: 'readFile', path: normalized, reason: 'too-large' });
+        emit({ operation: 'readFile', path: normalized, reason: "" });
         return undefined;
       }
killedBy: createFsReader degrade paths a file larger than maxFileBytes degrades to too-large
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:136:11
         emit({ operation: 'readFile', path: normalized, reason: 'too-large' });
         return undefined;
       }
-      if (!fileStat.isFile()) {
+      if (false) {
         emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
         return undefined;
killedBy: createFsReader degrade paths readFile of a special file (neither directory nor regular file) degrades to wrong-type
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:136:11
         emit({ operation: 'readFile', path: normalized, reason: 'too-large' });
         return undefined;
       }
-      if (!fileStat.isFile()) {
+      if (fileStat.isFile()) {
         emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
         return undefined;
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: expected [ { operation: 'readFile', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:137:27
         return undefined;
       }
       if (!fileStat.isFile()) {
-        emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
+        emit({ operation: "", path: normalized, reason: 'wrong-type' });
         return undefined;
       }
killedBy: createFsReader degrade paths readFile of a special file (neither directory nor regular file) degrades to wrong-type
statusReason: expected [ { operation: '', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:137:14
         return undefined;
       }
       if (!fileStat.isFile()) {
-        emit({ operation: 'readFile', path: normalized, reason: 'wrong-type' });
+        emit({});
         return undefined;
       }
killedBy: createFsReader degrade paths readFile of a special file (neither directory nor regular file) degrades to wrong-type
statusReason: expected [ {} ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:142:11
       }
 
       let text: string;
-      try {
-        text = await fs.readFile(resolved.abs, 'utf8');
-      } catch (error) {
+      try {} catch (error) {
         emit({ operation: 'readFile', path: normalized, reason: classifyFsError(error) });
         return undefined;
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: Cannot read properties of undefined (reading 'includes')
