[Killed] BlockStatement
packages/repo-context/src/fs.ts:144:23
       let text: string;
       try {
         text = await fs.readFile(resolved.abs, 'utf8');
-      } catch (error) {
-        emit({ operation: 'readFile', path: normalized, reason: classifyFsError(error) });
-        return undefined;
-      }
+      } catch (error) {}
 
       if (text.includes('\u0000')) {
killedBy: createFsReader degrade paths readFile degrades when fs.readFile itself throws
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] BlockStatement
packages/repo-context/src/fs.ts:149:36
         return undefined;
       }
 
-      if (text.includes('\u0000')) {
-        emit({ operation: 'readFile', path: normalized, reason: 'unsupported-content' });
-        return undefined;
-      }
+      if (text.includes('\u0000')) {}
 
       return { path: normalized, text, size: fileStat.size };
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: expected { path: 'binary.md', …(2) } to be undefined

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:149:11
         return undefined;
       }
 
-      if (text.includes('\u0000')) {
+      if (false) {
         emit({ operation: 'readFile', path: normalized, reason: 'unsupported-content' });
         return undefined;
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: expected { path: 'binary.md', …(2) } to be undefined

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:150:14
       }
 
       if (text.includes('\u0000')) {
-        emit({ operation: 'readFile', path: normalized, reason: 'unsupported-content' });
+        emit({});
         return undefined;
       }
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: expected [ {} ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:150:27
       }
 
       if (text.includes('\u0000')) {
-        emit({ operation: 'readFile', path: normalized, reason: 'unsupported-content' });
+        emit({ operation: "", path: normalized, reason: 'unsupported-content' });
         return undefined;
       }
killedBy: createFsReader degrade paths a file containing a NUL byte degrades to unsupported-content
statusReason: expected [ { operation: '', …(2) } ] to deeply equal [ { operation: 'readFile', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:159:37
 
     async readDir(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
-      if (normalized === undefined) {
-        emit({ operation: 'readDir', path: rawPath, reason: 'invalid-path' });
-        return EMPTY_DIR;
-      }
+      if (normalized === undefined) {}
 
       const resolved = await resolveWithin(normalized);
killedBy: createFsReader degrade paths readDir of a path escaping the root via ../ degrades to invalid-path
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:165:11
       }
 
       const resolved = await resolveWithin(normalized);
-      if (!resolved.ok) {
+      if (resolved.ok) {
         emit({ operation: 'readDir', path: normalized, reason: resolved.reason });
         return EMPTY_DIR;
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:165:25
       }
 
       const resolved = await resolveWithin(normalized);
-      if (!resolved.ok) {
-        emit({ operation: 'readDir', path: normalized, reason: resolved.reason });
-        return EMPTY_DIR;
-      }
+      if (!resolved.ok) {}
 
       let dirStat: FsStatLike;
killedBy: createFsReader degrade paths readDir of a missing directory degrades to not-found and returns empty
statusReason: expected [ { operation: 'readDir', …(2) } ] to deeply equal [ { operation: 'readDir', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:166:27
 
       const resolved = await resolveWithin(normalized);
       if (!resolved.ok) {
-        emit({ operation: 'readDir', path: normalized, reason: resolved.reason });
+        emit({ operation: "", path: normalized, reason: resolved.reason });
         return EMPTY_DIR;
       }
killedBy: createFsReader degrade paths readDir of a missing directory degrades to not-found and returns empty
statusReason: expected [ { operation: '', …(2) } ] to deeply equal [ { operation: 'readDir', …(2) } ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:171:11
       }
 
       let dirStat: FsStatLike;
-      try {
-        dirStat = await fs.stat(resolved.abs);
-      } catch (error) {
+      try {} catch (error) {
         emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
         return EMPTY_DIR;
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: Cannot read properties of undefined (reading 'isDirectory')

[Killed] BlockStatement
packages/repo-context/src/fs.ts:173:23
       let dirStat: FsStatLike;
       try {
         dirStat = await fs.stat(resolved.abs);
-      } catch (error) {
-        emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
-        return EMPTY_DIR;
-      }
+      } catch (error) {}
 
       if (!dirStat.isDirectory()) {
killedBy: createFsReader degrade paths readDir degrades when fs.stat throws after resolving
statusReason: Cannot read properties of undefined (reading 'isDirectory')

[Killed] StringLiteral
packages/repo-context/src/fs.ts:174:27
       try {
         dirStat = await fs.stat(resolved.abs);
       } catch (error) {
-        emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
+        emit({ operation: "", path: normalized, reason: classifyFsError(error) });
         return EMPTY_DIR;
       }
killedBy: createFsReader degrade paths readDir degrades when fs.stat throws after resolving
statusReason: expected [ Array(1) ] to deeply equal [ { operation: 'readDir', …(2) } ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:178:11
         return EMPTY_DIR;
       }
 
-      if (!dirStat.isDirectory()) {
+      if (true) {
         emit({ operation: 'readDir', path: normalized, reason: 'wrong-type' });
         return EMPTY_DIR;
killedBy: fs reader honors the RepoContextReader contract lists the root
statusReason: expected [] to deeply equal [ { name: 'README.md', …(2) }, …(2) ]

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:178:11
         return EMPTY_DIR;
       }
 
-      if (!dirStat.isDirectory()) {
+      if (dirStat.isDirectory()) {
         emit({ operation: 'readDir', path: normalized, reason: 'wrong-type' });
         return EMPTY_DIR;
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Survived] ObjectLiteral
packages/repo-context/src/fs.ts:179:14
       }
 
       if (!dirStat.isDirectory()) {
-        emit({ operation: 'readDir', path: normalized, reason: 'wrong-type' });
+        emit({});
         return EMPTY_DIR;
       }

[Survived] StringLiteral
packages/repo-context/src/fs.ts:179:27
       }
 
       if (!dirStat.isDirectory()) {
-        emit({ operation: 'readDir', path: normalized, reason: 'wrong-type' });
+        emit({ operation: "", path: normalized, reason: 'wrong-type' });
         return EMPTY_DIR;
       }

[Killed] BlockStatement
packages/repo-context/src/fs.ts:184:11
       }
 
       let dirents: readonly FsDirent[];
-      try {
-        dirents = await fs.readdir(resolved.abs, { withFileTypes: true });
-      } catch (error) {
+      try {} catch (error) {
         emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
         return EMPTY_DIR;
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: dirents is not iterable

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:185:67
 
       let dirents: readonly FsDirent[];
       try {
-        dirents = await fs.readdir(resolved.abs, { withFileTypes: true });
+        dirents = await fs.readdir(resolved.abs, { withFileTypes: false });
       } catch (error) {
         emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
killedBy: fs reader honors the RepoContextReader contract lists the root
statusReason: dirent.isDirectory is not a function

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:185:50
 
       let dirents: readonly FsDirent[];
       try {
-        dirents = await fs.readdir(resolved.abs, { withFileTypes: true });
+        dirents = await fs.readdir(resolved.abs, {});
       } catch (error) {
         emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: dirent.isDirectory is not a function

[Killed] BlockStatement
packages/repo-context/src/fs.ts:186:23
       let dirents: readonly FsDirent[];
       try {
         dirents = await fs.readdir(resolved.abs, { withFileTypes: true });
-      } catch (error) {
-        emit({ operation: 'readDir', path: normalized, reason: classifyFsError(error) });
-        return EMPTY_DIR;
-      }
+      } catch (error) {}
 
       const entries: RepoDirEntry[] = [];
killedBy: createFsReader degrade paths readDir degrades when fs.readdir itself throws
statusReason: dirents is not iterable

[Killed] ArrayDeclaration
packages/repo-context/src/fs.ts:191:39
         return EMPTY_DIR;
       }
 
-      const entries: RepoDirEntry[] = [];
+      const entries: RepoDirEntry[] = ["Stryker was here"];
       for (const dirent of dirents) {
         const childPath = joinRepoPath(normalized, dirent.name);
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [ 'Stryker was here', …(2) ] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:192:37
       }
 
       const entries: RepoDirEntry[] = [];
-      for (const dirent of dirents) {
-        const childPath = joinRepoPath(normalized, dirent.name);
-        if (dirent.isDirectory()) {
-          entries.push({ name: dirent.name, path: childPath, type: 'dir' });
-          continue;
-        }
-        if (dirent.isFile()) {
-          entries.push({ name: dirent.name, path: childPath, type: 'file' });
-          continue;
-        }
-        // Symlink or other special file: resolve via stat, skip on failure.
-        try {
-          const childStat = await fs.stat(join(resolved.abs, dirent.name));
-          entries.push({ name: dirent.name, path: childPath, type: childStat.isDirectory() ? 'dir' : 'file' });
-        } catch {
-          continue;
-        }
-      }
+      for (const dirent of dirents) {}
 
       return entries.sort((a, b) => (a.path < b.path ? -1 : a.path > b.path ? 1 : 0));
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:194:13
       const entries: RepoDirEntry[] = [];
       for (const dirent of dirents) {
         const childPath = joinRepoPath(normalized, dirent.name);
-        if (dirent.isDirectory()) {
+        if (true) {
           entries.push({ name: dirent.name, path: childPath, type: 'dir' });
           continue;
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [ { name: 'link.md', …(2) }, …(1) ] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Survived] ConditionalExpression
packages/repo-context/src/fs.ts:194:13
       const entries: RepoDirEntry[] = [];
       for (const dirent of dirents) {
         const childPath = joinRepoPath(normalized, dirent.name);
-        if (dirent.isDirectory()) {
+        if (false) {
           entries.push({ name: dirent.name, path: childPath, type: 'dir' });
           continue;

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:195:24
       for (const dirent of dirents) {
         const childPath = joinRepoPath(normalized, dirent.name);
         if (dirent.isDirectory()) {
-          entries.push({ name: dirent.name, path: childPath, type: 'dir' });
+          entries.push({});
           continue;
         }
killedBy: fs reader honors the RepoContextReader contract lists the root
statusReason: expected [ { name: 'README.md', …(2) }, {}, {} ] to deeply equal [ { name: 'README.md', …(2) }, …(2) ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:198:13
           entries.push({ name: dirent.name, path: childPath, type: 'dir' });
           continue;
         }
-        if (dirent.isFile()) {
+        if (true) {
           entries.push({ name: dirent.name, path: childPath, type: 'file' });
           continue;
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a directory lists it as type dir
statusReason: expected [ { name: 'link-dir', …(2) } ] to deeply equal [ { name: 'link-dir', …(2) } ]

[Survived] ConditionalExpression
packages/repo-context/src/fs.ts:198:13
           entries.push({ name: dirent.name, path: childPath, type: 'dir' });
           continue;
         }
-        if (dirent.isFile()) {
+        if (false) {
           entries.push({ name: dirent.name, path: childPath, type: 'file' });
           continue;

[Killed] StringLiteral
packages/repo-context/src/fs.ts:199:68
           continue;
         }
         if (dirent.isFile()) {
-          entries.push({ name: dirent.name, path: childPath, type: 'file' });
+          entries.push({ name: dirent.name, path: childPath, type: "" });
           continue;
         }
killedBy: fs reader honors the RepoContextReader contract lists the root
statusReason: expected [ { name: 'README.md', …(2) }, …(2) ] to deeply equal [ { name: 'README.md', …(2) }, …(2) ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:203:13
           continue;
         }
         // Symlink or other special file: resolve via stat, skip on failure.
-        try {
-          const childStat = await fs.stat(join(resolved.abs, dirent.name));
-          entries.push({ name: dirent.name, path: childPath, type: childStat.isDirectory() ? 'dir' : 'file' });
-        } catch {
+        try {} catch {
           continue;
         }
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [ { name: 'real.md', …(2) } ] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Survived] BlockStatement
packages/repo-context/src/fs.ts:206:17
         try {
           const childStat = await fs.stat(join(resolved.abs, dirent.name));
           entries.push({ name: dirent.name, path: childPath, type: childStat.isDirectory() ? 'dir' : 'file' });
-        } catch {
-          continue;
-        }
+        } catch {}
       }
 

[Killed] EqualityOperator
packages/repo-context/src/fs.ts:211:38
         }
       }
 
-      return entries.sort((a, b) => (a.path < b.path ? -1 : a.path > b.path ? 1 : 0));
+      return entries.sort((a, b) => (a.path >= b.path ? -1 : a.path > b.path ? 1 : 0));
     },
 
killedBy: fs reader honors the RepoContextReader contract lists the root
statusReason: expected [ …(3) ] to deeply equal [ { name: 'README.md', …(2) }, …(2) ]

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:211:38
         }
       }
 
-      return entries.sort((a, b) => (a.path < b.path ? -1 : a.path > b.path ? 1 : 0));
+      return entries.sort((a, b) => (true ? -1 : a.path > b.path ? 1 : 0));
     },
 
killedBy: createFsReader degrade paths readDir on a directory containing a symlink to a file lists it as type file
statusReason: expected [ { name: 'real.md', …(2) }, …(1) ] to deeply equal [ { name: 'link.md', …(2) }, …(1) ]

[Killed] BlockStatement
packages/repo-context/src/fs.ts:214:27
       return entries.sort((a, b) => (a.path < b.path ? -1 : a.path > b.path ? 1 : 0));
     },
 
-    async exists(rawPath) {
-      const normalized = normalizeRepoPath(rawPath);
-      if (normalized === undefined) {
-        emit({ operation: 'exists', path: rawPath, reason: 'invalid-path' });
-        return false;
-      }
-
-      const resolved = await resolveWithin(normalized);
-      if (!resolved.ok) {
-        if (resolved.reason === 'not-found') {
-          return false;
-        }
-        emit({ operation: 'exists', path: normalized, reason: resolved.reason });
-        return false;
-      }
-
-      return true;
-    },
+    async exists(rawPath) {},
   };
 }
killedBy: fs reader honors the RepoContextReader contract exists is true for a file
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:216:11
 
     async exists(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
-      if (normalized === undefined) {
+      if (false) {
         emit({ operation: 'exists', path: rawPath, reason: 'invalid-path' });
         return false;
killedBy: createFsReader degrade paths exists on a path escaping the root via ../ degrades to invalid-path
statusReason: The "path" argument must be of type string. Received undefined

[Killed] ObjectLiteral
packages/repo-context/src/fs.ts:217:14
     async exists(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
       if (normalized === undefined) {
-        emit({ operation: 'exists', path: rawPath, reason: 'invalid-path' });
+        emit({});
         return false;
       }
killedBy: createFsReader degrade paths exists on a path escaping the root via ../ degrades to invalid-path
statusReason: expected [ {} ] to deeply equal [ { operation: 'exists', …(2) } ]

[Killed] StringLiteral
packages/repo-context/src/fs.ts:217:60
     async exists(rawPath) {
       const normalized = normalizeRepoPath(rawPath);
       if (normalized === undefined) {
-        emit({ operation: 'exists', path: rawPath, reason: 'invalid-path' });
+        emit({ operation: 'exists', path: rawPath, reason: "" });
         return false;
       }
killedBy: createFsReader degrade paths exists on a path escaping the root via ../ degrades to invalid-path
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal [ { operation: 'exists', …(2) } ]

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:218:16
       const normalized = normalizeRepoPath(rawPath);
       if (normalized === undefined) {
         emit({ operation: 'exists', path: rawPath, reason: 'invalid-path' });
-        return false;
+        return true;
       }
 
killedBy: createFsReader degrade paths exists on a path escaping the root via ../ degrades to invalid-path
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:222:11
       }
 
       const resolved = await resolveWithin(normalized);
-      if (!resolved.ok) {
+      if (false) {
         if (resolved.reason === 'not-found') {
           return false;
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
packages/repo-context/src/fs.ts:223:13
 
       const resolved = await resolveWithin(normalized);
       if (!resolved.ok) {
-        if (resolved.reason === 'not-found') {
+        if (resolved.reason !== 'not-found') {
           return false;
         }
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected [ { operation: 'exists', …(2) } ] to deeply equal []

[Killed] ConditionalExpression
packages/repo-context/src/fs.ts:223:13
 
       const resolved = await resolveWithin(normalized);
       if (!resolved.ok) {
-        if (resolved.reason === 'not-found') {
+        if (true) {
           return false;
         }
killedBy: createFsReader degrade paths exists on an EACCES path is false with a degrade event
statusReason: expected [] to deeply equal [ { operation: 'exists', …(2) } ]

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:224:18
       const resolved = await resolveWithin(normalized);
       if (!resolved.ok) {
         if (resolved.reason === 'not-found') {
-          return false;
+          return true;
         }
         emit({ operation: 'exists', path: normalized, reason: resolved.reason });
killedBy: createFsReader degrade paths exists on a missing path is false with no degrade event
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
packages/repo-context/src/fs.ts:227:16
           return false;
         }
         emit({ operation: 'exists', path: normalized, reason: resolved.reason });
-        return false;
+        return true;
       }
 
killedBy: createFsReader degrade paths exists on an EACCES path is false with a degrade event
statusReason: expected true to be false // Object.is equality
