[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:180:9
   const found: string[] = [];
   for (const entry of deps.readdirSync(dir)) {
     const full = join(dir, entry.name);
-    if (entry.isDirectory()) {
+    if (false) {
       found.push(...findManifestPaths(full, deps));
     } else if (entry.name === 'manifest.json') {
killedBy: collectBaselineTrials recursively finds manifests, sorts by id, and returns [] for an empty dir
statusReason: expected [] to deeply equal [ 'a-problem/nested', …(2) ]

[Killed] CallExpression
packages/scbench-adapter/src/baseline.ts:181:7
   for (const entry of deps.readdirSync(dir)) {
     const full = join(dir, entry.name);
     if (entry.isDirectory()) {
-      found.push(...findManifestPaths(full, deps));
+      ;
     } else if (entry.name === 'manifest.json') {
       found.push(full);
killedBy: collectBaselineTrials recursively finds manifests, sorts by id, and returns [] for an empty dir
statusReason: expected [] to deeply equal [ 'a-problem/nested', …(2) ]

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:182:16
     const full = join(dir, entry.name);
     if (entry.isDirectory()) {
       found.push(...findManifestPaths(full, deps));
-    } else if (entry.name === 'manifest.json') {
+    } else if (false) {
       found.push(full);
     }
killedBy: collectBaselineTrials recursively finds manifests, sorts by id, and returns [] for an empty dir
statusReason: expected [] to deeply equal [ 'a-problem/nested', …(2) ]

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:182:16
     const full = join(dir, entry.name);
     if (entry.isDirectory()) {
       found.push(...findManifestPaths(full, deps));
-    } else if (entry.name === 'manifest.json') {
+    } else if (entry.name !== 'manifest.json') {
       found.push(full);
     }
killedBy: collectBaselineTrials recursively finds manifests, sorts by id, and returns [] for an empty dir
statusReason: could not parse /runs/notes.txt: ENOENT: /runs/notes.txt

[Killed] CallExpression
packages/scbench-adapter/src/baseline.ts:183:7
     if (entry.isDirectory()) {
       found.push(...findManifestPaths(full, deps));
     } else if (entry.name === 'manifest.json') {
-      found.push(full);
+      ;
     }
   }
killedBy: collectBaselineTrials recursively finds manifests, sorts by id, and returns [] for an empty dir
statusReason: expected [] to deeply equal [ 'a-problem/nested', …(2) ]

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:189:67
   return found;
 }
 
-function toTrialId(runsDir: string, manifestPath: string): string {
-  return relative(runsDir, dirname(manifestPath)).split(sep).join('/');
-}
+function toTrialId(runsDir: string, manifestPath: string): string {}
 
 function isPlainObject(value: unknown): value is Record<string, unknown> {
killedBy: collectBaselineTrials recursively finds manifests, sorts by id, and returns [] for an empty dir
statusReason: expected [ undefined, undefined, undefined ] to deeply equal [ 'a-problem/nested', …(2) ]

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:193:74
   return relative(runsDir, dirname(manifestPath)).split(sep).join('/');
 }
 
-function isPlainObject(value: unknown): value is Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
-}
+function isPlainObject(value: unknown): value is Record<string, unknown> {}
 
 function isRecordOfNumbers(value: unknown): value is Record<string, number> {
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: must be a JSON object

[Killed] LogicalOperator
packages/scbench-adapter/src/baseline.ts:194:10
 }
 
 function isPlainObject(value: unknown): value is Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value === 'object' && value !== null || !Array.isArray(value);
 }
 
killedBy: collectBaselineTrials rejects a valid-JSON evaluation.json that is not an object
statusReason: expected [Function] to throw error matching /evaluation evidence at .*must be a JS…/ but got 'invalid evaluation evidence at /runs/…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:194:10
 }
 
 function isPlainObject(value: unknown): value is Record<string, unknown> {
-  return typeof value === 'object' && value !== null && !Array.isArray(value);
+  return typeof value !== 'object' && value !== null && !Array.isArray(value);
 }
 
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: must be a JSON object

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:197:77
   return typeof value === 'object' && value !== null && !Array.isArray(value);
 }
 
-function isRecordOfNumbers(value: unknown): value is Record<string, number> {
-  return isPlainObject(value) && Object.values(value).every((v) => typeof v === 'number');
-}
+function isRecordOfNumbers(value: unknown): value is Record<string, number> {}
 
 /** Parse + structurally validate a single trial's native evaluation.json.
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "pass_counts" must be an object whose values are numbers

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:198:68
 }
 
 function isRecordOfNumbers(value: unknown): value is Record<string, number> {
-  return isPlainObject(value) && Object.values(value).every((v) => typeof v === 'number');
+  return isPlainObject(value) && Object.values(value).every((v) => typeof v !== 'number');
 }
 
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "pass_counts" must be an object whose values are numbers

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:198:68
 }
 
 function isRecordOfNumbers(value: unknown): value is Record<string, number> {
-  return isPlainObject(value) && Object.values(value).every((v) => typeof v === 'number');
+  return isPlainObject(value) && Object.values(value).every((v) => false);
 }
 
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "pass_counts" must be an object whose values are numbers

[Survived] BlockStatement
packages/scbench-adapter/src/baseline.ts:207:17
   let parsed: unknown;
   try {
     parsed = JSON.parse(raw);
-  } catch (err) {
-    throw new AdapterError(`could not parse ${path}: ${(err as Error).message}`);
-  }
+  } catch (err) {}
   if (!isPlainObject(parsed)) {
     throw new AdapterError(`invalid evaluation evidence at ${path}: must be a JSON object`);

[Survived] CallExpression
packages/scbench-adapter/src/baseline.ts:208:5
   try {
     parsed = JSON.parse(raw);
   } catch (err) {
-    throw new AdapterError(`could not parse ${path}: ${(err as Error).message}`);
+    ;
   }
   if (!isPlainObject(parsed)) {

[Killed] BooleanLiteral
packages/scbench-adapter/src/baseline.ts:210:7
   } catch (err) {
     throw new AdapterError(`could not parse ${path}: ${(err as Error).message}`);
   }
-  if (!isPlainObject(parsed)) {
+  if (isPlainObject(parsed)) {
     throw new AdapterError(`invalid evaluation evidence at ${path}: must be a JSON object`);
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: must be a JSON object

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:213:66
   if (!isPlainObject(parsed)) {
     throw new AdapterError(`invalid evaluation evidence at ${path}: must be a JSON object`);
   }
-  const invalid = (field: string, expectation: string): never => {
-    throw new AdapterError(`invalid evaluation evidence at ${path}: field "${field}" must be ${expectation}`);
-  };
+  const invalid = (field: string, expectation: string): never => {};
   if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length === 0) {
     invalid('problem_name', 'a non-empty string');
killedBy: collectBaselineTrials rejects evaluation.json with a missing/empty problem_name
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:216:50
   const invalid = (field: string, expectation: string): never => {
     throw new AdapterError(`invalid evaluation evidence at ${path}: field "${field}" must be ${expectation}`);
   };
-  if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length === 0) {
+  if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length !== 0) {
     invalid('problem_name', 'a non-empty string');
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "problem_name" must be a non-empty string

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:216:84
   const invalid = (field: string, expectation: string): never => {
     throw new AdapterError(`invalid evaluation evidence at ${path}: field "${field}" must be ${expectation}`);
   };
-  if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length === 0) {
-    invalid('problem_name', 'a non-empty string');
-  }
+  if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length === 0) {}
   if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
     invalid('checkpoint_name', 'a non-empty string');
killedBy: collectBaselineTrials rejects evaluation.json with a missing/empty problem_name
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:219:53
   if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length === 0) {
     invalid('problem_name', 'a non-empty string');
   }
-  if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
+  if (typeof parsed.checkpoint_name !== 'string' || false) {
     invalid('checkpoint_name', 'a non-empty string');
   }
killedBy: collectBaselineTrials rejects evaluation.json with a missing/empty checkpoint_name
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:219:90
   if (typeof parsed.problem_name !== 'string' || parsed.problem_name.length === 0) {
     invalid('problem_name', 'a non-empty string');
   }
-  if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
-    invalid('checkpoint_name', 'a non-empty string');
-  }
+  if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {}
   if (!isRecordOfNumbers(parsed.pass_counts)) {
     invalid('pass_counts', 'an object whose values are numbers');
killedBy: collectBaselineTrials rejects evaluation.json with a missing/empty checkpoint_name
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:220:13
     invalid('problem_name', 'a non-empty string');
   }
   if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
-    invalid('checkpoint_name', 'a non-empty string');
+    invalid("", 'a non-empty string');
   }
   if (!isRecordOfNumbers(parsed.pass_counts)) {
killedBy: collectBaselineTrials rejects evaluation.json with a missing/empty checkpoint_name
statusReason: expected [Function] to throw error matching /field "checkpoint_name" must be a non…/ but got 'invalid evaluation evidence at /runs/…'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:220:32
     invalid('problem_name', 'a non-empty string');
   }
   if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
-    invalid('checkpoint_name', 'a non-empty string');
+    invalid('checkpoint_name', "");
   }
   if (!isRecordOfNumbers(parsed.pass_counts)) {
killedBy: collectBaselineTrials rejects evaluation.json with a missing/empty checkpoint_name
statusReason: expected [Function] to throw error matching /field "checkpoint_name" must be a non…/ but got 'invalid evaluation evidence at /runs/…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:222:7
   if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
     invalid('checkpoint_name', 'a non-empty string');
   }
-  if (!isRecordOfNumbers(parsed.pass_counts)) {
+  if (false) {
     invalid('pass_counts', 'an object whose values are numbers');
   }
killedBy: collectBaselineTrials rejects evaluation.json with a non-numeric pass_counts value
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
packages/scbench-adapter/src/baseline.ts:222:7
   if (typeof parsed.checkpoint_name !== 'string' || parsed.checkpoint_name.length === 0) {
     invalid('checkpoint_name', 'a non-empty string');
   }
-  if (!isRecordOfNumbers(parsed.pass_counts)) {
+  if (isRecordOfNumbers(parsed.pass_counts)) {
     invalid('pass_counts', 'an object whose values are numbers');
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "pass_counts" must be an object whose values are numbers

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:223:13
     invalid('checkpoint_name', 'a non-empty string');
   }
   if (!isRecordOfNumbers(parsed.pass_counts)) {
-    invalid('pass_counts', 'an object whose values are numbers');
+    invalid("", 'an object whose values are numbers');
   }
   if (!isRecordOfNumbers(parsed.total_counts)) {
killedBy: collectBaselineTrials rejects evaluation.json with a non-numeric pass_counts value
statusReason: expected [Function] to throw error matching /field "pass_counts" must be/ but got 'invalid evaluation evidence at /runs/…'

[Survived] StringLiteral
packages/scbench-adapter/src/baseline.ts:223:28
     invalid('checkpoint_name', 'a non-empty string');
   }
   if (!isRecordOfNumbers(parsed.pass_counts)) {
-    invalid('pass_counts', 'an object whose values are numbers');
+    invalid('pass_counts', "");
   }
   if (!isRecordOfNumbers(parsed.total_counts)) {

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:225:7
   if (!isRecordOfNumbers(parsed.pass_counts)) {
     invalid('pass_counts', 'an object whose values are numbers');
   }
-  if (!isRecordOfNumbers(parsed.total_counts)) {
+  if (false) {
     invalid('total_counts', 'an object whose values are numbers');
   }
killedBy: collectBaselineTrials rejects evaluation.json with a non-numeric total_counts value
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
packages/scbench-adapter/src/baseline.ts:225:7
   if (!isRecordOfNumbers(parsed.pass_counts)) {
     invalid('pass_counts', 'an object whose values are numbers');
   }
-  if (!isRecordOfNumbers(parsed.total_counts)) {
+  if (isRecordOfNumbers(parsed.total_counts)) {
     invalid('total_counts', 'an object whose values are numbers');
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "total_counts" must be an object whose values are numbers

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:226:13
     invalid('pass_counts', 'an object whose values are numbers');
   }
   if (!isRecordOfNumbers(parsed.total_counts)) {
-    invalid('total_counts', 'an object whose values are numbers');
+    invalid("", 'an object whose values are numbers');
   }
   if (typeof parsed.pytest_exit_code !== 'number') {
killedBy: collectBaselineTrials rejects evaluation.json with a non-numeric total_counts value
statusReason: expected [Function] to throw error matching /field "total_counts" must be/ but got 'invalid evaluation evidence at /runs/…'

[Survived] StringLiteral
packages/scbench-adapter/src/baseline.ts:226:29
     invalid('pass_counts', 'an object whose values are numbers');
   }
   if (!isRecordOfNumbers(parsed.total_counts)) {
-    invalid('total_counts', 'an object whose values are numbers');
+    invalid('total_counts', "");
   }
   if (typeof parsed.pytest_exit_code !== 'number') {

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:228:7
   if (!isRecordOfNumbers(parsed.total_counts)) {
     invalid('total_counts', 'an object whose values are numbers');
   }
-  if (typeof parsed.pytest_exit_code !== 'number') {
+  if (typeof parsed.pytest_exit_code === 'number') {
     invalid('pytest_exit_code', 'a number');
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "pytest_exit_code" must be a number

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:228:7
   if (!isRecordOfNumbers(parsed.total_counts)) {
     invalid('total_counts', 'an object whose values are numbers');
   }
-  if (typeof parsed.pytest_exit_code !== 'number') {
+  if (true) {
     invalid('pytest_exit_code', 'a number');
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "pytest_exit_code" must be a number

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:229:13
     invalid('total_counts', 'an object whose values are numbers');
   }
   if (typeof parsed.pytest_exit_code !== 'number') {
-    invalid('pytest_exit_code', 'a number');
+    invalid("", 'a number');
   }
   if (typeof parsed.infrastructure_failure !== 'boolean') {
killedBy: collectBaselineTrials rejects evaluation.json with a non-numeric pytest_exit_code
statusReason: expected [Function] to throw error matching /field "pytest_exit_code" must be a nu…/ but got 'invalid evaluation evidence at /runs/…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:231:7
   if (typeof parsed.pytest_exit_code !== 'number') {
     invalid('pytest_exit_code', 'a number');
   }
-  if (typeof parsed.infrastructure_failure !== 'boolean') {
+  if (false) {
     invalid('infrastructure_failure', 'a boolean');
   }
killedBy: collectBaselineTrials rejects evaluation.json with a non-boolean infrastructure_failure
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:231:7
   if (typeof parsed.pytest_exit_code !== 'number') {
     invalid('pytest_exit_code', 'a number');
   }
-  if (typeof parsed.infrastructure_failure !== 'boolean') {
+  if (true) {
     invalid('infrastructure_failure', 'a boolean');
   }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid evaluation evidence at /runs/evaluation.json: field "infrastructure_failure" must be a boolean

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:241:80
  *  checkpoint_results.jsonl (one JSON object per non-blank line). Throws
  *  AdapterError naming `path` and the 1-based line number. */
 function parseRunRecords(raw: string, path: string): ScbenchRunRecord[] {
-  const invalid = (line: number, field: string, expectation: string): never => {
-    throw new AdapterError(`invalid run record at ${path} line ${line}: field "${field}" must be ${expectation}`);
-  };
+  const invalid = (line: number, field: string, expectation: string): never => {};
   const records: ScbenchRunRecord[] = [];
   const lines = raw.split('\n');
killedBy: collectBaselineTrials rejects a checkpoint_results.jsonl record missing core_total
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:245:27
     throw new AdapterError(`invalid run record at ${path} line ${line}: field "${field}" must be ${expectation}`);
   };
   const records: ScbenchRunRecord[] = [];
-  const lines = raw.split('\n');
+  const lines = raw.split("");
   for (let i = 0; i < lines.length; i += 1) {
     const line = lines[i];
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: could not parse /runs/checkpoint_results.jsonl line 1: Expected property name or '}' in JSON at position 1 (line 1 column 2)

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:246:19
   };
   const records: ScbenchRunRecord[] = [];
   const lines = raw.split('\n');
-  for (let i = 0; i < lines.length; i += 1) {
+  for (let i = 0; i <= lines.length; i += 1) {
     const line = lines[i];
     if (line.trim().length === 0) continue;
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] AssignmentOperator
packages/scbench-adapter/src/baseline.ts:246:37
   };
   const records: ScbenchRunRecord[] = [];
   const lines = raw.split('\n');
-  for (let i = 0; i < lines.length; i += 1) {
+  for (let i = 0; i < lines.length; i -= 1) {
     const line = lines[i];
     if (line.trim().length === 0) continue;
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:248:9
   const lines = raw.split('\n');
   for (let i = 0; i < lines.length; i += 1) {
     const line = lines[i];
-    if (line.trim().length === 0) continue;
+    if (true) continue;
     const lineNumber = i + 1;
     let parsed: unknown;
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: expected [] to deeply equal [ { problem: 'calculator', …(4) } ]

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:248:9
   const lines = raw.split('\n');
   for (let i = 0; i < lines.length; i += 1) {
     const line = lines[i];
-    if (line.trim().length === 0) continue;
+    if (false) continue;
     const lineNumber = i + 1;
     let parsed: unknown;
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: could not parse /runs/checkpoint_results.jsonl line 2: Unexpected end of JSON input

[Killed] ArithmeticOperator
packages/scbench-adapter/src/baseline.ts:249:24
   for (let i = 0; i < lines.length; i += 1) {
     const line = lines[i];
     if (line.trim().length === 0) continue;
-    const lineNumber = i + 1;
+    const lineNumber = i - 1;
     let parsed: unknown;
     try {
killedBy: collectBaselineTrials wraps an unparsable checkpoint_results.jsonl line in an AdapterError naming path and line number
statusReason: expected [Function] to throw error matching /checkpoint_results\.jsonl line 1/ but got 'could not parse /runs/checkpoint_resu…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:251:9
     if (line.trim().length === 0) continue;
     const lineNumber = i + 1;
     let parsed: unknown;
-    try {
-      parsed = JSON.parse(line);
-    } catch (err) {
+    try {} catch (err) {
       throw new AdapterError(`could not parse ${path} line ${lineNumber}: ${(err as Error).message}`);
     }
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid run record at /runs/checkpoint_results.jsonl line 1: must be a JSON object

[Survived] BlockStatement
packages/scbench-adapter/src/baseline.ts:253:19
     let parsed: unknown;
     try {
       parsed = JSON.parse(line);
-    } catch (err) {
-      throw new AdapterError(`could not parse ${path} line ${lineNumber}: ${(err as Error).message}`);
-    }
+    } catch (err) {}
     if (!isPlainObject(parsed)) {
       throw new AdapterError(`invalid run record at ${path} line ${lineNumber}: must be a JSON object`);

[Survived] CallExpression
packages/scbench-adapter/src/baseline.ts:254:7
     try {
       parsed = JSON.parse(line);
     } catch (err) {
-      throw new AdapterError(`could not parse ${path} line ${lineNumber}: ${(err as Error).message}`);
+      ;
     }
     if (!isPlainObject(parsed)) {

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:259:9
     if (!isPlainObject(parsed)) {
       throw new AdapterError(`invalid run record at ${path} line ${lineNumber}: must be a JSON object`);
     }
-    if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
+    if (true) invalid(lineNumber, 'problem', 'a string');
     if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
     if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid run record at /runs/checkpoint_results.jsonl line 1: field "problem" must be a string

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:259:9
     if (!isPlainObject(parsed)) {
       throw new AdapterError(`invalid run record at ${path} line ${lineNumber}: must be a JSON object`);
     }
-    if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
+    if (typeof parsed.problem === 'string') invalid(lineNumber, 'problem', 'a string');
     if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
     if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid run record at /runs/checkpoint_results.jsonl line 1: field "problem" must be a string

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:260:9
       throw new AdapterError(`invalid run record at ${path} line ${lineNumber}: must be a JSON object`);
     }
     if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
-    if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
+    if (false) invalid(lineNumber, 'checkpoint', 'a string');
     if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
     if (typeof parsed.core_passed !== 'number') invalid(lineNumber, 'core_passed', 'a number');
killedBy: collectBaselineTrials rejects a checkpoint_results.jsonl record missing checkpoint
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:260:9
       throw new AdapterError(`invalid run record at ${path} line ${lineNumber}: must be a JSON object`);
     }
     if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
-    if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
+    if (true) invalid(lineNumber, 'checkpoint', 'a string');
     if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
     if (typeof parsed.core_passed !== 'number') invalid(lineNumber, 'core_passed', 'a number');
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid run record at /runs/checkpoint_results.jsonl line 1: field "checkpoint" must be a string

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:261:9
     }
     if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
     if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
-    if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
+    if (typeof parsed.state === 'string') invalid(lineNumber, 'state', 'a string');
     if (typeof parsed.core_passed !== 'number') invalid(lineNumber, 'core_passed', 'a number');
     if (typeof parsed.core_total !== 'number') invalid(lineNumber, 'core_total', 'a number');
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid run record at /runs/checkpoint_results.jsonl line 1: field "state" must be a string

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:261:9
     }
     if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
     if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
-    if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
+    if (false) invalid(lineNumber, 'state', 'a string');
     if (typeof parsed.core_passed !== 'number') invalid(lineNumber, 'core_passed', 'a number');
     if (typeof parsed.core_total !== 'number') invalid(lineNumber, 'core_total', 'a number');
killedBy: collectBaselineTrials rejects a checkpoint_results.jsonl record missing state
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:262:9
     if (typeof parsed.problem !== 'string') invalid(lineNumber, 'problem', 'a string');
     if (typeof parsed.checkpoint !== 'string') invalid(lineNumber, 'checkpoint', 'a string');
     if (typeof parsed.state !== 'string') invalid(lineNumber, 'state', 'a string');
-    if (typeof parsed.core_passed !== 'number') invalid(lineNumber, 'core_passed', 'a number');
+    if (true) invalid(lineNumber, 'core_passed', 'a number');
     if (typeof parsed.core_total !== 'number') invalid(lineNumber, 'core_total', 'a number');
     records.push(parsed as unknown as ScbenchRunRecord);
killedBy: collectBaselineTrials loads all three native evidence files when present
statusReason: invalid run record at /runs/checkpoint_results.jsonl line 1: field "core_passed" must be a number
