[Killed] ArrayDeclaration
packages/scbench-adapter/src/baseline.ts:369:19
 }
 
 function evidencePresent(evidence: BaselineTrialEvidence): string {
-  const present = [
-    evidence.evaluation ? NATIVE_EVIDENCE_FILES[0] : undefined,
-    evidence.runRecords ? NATIVE_EVIDENCE_FILES[1] : undefined,
-    evidence.runInfoPresent ? NATIVE_EVIDENCE_FILES[2] : undefined,
-  ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f !== undefined);
+  const present = [].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f !== undefined);
   return present.length > 0 ? present.join(', ') : 'none';
 }
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'native evidence: evaluation.json, che…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:373:64
     evidence.evaluation ? NATIVE_EVIDENCE_FILES[0] : undefined,
     evidence.runRecords ? NATIVE_EVIDENCE_FILES[1] : undefined,
     evidence.runInfoPresent ? NATIVE_EVIDENCE_FILES[2] : undefined,
-  ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f !== undefined);
+  ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f === undefined);
   return present.length > 0 ? present.join(', ') : 'none';
 }
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'native evidence: evaluation.json, che…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:373:64
     evidence.evaluation ? NATIVE_EVIDENCE_FILES[0] : undefined,
     evidence.runRecords ? NATIVE_EVIDENCE_FILES[1] : undefined,
     evidence.runInfoPresent ? NATIVE_EVIDENCE_FILES[2] : undefined,
-  ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f !== undefined);
+  ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => true);
   return present.length > 0 ? present.join(', ') : 'none';
 }
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'native evidence: none'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:374:10
     evidence.runRecords ? NATIVE_EVIDENCE_FILES[1] : undefined,
     evidence.runInfoPresent ? NATIVE_EVIDENCE_FILES[2] : undefined,
   ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f !== undefined);
-  return present.length > 0 ? present.join(', ') : 'none';
+  return false ? present.join(', ') : 'none';
 }
 
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'native evidence: evaluation.json, che…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:374:10
     evidence.runRecords ? NATIVE_EVIDENCE_FILES[1] : undefined,
     evidence.runInfoPresent ? NATIVE_EVIDENCE_FILES[2] : undefined,
   ].filter((f): f is (typeof NATIVE_EVIDENCE_FILES)[number] => f !== undefined);
-  return present.length > 0 ? present.join(', ') : 'none';
+  return true ? present.join(', ') : 'none';
 }
 
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'native evidence: none'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:377:56
   return present.length > 0 ? present.join(', ') : 'none';
 }
 
-function renderTrials(trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'No trials recorded.';
-  return trials
-    .map(
-      (t) =>
-        `- \`${t.id}\`: outcome \`${t.manifest.run.outcome}\`, elapsed ${t.manifest.run.elapsedMs}ms, manifest \`${t.manifestPath}\`, native evidence: ${evidencePresent(t.evidence)}`,
-    )
-    .join('\n');
-}
+function renderTrials(trials: BaselineTrial[]): string {}
 
 function renderFactoryOutcomes(trials: BaselineTrial[]): string {
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: outcome `ready`, elapsed 60000ms'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:378:7
 }
 
 function renderTrials(trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'No trials recorded.';
+  if (true) return 'No trials recorded.';
   return trials
     .map(
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: outcome `ready`, elapsed 60000ms'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:378:7
 }
 
 function renderTrials(trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'No trials recorded.';
+  if (trials.length !== 0) return 'No trials recorded.';
   return trials
     .map(
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: outcome `ready`, elapsed 60000ms'

[Killed] ArrowFunction
packages/scbench-adapter/src/baseline.ts:381:7
   if (trials.length === 0) return 'No trials recorded.';
   return trials
     .map(
-      (t) =>
-        `- \`${t.id}\`: outcome \`${t.manifest.run.outcome}\`, elapsed ${t.manifest.run.elapsedMs}ms, manifest \`${t.manifestPath}\`, native evidence: ${evidencePresent(t.evidence)}`,
+      () => undefined,
     )
     .join('\n');
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: outcome `ready`, elapsed 60000ms'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:384:11
       (t) =>
         `- \`${t.id}\`: outcome \`${t.manifest.run.outcome}\`, elapsed ${t.manifest.run.elapsedMs}ms, manifest \`${t.manifestPath}\`, native evidence: ${evidencePresent(t.evidence)}`,
     )
-    .join('\n');
+    .join("");
 }
 
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] ArrowFunction
packages/scbench-adapter/src/baseline.ts:388:31
 }
 
 function renderFactoryOutcomes(trials: BaselineTrial[]): string {
-  const ready = trials.filter((t) => t.manifest.run.outcome === 'ready').length;
+  const ready = trials.filter(() => undefined).length;
   if (trials.length === 0) return formatPassRate(ready, trials.length);
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '2/2 (100.0%) of Factory runs ended `r…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:388:38
 }
 
 function renderFactoryOutcomes(trials: BaselineTrial[]): string {
-  const ready = trials.filter((t) => t.manifest.run.outcome === 'ready').length;
+  const ready = trials.filter((t) => t.manifest.run.outcome !== 'ready').length;
   if (trials.length === 0) return formatPassRate(ready, trials.length);
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '2/2 (100.0%) of Factory runs ended `r…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:389:7
 
 function renderFactoryOutcomes(trials: BaselineTrial[]): string {
   const ready = trials.filter((t) => t.manifest.run.outcome === 'ready').length;
-  if (trials.length === 0) return formatPassRate(ready, trials.length);
+  if (trials.length !== 0) return formatPassRate(ready, trials.length);
 }
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '2/2 (100.0%) of Factory runs ended `r…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:389:7
 
 function renderFactoryOutcomes(trials: BaselineTrial[]): string {
   const ready = trials.filter((t) => t.manifest.run.outcome === 'ready').length;
-  if (trials.length === 0) return formatPassRate(ready, trials.length);
+  if (true) return formatPassRate(ready, trials.length);
 }
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '2/2 (100.0%) of Factory runs ended `r…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:394:7
 }
 
 function renderBenchmarkPassRate(config: BaselineConfig, trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'no trials recorded';
+  if (true) return 'no trials recorded';
 
   const withEvidence = trials.filter(hasEvaluation);
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not measurable — none of the 2 record…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:394:7
 }
 
 function renderBenchmarkPassRate(config: BaselineConfig, trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'no trials recorded';
+  if (trials.length !== 0) return 'no trials recorded';
 
   const withEvidence = trials.filter(hasEvaluation);
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not measurable — none of the 2 record…'

[Killed] MethodExpression
packages/scbench-adapter/src/baseline.ts:396:24
 function renderBenchmarkPassRate(config: BaselineConfig, trials: BaselineTrial[]): string {
   if (trials.length === 0) return 'no trials recorded';
 
-  const withEvidence = trials.filter(hasEvaluation);
+  const withEvidence = trials;
   if (withEvidence.length === 0) {
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not measurable — none of the 2 record…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:397:7
   if (trials.length === 0) return 'no trials recorded';
 
   const withEvidence = trials.filter(hasEvaluation);
-  if (withEvidence.length === 0) {
+  if (withEvidence.length !== 0) {
   }
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not measurable — none of the 2 record…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:397:7
   if (trials.length === 0) return 'no trials recorded';
 
   const withEvidence = trials.filter(hasEvaluation);
-  if (withEvidence.length === 0) {
+  if (true) {
   }
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] ArrowFunction
packages/scbench-adapter/src/baseline.ts:401:31
   }
 
-  const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
+  const verdicts = trials.map(() => undefined);
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: Cannot read properties of undefined (reading 'verdict')

[Killed] ArrowFunction
packages/scbench-adapter/src/baseline.ts:402:34
   }
 
   const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
-  const passes = verdicts.filter((v) => v.verdict === 'pass').length;
+  const passes = verdicts.filter(() => undefined).length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:402:41
   }
 
   const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
-  const passes = verdicts.filter((v) => v.verdict === 'pass').length;
+  const passes = verdicts.filter((v) => false).length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] MethodExpression
packages/scbench-adapter/src/baseline.ts:403:17
 
   const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
-  const fails = verdicts.filter((v) => v.verdict === 'fail').length;
+  const fails = verdicts.length;
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] ArrowFunction
packages/scbench-adapter/src/baseline.ts:403:33
 
   const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
-  const fails = verdicts.filter((v) => v.verdict === 'fail').length;
+  const fails = verdicts.filter(() => undefined).length;
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:404:40
   const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
-  const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
+  const infra = verdicts.filter((v) => false).length;
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
 
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] MethodExpression
packages/scbench-adapter/src/baseline.ts:404:17
   const verdicts = trials.map((t) => ({ trial: t, verdict: evaluateTrialVerdict(t) }));
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
-  const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
+  const infra = verdicts.length;
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
 
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] MethodExpression
packages/scbench-adapter/src/baseline.ts:405:19
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
-  const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
+  const missing = verdicts.length;
 
   const lines = verdicts.map(({ trial, verdict }) => {
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:405:42
   const passes = verdicts.filter((v) => v.verdict === 'pass').length;
   const fails = verdicts.filter((v) => v.verdict === 'fail').length;
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
-  const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
+  const missing = verdicts.filter((v) => false).length;
 
   const lines = verdicts.map(({ trial, verdict }) => {
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '1/4 (25.0%) under pass policy `core-c…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:407:54
   const infra = verdicts.filter((v) => v.verdict === 'infrastructure-failure').length;
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
 
-  const lines = verdicts.map(({ trial, verdict }) => {
-    if ((verdict === 'pass' || verdict === 'fail') && hasEvaluation(trial)) {
-      const evaluation = trial.evidence.evaluation;
-      const { passed, total } = coreCounts(evaluation);
-      return `- \`${trial.id}\`: ${verdict} — Core ${passed}/${total} (${evaluation.problem_name} / ${evaluation.checkpoint_name})`;
-    }
-    if (verdict === 'infrastructure-failure') {
-      return `- \`${trial.id}\`: infrastructure failure — native evaluation reports infrastructure_failure`;
-    }
-    return `- \`${trial.id}\`: missing evidence — no evaluation.json in the trial directory`;
-  });
+  const lines = verdicts.map(({ trial, verdict }) => {});
 
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- `a`: pass — Core 3/3 (calculator / …'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:408:10
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
 
   const lines = verdicts.map(({ trial, verdict }) => {
-    if ((verdict === 'pass' || verdict === 'fail') && hasEvaluation(trial)) {
+    if ((verdict !== 'pass' || verdict === 'fail') && hasEvaluation(trial)) {
       const evaluation = trial.evidence.evaluation;
       const { passed, total } = coreCounts(evaluation);
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- `a`: pass — Core 3/3 (calculator / …'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:408:32
   const missing = verdicts.filter((v) => v.verdict === 'missing-evidence').length;
 
   const lines = verdicts.map(({ trial, verdict }) => {
-    if ((verdict === 'pass' || verdict === 'fail') && hasEvaluation(trial)) {
+    if ((verdict === 'pass' || verdict !== 'fail') && hasEvaluation(trial)) {
       const evaluation = trial.evidence.evaluation;
       const { passed, total } = coreCounts(evaluation);
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- `b`: fail — Core 2/3 (calculator / …'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:411:14
     if ((verdict === 'pass' || verdict === 'fail') && hasEvaluation(trial)) {
       const evaluation = trial.evidence.evaluation;
       const { passed, total } = coreCounts(evaluation);
-      return `- \`${trial.id}\`: ${verdict} — Core ${passed}/${total} (${evaluation.problem_name} / ${evaluation.checkpoint_name})`;
+      return ``;
     }
     if (verdict === 'infrastructure-failure') {
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- `a`: pass — Core 3/3 (calculator / …'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:413:9
       const { passed, total } = coreCounts(evaluation);
       return `- \`${trial.id}\`: ${verdict} — Core ${passed}/${total} (${evaluation.problem_name} / ${evaluation.checkpoint_name})`;
     }
-    if (verdict === 'infrastructure-failure') {
+    if (verdict !== 'infrastructure-failure') {
       return `- \`${trial.id}\`: infrastructure failure — native evaluation reports infrastructure_failure`;
     }
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- `c`: infrastructure failure — nativ…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:413:47
       const { passed, total } = coreCounts(evaluation);
       return `- \`${trial.id}\`: ${verdict} — Core ${passed}/${total} (${evaluation.problem_name} / ${evaluation.checkpoint_name})`;
     }
-    if (verdict === 'infrastructure-failure') {
-      return `- \`${trial.id}\`: infrastructure failure — native evaluation reports infrastructure_failure`;
-    }
+    if (verdict === 'infrastructure-failure') {}
     return `- \`${trial.id}\`: missing evidence — no evaluation.json in the trial directory`;
   });
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- `c`: infrastructure failure — nativ…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:424:93
   return [headline, '', ...lines].join('\n');
 }
 
-function checkpointSortKey(checkpointName: string): { n: number | undefined; name: string } {
-  const match = /(\d+)$/.exec(checkpointName);
-  return { n: match ? Number(match[1]) : undefined, name: checkpointName };
-}
+function checkpointSortKey(checkpointName: string): { n: number | undefined; name: string } {}
 
 function renderErosion(trials: BaselineTrial[]): string {
killedBy: generateBaselineReport renders pass/fail/infrastructure-failure verdicts with mixed denominators
statusReason: Cannot read properties of undefined (reading 'n')

[Survived] Regex
packages/scbench-adapter/src/baseline.ts:425:17
 }
 
 function checkpointSortKey(checkpointName: string): { n: number | undefined; name: string } {
-  const match = /(\d+)$/.exec(checkpointName);
+  const match = /(\d+)/.exec(checkpointName);
   return { n: match ? Number(match[1]) : undefined, name: checkpointName };
 }

[Killed] MethodExpression
packages/scbench-adapter/src/baseline.ts:430:24
 }
 
 function renderErosion(trials: BaselineTrial[]): string {
-  const withEvidence = trials.filter(hasEvaluation);
+  const withEvidence = trials;
   if (withEvidence.length === 0) {
     return 'Not yet measurable — requires native SCBench evaluation evidence from the live multi-checkpoint suite run.';
killedBy: generateBaselineReport shows the PRELIMINARY banner (with trial count + config scope) below threshold, and omits it at/above threshold
statusReason: Cannot read properties of undefined (reading 'problem_name')

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:431:34
 
 function renderErosion(trials: BaselineTrial[]): string {
   const withEvidence = trials.filter(hasEvaluation);
-  if (withEvidence.length === 0) {
-    return 'Not yet measurable — requires native SCBench evaluation evidence from the live multi-checkpoint suite run.';
-  }
+  if (withEvidence.length === 0) {}
 
   const groups = new Map<string, (typeof withEvidence)[number][]>();
killedBy: generateBaselineReport renders "no trials" fallbacks across every section for zero trials
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not yet measurable — requires native …'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:431:7
 
 function renderErosion(trials: BaselineTrial[]): string {
   const withEvidence = trials.filter(hasEvaluation);
-  if (withEvidence.length === 0) {
+  if (false) {
     return 'Not yet measurable — requires native SCBench evaluation evidence from the live multi-checkpoint suite run.';
   }
killedBy: generateBaselineReport renders "no trials" fallbacks across every section for zero trials
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not yet measurable — requires native …'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:436:37
   }
 
   const groups = new Map<string, (typeof withEvidence)[number][]>();
-  for (const trial of withEvidence) {
-    const problem = trial.evidence.evaluation.problem_name;
-    const list = groups.get(problem) ?? [];
-    list.push(trial);
-    groups.set(problem, list);
-  }
+  for (const trial of withEvidence) {}
 
   return [...groups.keys()]
killedBy: generateBaselineReport groups erosion by evaluation.problem_name, ordering checkpoints numerically
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- calculator: checkpoint_1 `suite/cal…'

[Killed] LogicalOperator
packages/scbench-adapter/src/baseline.ts:438:18
   const groups = new Map<string, (typeof withEvidence)[number][]>();
   for (const trial of withEvidence) {
     const problem = trial.evidence.evaluation.problem_name;
-    const list = groups.get(problem) ?? [];
+    const list = groups.get(problem) && [];
     list.push(trial);
     groups.set(problem, list);
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] CallExpression
packages/scbench-adapter/src/baseline.ts:439:5
   for (const trial of withEvidence) {
     const problem = trial.evidence.evaluation.problem_name;
     const list = groups.get(problem) ?? [];
-    list.push(trial);
+    ;
     groups.set(problem, list);
   }
killedBy: generateBaselineReport groups erosion by evaluation.problem_name, ordering checkpoints numerically
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- calculator: checkpoint_1 `suite/cal…'

[Killed] CallExpression
packages/scbench-adapter/src/baseline.ts:440:5
     const problem = trial.evidence.evaluation.problem_name;
     const list = groups.get(problem) ?? [];
     list.push(trial);
-    groups.set(problem, list);
+    ;
   }
 
killedBy: generateBaselineReport groups erosion by evaluation.problem_name, ordering checkpoints numerically
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- calculator: checkpoint_1 `suite/cal…'

[Survived] MethodExpression
packages/scbench-adapter/src/baseline.ts:443:10
     groups.set(problem, list);
   }
 
-  return [...groups.keys()]
-    .sort()
+  return [...groups.keys()]
     .map((problem) => {
       const entries = groups

[Killed] ArrayDeclaration
packages/scbench-adapter/src/baseline.ts:443:10
     groups.set(problem, list);
   }
 
-  return [...groups.keys()]
+  return []
     .sort()
     .map((problem) => {
killedBy: generateBaselineReport groups erosion by evaluation.problem_name, ordering checkpoints numerically
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- calculator: checkpoint_1 `suite/cal…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:445:23
 
   return [...groups.keys()]
     .sort()
-    .map((problem) => {
-      const entries = groups
-        .get(problem)!
-        .slice()
-        .sort((a, b) => {
-          const ak = checkpointSortKey(a.evidence.evaluation.checkpoint_name);
-          const bk = checkpointSortKey(b.evidence.evaluation.checkpoint_name);
-          if (ak.n !== undefined && bk.n !== undefined) {
-            if (ak.n !== bk.n) return ak.n - bk.n;
-          } else if (ak.name !== bk.name) {
-            return ak.name < bk.name ? -1 : 1;
-          }
-          return a.id < b.id ? -1 : a.id > b.id ? 1 : 0;
-        })
-        .map((t) => {
-          const evaluation = t.evidence.evaluation;
-          const verdict = evaluateTrialVerdict(t);
-          const verdictLabel = verdict === 'infrastructure-failure' ? 'infrastructure failure' : verdict;
-          const { passed, total } = coreCounts(evaluation);
-          return `${evaluation.checkpoint_name} \`${t.id}\`: ${verdictLabel} (Core ${passed}/${total})`;
-        })
-        .join(', ');
-      return `- ${problem}: ${entries}`;
-    })
+    .map((problem) => {})
     .join('\n');
 }
killedBy: generateBaselineReport groups erosion by evaluation.problem_name, ordering checkpoints numerically
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '- calculator: checkpoint_1 `suite/cal…'
