[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:505:28
   }
   return [...byKey.entries()]
     .sort(([a], [b]) => (a < b ? -1 : a > b ? 1 : 0))
-    .map(([key, entry]) => {
-      const reasons = entry.reasons.size > 0 ? `; failover reasons: ${[...entry.reasons].sort().join(', ')}` : '';
-      return `- ${key}: ${entry.count} attempt(s)${reasons}`;
-    })
+    .map(([key, entry]) => {})
     .join('\n');
 }
killedBy: generateBaselineReport aggregates routing/failover attempts by model+task, including failover reasons
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'claude / plan: 2 attempt(s); failover…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:506:23
   return [...byKey.entries()]
     .sort(([a], [b]) => (a < b ? -1 : a > b ? 1 : 0))
     .map(([key, entry]) => {
-      const reasons = entry.reasons.size > 0 ? `; failover reasons: ${[...entry.reasons].sort().join(', ')}` : '';
+      const reasons = false ? `; failover reasons: ${[...entry.reasons].sort().join(', ')}` : '';
       return `- ${key}: ${entry.count} attempt(s)${reasons}`;
     })
killedBy: generateBaselineReport aggregates routing/failover attempts by model+task, including failover reasons
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'claude / plan: 2 attempt(s); failover…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:506:23
   return [...byKey.entries()]
     .sort(([a], [b]) => (a < b ? -1 : a > b ? 1 : 0))
     .map(([key, entry]) => {
-      const reasons = entry.reasons.size > 0 ? `; failover reasons: ${[...entry.reasons].sort().join(', ')}` : '';
+      const reasons = entry.reasons.size <= 0 ? `; failover reasons: ${[...entry.reasons].sort().join(', ')}` : '';
       return `- ${key}: ${entry.count} attempt(s)${reasons}`;
     })
killedBy: generateBaselineReport aggregates routing/failover attempts by model+task, including failover reasons
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'claude / plan: 2 attempt(s); failover…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:512:65
     .join('\n');
 }
 
-function renderCheckerOutcomes(trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'No trials recorded.';
-  return trials
-    .map((t) => {
-      const checker = t.manifest.checker;
-      if (!checker) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
-      return `- \`${t.id}\`: ${checker.passes} passed, ${checker.failures} failed, ${checker.skips} skipped (total ${checker.total}).`;
-    })
-    .join('\n');
-}
+function renderCheckerOutcomes(trials: BaselineTrial[]): string {}
 
 function renderFailureNotes(trials: BaselineTrial[]): string {
killedBy: generateBaselineReport renders checker outcomes for trials with and without a checker summary
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: 3 passed, 1 failed, 0 skipped (t…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:513:7
 }
 
 function renderCheckerOutcomes(trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'No trials recorded.';
+  if (true) return 'No trials recorded.';
   return trials
     .map((t) => {
killedBy: generateBaselineReport renders checker outcomes for trials with and without a checker summary
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: 3 passed, 1 failed, 0 skipped (t…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:513:7
 }
 
 function renderCheckerOutcomes(trials: BaselineTrial[]): string {
-  if (trials.length === 0) return 'No trials recorded.';
+  if (trials.length !== 0) return 'No trials recorded.';
   return trials
     .map((t) => {
killedBy: generateBaselineReport renders checker outcomes for trials with and without a checker summary
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: 3 passed, 1 failed, 0 skipped (t…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:515:17
 function renderCheckerOutcomes(trials: BaselineTrial[]): string {
   if (trials.length === 0) return 'No trials recorded.';
   return trials
-    .map((t) => {
-      const checker = t.manifest.checker;
-      if (!checker) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
-      return `- \`${t.id}\`: ${checker.passes} passed, ${checker.failures} failed, ${checker.skips} skipped (total ${checker.total}).`;
-    })
+    .map((t) => {})
     .join('\n');
 }
killedBy: generateBaselineReport renders checker outcomes for trials with and without a checker summary
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: 3 passed, 1 failed, 0 skipped (t…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:517:11
   return trials
     .map((t) => {
       const checker = t.manifest.checker;
-      if (!checker) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
+      if (true) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
       return `- \`${t.id}\`: ${checker.passes} passed, ${checker.failures} failed, ${checker.skips} skipped (total ${checker.total}).`;
     })
killedBy: generateBaselineReport renders checker outcomes for trials with and without a checker summary
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: 3 passed, 1 failed, 0 skipped (t…'

[Killed] BooleanLiteral
packages/scbench-adapter/src/baseline.ts:517:11
   return trials
     .map((t) => {
       const checker = t.manifest.checker;
-      if (!checker) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
+      if (checker) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
       return `- \`${t.id}\`: ${checker.passes} passed, ${checker.failures} failed, ${checker.skips} skipped (total ${checker.total}).`;
     })
killedBy: generateBaselineReport shows the PRELIMINARY banner (with trial count + config scope) below threshold, and omits it at/above threshold
statusReason: Cannot read properties of undefined (reading 'passes')

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:518:14
     .map((t) => {
       const checker = t.manifest.checker;
       if (!checker) return `- \`${t.id}\`: No checker data (run ended before CHECK or checker summary absent).`;
-      return `- \`${t.id}\`: ${checker.passes} passed, ${checker.failures} failed, ${checker.skips} skipped (total ${checker.total}).`;
+      return ``;
     })
     .join('\n');
killedBy: generateBaselineReport renders checker outcomes for trials with and without a checker summary
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: 3 passed, 1 failed, 0 skipped (t…'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:523:62
     .join('\n');
 }
 
-function renderFailureNotes(trials: BaselineTrial[]): string {
-  const withFailures = trials.filter((t) => t.manifest.failure);
-  if (withFailures.length === 0) return 'No failures recorded.';
-  return withFailures
-    .map((t) => {
-      const failure = t.manifest.failure!;
-      return `- \`${t.id}\`: phase \`${failure.phase}\`, reason \`${failure.reason}\` — ${failure.message}`;
-    })
-    .join('\n');
-}
+function renderFailureNotes(trials: BaselineTrial[]): string {}
 
 /** Pure string builder — every rendered value is derived from `config` and
killedBy: generateBaselineReport renders "no trials" fallbacks across every section for zero trials
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'No failures recorded.'

[Killed] MethodExpression
packages/scbench-adapter/src/baseline.ts:524:24
 }
 
 function renderFailureNotes(trials: BaselineTrial[]): string {
-  const withFailures = trials.filter((t) => t.manifest.failure);
+  const withFailures = trials;
   if (withFailures.length === 0) return 'No failures recorded.';
   return withFailures
killedBy: generateBaselineReport shows the PRELIMINARY banner (with trial count + config scope) below threshold, and omits it at/above threshold
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ArrowFunction
packages/scbench-adapter/src/baseline.ts:524:38
 }
 
 function renderFailureNotes(trials: BaselineTrial[]): string {
-  const withFailures = trials.filter((t) => t.manifest.failure);
+  const withFailures = trials.filter(() => undefined);
   if (withFailures.length === 0) return 'No failures recorded.';
   return withFailures
killedBy: generateBaselineReport renders failure notes only for trials that carry a failure
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: phase `build`, reason `fail` — t…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:525:7
 
 function renderFailureNotes(trials: BaselineTrial[]): string {
   const withFailures = trials.filter((t) => t.manifest.failure);
-  if (withFailures.length === 0) return 'No failures recorded.';
+  if (true) return 'No failures recorded.';
   return withFailures
     .map((t) => {
killedBy: generateBaselineReport renders failure notes only for trials that carry a failure
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: phase `build`, reason `fail` — t…'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:525:7
 
 function renderFailureNotes(trials: BaselineTrial[]): string {
   const withFailures = trials.filter((t) => t.manifest.failure);
-  if (withFailures.length === 0) return 'No failures recorded.';
+  if (false) return 'No failures recorded.';
   return withFailures
     .map((t) => {
killedBy: generateBaselineReport renders "no trials" fallbacks across every section for zero trials
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'No failures recorded.'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:527:17
   const withFailures = trials.filter((t) => t.manifest.failure);
   if (withFailures.length === 0) return 'No failures recorded.';
   return withFailures
-    .map((t) => {
-      const failure = t.manifest.failure!;
-      return `- \`${t.id}\`: phase \`${failure.phase}\`, reason \`${failure.reason}\` — ${failure.message}`;
-    })
+    .map((t) => {})
     .join('\n');
 }
killedBy: generateBaselineReport renders failure notes only for trials that carry a failure
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: phase `build`, reason `fail` — t…'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:537:24
 /** Pure string builder — every rendered value is derived from `config` and
  *  `trials[].manifest`, never from wall-clock state or transcribed logs. */
 export function generateBaselineReport(config: BaselineConfig, trials: BaselineTrial[]): string {
-  const statusLines = [`**Trial count:** ${trials.length} (comparison threshold: ${config.comparisonThreshold})`];
+  const statusLines = [``];
   if (trials.length < config.comparisonThreshold) {
     statusLines.push(
killedBy: generateBaselineReport renders "no trials" fallbacks across every section for zero trials
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '**Trial count:** 0 (comparison thresh…'

[Killed] EqualityOperator
packages/scbench-adapter/src/baseline.ts:538:7
  *  `trials[].manifest`, never from wall-clock state or transcribed logs. */
 export function generateBaselineReport(config: BaselineConfig, trials: BaselineTrial[]): string {
   const statusLines = [`**Trial count:** ${trials.length} (comparison threshold: ${config.comparisonThreshold})`];
-  if (trials.length < config.comparisonThreshold) {
+  if (trials.length <= config.comparisonThreshold) {
     statusLines.push(
killedBy: generateBaselineReport shows the PRELIMINARY banner (with trial count + config scope) below threshold, and omits it at/above threshold
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' not to contain 'PRELIMINARY'

[Killed] ConditionalExpression
packages/scbench-adapter/src/baseline.ts:538:7
  *  `trials[].manifest`, never from wall-clock state or transcribed logs. */
 export function generateBaselineReport(config: BaselineConfig, trials: BaselineTrial[]): string {
   const statusLines = [`**Trial count:** ${trials.length} (comparison threshold: ${config.comparisonThreshold})`];
-  if (trials.length < config.comparisonThreshold) {
+  if (true) {
     statusLines.push(
killedBy: generateBaselineReport shows the PRELIMINARY banner (with trial count + config scope) below threshold, and omits it at/above threshold
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' not to contain 'PRELIMINARY'

[Killed] BlockStatement
packages/scbench-adapter/src/baseline.ts:542:10
     statusLines.push(
     );
-  } else {
-    statusLines.push('**Status: comparison-ready** — the trial count meets the comparison threshold.');
-  }
+  } else {}
 
   const sections = [
killedBy: generateBaselineReport shows the PRELIMINARY banner (with trial count + config scope) below threshold, and omits it at/above threshold
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '**Status: comparison-ready**'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:549:26
   const sections = [
     `# SlopCodeBench Baseline: ${config.baselineId}`,
     statusLines.join('\n\n'),
-    ['## Pinned inputs', '', renderPinnedInputs(config)].join('\n'),
+    ['## Pinned inputs', "Stryker was here!", renderPinnedInputs(config)].join('\n'),
     ['## Trials', '', renderTrials(trials)].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] ArrayDeclaration
packages/scbench-adapter/src/baseline.ts:549:5
   const sections = [
     `# SlopCodeBench Baseline: ${config.baselineId}`,
     statusLines.join('\n\n'),
-    ['## Pinned inputs', '', renderPinnedInputs(config)].join('\n'),
+    [].join('\n'),
     ['## Trials', '', renderTrials(trials)].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] ArrayDeclaration
packages/scbench-adapter/src/baseline.ts:550:5
     `# SlopCodeBench Baseline: ${config.baselineId}`,
     statusLines.join('\n\n'),
     ['## Pinned inputs', '', renderPinnedInputs(config)].join('\n'),
-    ['## Trials', '', renderTrials(trials)].join('\n'),
+    [].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
     ['## Erosion trajectory (native SCBench evaluation)', '', renderErosion(trials)].join('\n'),
killedBy: generateBaselineReport renders native evidence presence in the Trials section
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '`a`: outcome `ready`, elapsed 60000ms'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:551:110
     statusLines.join('\n\n'),
     ['## Pinned inputs', '', renderPinnedInputs(config)].join('\n'),
     ['## Trials', '', renderTrials(trials)].join('\n'),
-    ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
+    ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join(""),
     ['## Erosion trajectory (native SCBench evaluation)', '', renderErosion(trials)].join('\n'),
     ['## Factory run outcomes (harness health)', '', renderFactoryOutcomes(trials)].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] ArrayDeclaration
packages/scbench-adapter/src/baseline.ts:552:5
     ['## Pinned inputs', '', renderPinnedInputs(config)].join('\n'),
     ['## Trials', '', renderTrials(trials)].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
-    ['## Erosion trajectory (native SCBench evaluation)', '', renderErosion(trials)].join('\n'),
+    [].join('\n'),
     ['## Factory run outcomes (harness health)', '', renderFactoryOutcomes(trials)].join('\n'),
     ['## Elapsed time', '', renderElapsed(trials)].join('\n'),
killedBy: generateBaselineReport renders "no trials" fallbacks across every section for zero trials
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain 'Not yet measurable — requires native …'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:552:6
     ['## Pinned inputs', '', renderPinnedInputs(config)].join('\n'),
     ['## Trials', '', renderTrials(trials)].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
-    ['## Erosion trajectory (native SCBench evaluation)', '', renderErosion(trials)].join('\n'),
+    ["", '', renderErosion(trials)].join('\n'),
     ['## Factory run outcomes (harness health)', '', renderFactoryOutcomes(trials)].join('\n'),
     ['## Elapsed time', '', renderElapsed(trials)].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:553:50
     ['## Trials', '', renderTrials(trials)].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
     ['## Erosion trajectory (native SCBench evaluation)', '', renderErosion(trials)].join('\n'),
-    ['## Factory run outcomes (harness health)', '', renderFactoryOutcomes(trials)].join('\n'),
+    ['## Factory run outcomes (harness health)', "Stryker was here!", renderFactoryOutcomes(trials)].join('\n'),
     ['## Elapsed time', '', renderElapsed(trials)].join('\n'),
     ['## Cost', '', renderCost(trials)].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] ArrayDeclaration
packages/scbench-adapter/src/baseline.ts:553:5
     ['## Trials', '', renderTrials(trials)].join('\n'),
     ['## Benchmark pass rate (native SCBench evaluation)', '', renderBenchmarkPassRate(config, trials)].join('\n'),
     ['## Erosion trajectory (native SCBench evaluation)', '', renderErosion(trials)].join('\n'),
-    ['## Factory run outcomes (harness health)', '', renderFactoryOutcomes(trials)].join('\n'),
+    [].join('\n'),
     ['## Elapsed time', '', renderElapsed(trials)].join('\n'),
     ['## Cost', '', renderCost(trials)].join('\n'),
killedBy: generateBaselineReport a ready manifest with no native evidence cannot render as a benchmark pass
statusReason: expected '# SlopCodeBench Baseline: test-baseli…' to contain '2/2 (100.0%) of Factory runs ended `r…'

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:556:33
     ['## Factory run outcomes (harness health)', '', renderFactoryOutcomes(trials)].join('\n'),
     ['## Elapsed time', '', renderElapsed(trials)].join('\n'),
     ['## Cost', '', renderCost(trials)].join('\n'),
-    ['## Routing and failover', '', renderRouting(trials)].join('\n'),
+    ['## Routing and failover', "Stryker was here!", renderRouting(trials)].join('\n'),
     ['## Checker outcomes', '', renderCheckerOutcomes(trials)].join('\n'),
     ['## Failure notes', '', renderFailureNotes(trials)].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:558:26
     ['## Cost', '', renderCost(trials)].join('\n'),
     ['## Routing and failover', '', renderRouting(trials)].join('\n'),
     ['## Checker outcomes', '', renderCheckerOutcomes(trials)].join('\n'),
-    ['## Failure notes', '', renderFailureNotes(trials)].join('\n'),
+    ['## Failure notes', "Stryker was here!", renderFailureNotes(trials)].join('\n'),
     [
       '## Reproduction',
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:558:63
     ['## Cost', '', renderCost(trials)].join('\n'),
     ['## Routing and failover', '', renderRouting(trials)].join('\n'),
     ['## Checker outcomes', '', renderCheckerOutcomes(trials)].join('\n'),
-    ['## Failure notes', '', renderFailureNotes(trials)].join('\n'),
+    ['## Failure notes', '', renderFailureNotes(trials)].join(""),
     [
       '## Reproduction',
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality

[Killed] StringLiteral
packages/scbench-adapter/src/baseline.ts:561:7
     ['## Failure notes', '', renderFailureNotes(trials)].join('\n'),
     [
       '## Reproduction',
-      '',
+      "Stryker was here!",
     ].join('\n'),
killedBy: baseline report drift regenerates the committed report.md byte-identically from the committed config + manifests
statusReason: expected '# SlopCodeBench Baseline: scbench-bas…' to be '# SlopCodeBench Baseline: scbench-bas…' // Object.is equality
