[Killed] BooleanLiteral
packages/scbench-adapter/src/run-checkpoint.ts:38:41
   await prepareWorkspace(opts.workspace, deps);
 
   const checkpointDir = join(opts.artifactsRoot, checkpoint.problemId, checkpoint.checkpointId);
-  mkdirSync(checkpointDir, { recursive: true });
+  mkdirSync(checkpointDir, { recursive: false });
 
   const briefPath = join(checkpointDir, 'brief.md');
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: ENOENT: no such file or directory, mkdir '/Users/moltbot/.openclaw/tmp/scbench-run-artifacts-jWJgu7/calculator/1'

[Killed] StringLiteral
packages/scbench-adapter/src/run-checkpoint.ts:40:41
   const checkpointDir = join(opts.artifactsRoot, checkpoint.problemId, checkpoint.checkpointId);
   mkdirSync(checkpointDir, { recursive: true });
 
-  const briefPath = join(checkpointDir, 'brief.md');
+  const briefPath = join(checkpointDir, "");
   writeFileSync(briefPath, materializeBrief(checkpoint));
 
killedBy: smoke checkpoint run twice (reproducibility) produces host-independent, comparable manifests across two independent trials
statusReason: EISDIR: illegal operation on a directory, open '/Users/moltbot/.openclaw/tmp/scb-baseline-smoke-art-0-gEQip0/smoke/1'

[Killed] CallExpression
packages/scbench-adapter/src/run-checkpoint.ts:41:3
   mkdirSync(checkpointDir, { recursive: true });
 
   const briefPath = join(checkpointDir, 'brief.md');
-  writeFileSync(briefPath, materializeBrief(checkpoint));
+  ;
 
   const args = buildRunBriefArgs({ briefPath, workspace: opts.workspace, artifactsDir: checkpointDir });
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
packages/scbench-adapter/src/run-checkpoint.ts:44:48
   writeFileSync(briefPath, materializeBrief(checkpoint));
 
   const args = buildRunBriefArgs({ briefPath, workspace: opts.workspace, artifactsDir: checkpointDir });
-  const factoryResult = await runFactory(args, { cwd: opts.workspace, factoryBin: opts.factoryBin }, deps);
+  const factoryResult = await runFactory(args, {}, deps);
 
   let result: CheckpointResult;
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: unexpected command: factory run-brief /Users/moltbot/.openclaw/tmp/scbench-run-artifacts-1gQVpg/calculator/1/brief.md --workspace /Users/moltbot/.openclaw/tmp/scbench-run-ws-Gn53zF --artifacts /Users/moltbot/.openclaw/tmp/scbench-run-artifacts-1gQVpg/calculator/1

[Killed] BlockStatement
packages/scbench-adapter/src/run-checkpoint.ts:47:7
   const factoryResult = await runFactory(args, { cwd: opts.workspace, factoryBin: opts.factoryBin }, deps);
 
   let result: CheckpointResult;
-  try {
-    const { manifestPath, manifest } = collectArtifacts({ artifactsDir: checkpointDir, dest: checkpointDir });
-    result = {
-      outcome: manifest.run.outcome,
-      workspace: opts.workspace,
-      artifactsDir: checkpointDir,
-      briefPath,
-      manifestPath,
-    };
-  } catch (err) {
+  try {} catch (err) {
     if (!(err instanceof AdapterError)) throw err;
     const factoryDetail =
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: Cannot read properties of undefined (reading 'outcome')

[Killed] ObjectLiteral
packages/scbench-adapter/src/run-checkpoint.ts:48:57
 
   let result: CheckpointResult;
   try {
-    const { manifestPath, manifest } = collectArtifacts({ artifactsDir: checkpointDir, dest: checkpointDir });
+    const { manifestPath, manifest } = collectArtifacts({});
     result = {
       outcome: manifest.run.outcome,
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: The "path" argument must be of type string. Received undefined

[Killed] BlockStatement
packages/scbench-adapter/src/run-checkpoint.ts:56:17
       briefPath,
       manifestPath,
     };
-  } catch (err) {
-    if (!(err instanceof AdapterError)) throw err;
-    const factoryDetail =
-      factoryResult.exitCode !== 0
-        ? ` (factory exited ${factoryResult.exitCode}: ${factoryResult.stderr || factoryResult.stdout || 'no output'})`
-        : '';
-    result = {
-      outcome: 'error',
-      workspace: opts.workspace,
-      artifactsDir: checkpointDir,
-      briefPath,
-      detail: `${err.message}${factoryDetail}`,
-    };
-  }
+  } catch (err) {}
 
   // A commit failure is a bookkeeping problem, not a Factory-run outcome —
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: Cannot read properties of undefined (reading 'outcome')

[Killed] BooleanLiteral
packages/scbench-adapter/src/run-checkpoint.ts:57:9
       manifestPath,
     };
   } catch (err) {
-    if (!(err instanceof AdapterError)) throw err;
+    if (err instanceof AdapterError) throw err;
     const factoryDetail =
       factoryResult.exitCode !== 0
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: no manifest.json found at /Users/moltbot/.openclaw/tmp/scbench-run-artifacts-8L6Nph/calculator/1 — Factory did not complete a run

[Killed] ConditionalExpression
packages/scbench-adapter/src/run-checkpoint.ts:57:9
       manifestPath,
     };
   } catch (err) {
-    if (!(err instanceof AdapterError)) throw err;
+    if (true) throw err;
     const factoryDetail =
       factoryResult.exitCode !== 0
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: no manifest.json found at /Users/moltbot/.openclaw/tmp/scbench-run-artifacts-oYcfM1/calculator/1 — Factory did not complete a run

[Killed] EqualityOperator
packages/scbench-adapter/src/run-checkpoint.ts:59:7
   } catch (err) {
     if (!(err instanceof AdapterError)) throw err;
     const factoryDetail =
-      factoryResult.exitCode !== 0
+      factoryResult.exitCode === 0
         ? ` (factory exited ${factoryResult.exitCode}: ${factoryResult.stderr || factoryResult.stdout || 'no output'})`
         : '';
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: expected 'no manifest.json found at /Users/molt…' to match /factory exited 1: crashed before mani…/

[Killed] ConditionalExpression
packages/scbench-adapter/src/run-checkpoint.ts:59:7
   } catch (err) {
     if (!(err instanceof AdapterError)) throw err;
     const factoryDetail =
-      factoryResult.exitCode !== 0
+      false
         ? ` (factory exited ${factoryResult.exitCode}: ${factoryResult.stderr || factoryResult.stdout || 'no output'})`
         : '';
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: expected 'no manifest.json found at /Users/molt…' to match /factory exited 1: crashed before mani…/

[Killed] LogicalOperator
packages/scbench-adapter/src/run-checkpoint.ts:60:58
     if (!(err instanceof AdapterError)) throw err;
     const factoryDetail =
       factoryResult.exitCode !== 0
-        ? ` (factory exited ${factoryResult.exitCode}: ${factoryResult.stderr || factoryResult.stdout || 'no output'})`
+        ? ` (factory exited ${factoryResult.exitCode}: ${factoryResult.stderr && factoryResult.stdout || 'no output'})`
         : '';
     result = {
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: expected 'no manifest.json found at /Users/molt…' to match /factory exited 1: crashed before mani…/

[Killed] ConditionalExpression
packages/scbench-adapter/src/run-checkpoint.ts:60:58
     if (!(err instanceof AdapterError)) throw err;
     const factoryDetail =
       factoryResult.exitCode !== 0
-        ? ` (factory exited ${factoryResult.exitCode}: ${factoryResult.stderr || factoryResult.stdout || 'no output'})`
+        ? ` (factory exited ${factoryResult.exitCode}: ${true})`
         : '';
     result = {
killedBy: runCheckpoint (2-checkpoint smoke) returns outcome "error" (not a throw) when Factory crashes before writing a manifest
statusReason: expected 'no manifest.json found at /Users/molt…' to match /factory exited 1: crashed before mani…/

[Killed] BlockStatement
packages/scbench-adapter/src/run-checkpoint.ts:74:7
   // A commit failure is a bookkeeping problem, not a Factory-run outcome —
   // it must never discard an already-resolved CheckpointResult (ready/failed/
   // parked/escalated/error). Fold it into `detail` instead of throwing.
-  try {
-    await commitCheckpoint(opts.workspace, checkpoint.checkpointId, deps);
-  } catch (err) {
+  try {} catch (err) {
     if (!(err instanceof AdapterError)) throw err;
     const commitDetail = `workspace commit failed: ${err.message}`;
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: expected [ 'scbench: initial workspace' ] to include 'scbench: checkpoint 1'

[Killed] BlockStatement
packages/scbench-adapter/src/run-checkpoint.ts:76:17
   // parked/escalated/error). Fold it into `detail` instead of throwing.
   try {
     await commitCheckpoint(opts.workspace, checkpoint.checkpointId, deps);
-  } catch (err) {
-    if (!(err instanceof AdapterError)) throw err;
-    const commitDetail = `workspace commit failed: ${err.message}`;
-    result = { ...result, detail: result.detail ? `${result.detail}; ${commitDetail}` : commitDetail };
-  }
+  } catch (err) {}
 
   return result;
killedBy: runCheckpoint (2-checkpoint smoke) keeps an already-successful result when the post-run commit fails
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] StringLiteral
packages/scbench-adapter/src/run-checkpoint.ts:78:26
     await commitCheckpoint(opts.workspace, checkpoint.checkpointId, deps);
   } catch (err) {
     if (!(err instanceof AdapterError)) throw err;
-    const commitDetail = `workspace commit failed: ${err.message}`;
+    const commitDetail = ``;
     result = { ...result, detail: result.detail ? `${result.detail}; ${commitDetail}` : commitDetail };
   }
killedBy: runCheckpoint (2-checkpoint smoke) keeps an already-successful result when the post-run commit fails
statusReason: expected '' to match /workspace commit failed/
