[Killed] BlockStatement
packages/scbench-adapter/src/brief.ts:7:73
 /** Turn a SCBench checkpoint into a Markdown brief that core's
  *  createLocalBriefAdapter (#507) resolves without error: an H1 title, the
  *  task verbatim, and a non-empty "## Acceptance criteria" section. */
-export function materializeBrief(checkpoint: ScbenchCheckpoint): string {
-  return `# SCBench ${checkpoint.problemId} — checkpoint ${checkpoint.checkpointId}
-
-${checkpoint.task}
-
-## Acceptance criteria
-
-- The workspace implements the checkpoint specification above; SlopCodeBench's hidden evaluation for checkpoint ${checkpoint.checkpointId} passes against the resulting code.
-`;
-}
+export function materializeBrief(checkpoint: ScbenchCheckpoint): string {}
 
killedBy: smoke checkpoint run twice (reproducibility) produces host-independent, comparable manifests across two independent trials
statusReason: The "data" argument must be of type string or an instance of Buffer, TypedArray, or DataView. Received undefined

[Killed] StringLiteral
packages/scbench-adapter/src/brief.ts:8:10
  *  createLocalBriefAdapter (#507) resolves without error: an H1 title, the
  *  task verbatim, and a non-empty "## Acceptance criteria" section. */
 export function materializeBrief(checkpoint: ScbenchCheckpoint): string {
-  return `# SCBench ${checkpoint.problemId} — checkpoint ${checkpoint.checkpointId}
-
-${checkpoint.task}
-
-## Acceptance criteria
-
-- The workspace implements the checkpoint specification above; SlopCodeBench's hidden evaluation for checkpoint ${checkpoint.checkpointId} passes against the resulting code.
-`;
+  return ``;
 }
 
killedBy: materializeBrief titles the brief with the problem and checkpoint id
statusReason: expected '' to match /^# SCBench calculator — checkpoint 2\n/
