[Survived] StringLiteral
packages/scbench-adapter/src/cli-run.ts:10:31
 
 const RUN_CHECKPOINT_USAGE =
   'usage: scbench-factory-agent run-checkpoint --workspace <dir> --artifacts <dir> --task-file <path> --problem <id> --checkpoint <id> [--index <n>] [--factory-bin <path>]';
-const BASELINE_REPORT_USAGE = 'usage: scbench-factory-agent baseline-report --config <path> --runs <dir> --out <path>';
+const BASELINE_REPORT_USAGE = "";
 const USAGE = `${RUN_CHECKPOINT_USAGE}\n${BASELINE_REPORT_USAGE}`;
 

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:26:43
   logError: (line: string) => void;
 }
 
-export function defaultCliDeps(): CliDeps {
-  return {
-    readTaskFile: (path) => readFile(path, 'utf-8'),
-    runCheckpoint,
-    readBaselineConfig: (path) => readFile(path, 'utf-8'),
-    collectBaselineTrials,
-    writeReport: (path, content) => writeFile(path, content),
-    log: (line) => console.log(line),
-    logError: (line) => console.error(line),
-  };
-}
+export function defaultCliDeps(): CliDeps {}
 
 function parseFlags(argv: readonly string[]): Record<string, string> {
killedBy: defaultCliDeps logs to console.log/console.error and reads real files
statusReason: Cannot read properties of undefined (reading 'log')

[Killed] ArrowFunction
packages/scbench-adapter/src/cli-run.ts:28:19
 
 export function defaultCliDeps(): CliDeps {
   return {
-    readTaskFile: (path) => readFile(path, 'utf-8'),
+    readTaskFile: () => undefined,
     runCheckpoint,
     readBaselineConfig: (path) => readFile(path, 'utf-8'),
killedBy: defaultCliDeps logs to console.log/console.error and reads real files
statusReason: You must provide a Promise to expect() when using .rejects, not 'undefined'.

[Killed] ArrowFunction
packages/scbench-adapter/src/cli-run.ts:30:25
   return {
     readTaskFile: (path) => readFile(path, 'utf-8'),
     runCheckpoint,
-    readBaselineConfig: (path) => readFile(path, 'utf-8'),
+    readBaselineConfig: () => undefined,
     collectBaselineTrials,
     writeReport: (path, content) => writeFile(path, content),
killedBy: defaultCliDeps reads a real baseline config and writes a real report file
statusReason: expected undefined to be '{"baselineId":"x","factory":{"repo":"…' // Object.is equality

[Killed] ArrowFunction
packages/scbench-adapter/src/cli-run.ts:32:18
     runCheckpoint,
     readBaselineConfig: (path) => readFile(path, 'utf-8'),
     collectBaselineTrials,
-    writeReport: (path, content) => writeFile(path, content),
+    writeReport: () => undefined,
     log: (line) => console.log(line),
     logError: (line) => console.error(line),
killedBy: defaultCliDeps reads a real baseline config and writes a real report file
statusReason: ENOENT: no such file or directory, open '/Users/moltbot/.openclaw/tmp/scb-cli-baseline-XYo45L/cfg.json'

[Killed] ArrowFunction
packages/scbench-adapter/src/cli-run.ts:33:10
     readBaselineConfig: (path) => readFile(path, 'utf-8'),
     collectBaselineTrials,
     writeReport: (path, content) => writeFile(path, content),
-    log: (line) => console.log(line),
+    log: () => undefined,
     logError: (line) => console.error(line),
   };
killedBy: defaultCliDeps logs to console.log/console.error and reads real files
statusReason: expected "log" to be called with arguments: [ 'hello' ]

Number of calls: 0

[Killed] ArrowFunction
packages/scbench-adapter/src/cli-run.ts:34:15
     collectBaselineTrials,
     writeReport: (path, content) => writeFile(path, content),
     log: (line) => console.log(line),
-    logError: (line) => console.error(line),
+    logError: () => undefined,
   };
 }
killedBy: defaultCliDeps logs to console.log/console.error and reads real files
statusReason: expected "error" to be called with arguments: [ 'oops' ]

Number of calls: 0

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:38:70
   };
 }
 
-function parseFlags(argv: readonly string[]): Record<string, string> {
-  const flags: Record<string, string> = {};
-  for (let i = 0; i < argv.length; i += 1) {
-    const flag = argv[i];
-    if (!flag.startsWith('--')) continue;
-    const value = argv[i + 1];
-    if (value === undefined || value.startsWith('--')) continue;
-    flags[flag] = value;
-    i += 1;
-  }
-  return flags;
-}
+function parseFlags(argv: readonly string[]): Record<string, string> {}
 
 /** Reads the task text from --task-file, calls runCheckpoint, and prints the
killedBy: cli-run main exits 2 when required flags are missing
statusReason: Cannot read properties of undefined (reading '--workspace')

[Killed] EqualityOperator
packages/scbench-adapter/src/cli-run.ts:40:19
 
 function parseFlags(argv: readonly string[]): Record<string, string> {
   const flags: Record<string, string> = {};
-  for (let i = 0; i < argv.length; i += 1) {
+  for (let i = 0; i <= argv.length; i += 1) {
     const flag = argv[i];
     if (!flag.startsWith('--')) continue;
killedBy: cli-run main exits 2 when required flags are missing
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:40:44
 
 function parseFlags(argv: readonly string[]): Record<string, string> {
   const flags: Record<string, string> = {};
-  for (let i = 0; i < argv.length; i += 1) {
-    const flag = argv[i];
-    if (!flag.startsWith('--')) continue;
-    const value = argv[i + 1];
-    if (value === undefined || value.startsWith('--')) continue;
-    flags[flag] = value;
-    i += 1;
-  }
+  for (let i = 0; i < argv.length; i += 1) {}
   return flags;
 }
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BooleanLiteral
packages/scbench-adapter/src/cli-run.ts:42:9
   const flags: Record<string, string> = {};
   for (let i = 0; i < argv.length; i += 1) {
     const flag = argv[i];
-    if (!flag.startsWith('--')) continue;
+    if (flag.startsWith('--')) continue;
     const value = argv[i + 1];
     if (value === undefined || value.startsWith('--')) continue;
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] MethodExpression
packages/scbench-adapter/src/cli-run.ts:42:10
   const flags: Record<string, string> = {};
   for (let i = 0; i < argv.length; i += 1) {
     const flag = argv[i];
-    if (!flag.startsWith('--')) continue;
+    if (!flag.endsWith('--')) continue;
     const value = argv[i + 1];
     if (value === undefined || value.startsWith('--')) continue;
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArithmeticOperator
packages/scbench-adapter/src/cli-run.ts:43:24
   for (let i = 0; i < argv.length; i += 1) {
     const flag = argv[i];
     if (!flag.startsWith('--')) continue;
-    const value = argv[i + 1];
+    const value = argv[i - 1];
     if (value === undefined || value.startsWith('--')) continue;
     flags[flag] = value;
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
packages/scbench-adapter/src/cli-run.ts:44:9
     const flag = argv[i];
     if (!flag.startsWith('--')) continue;
     const value = argv[i + 1];
-    if (value === undefined || value.startsWith('--')) continue;
+    if (value === undefined && value.startsWith('--')) continue;
     flags[flag] = value;
     i += 1;
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
packages/scbench-adapter/src/cli-run.ts:44:9
     const flag = argv[i];
     if (!flag.startsWith('--')) continue;
     const value = argv[i + 1];
-    if (value === undefined || value.startsWith('--')) continue;
+    if (value !== undefined || value.startsWith('--')) continue;
     flags[flag] = value;
     i += 1;
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Timeout] AssignmentOperator
packages/scbench-adapter/src/cli-run.ts:46:5
     const value = argv[i + 1];
     if (value === undefined || value.startsWith('--')) continue;
     flags[flag] = value;
-    i += 1;
+    i -= 1;
   }
   return flags;

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:57:51
  *  Factory run), 2 on a usage error or AdapterError. */
 async function runRunCheckpoint(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
-  const missing = REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
+  const missing = REQUIRED_FLAGS.filter((flag) => true);
   if (missing.length > 0) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${RUN_CHECKPOINT_USAGE}`);
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
packages/scbench-adapter/src/cli-run.ts:57:51
  *  Factory run), 2 on a usage error or AdapterError. */
 async function runRunCheckpoint(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
-  const missing = REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
+  const missing = REQUIRED_FLAGS.filter((flag) => flags[flag] !== undefined);
   if (missing.length > 0) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${RUN_CHECKPOINT_USAGE}`);
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] EqualityOperator
packages/scbench-adapter/src/cli-run.ts:58:7
 async function runRunCheckpoint(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
   const missing = REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
-  if (missing.length > 0) {
+  if (missing.length >= 0) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${RUN_CHECKPOINT_USAGE}`);
     return 2;
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:58:7
 async function runRunCheckpoint(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
   const missing = REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
-  if (missing.length > 0) {
+  if (false) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${RUN_CHECKPOINT_USAGE}`);
     return 2;
killedBy: cli-run main exits 2 when required flags are missing
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:64:7
   }
 
   let task: string;
-  try {
-    task = await deps.readTaskFile(flags['--task-file']);
-  } catch (err) {
+  try {} catch (err) {
     deps.logError(`could not read --task-file ${flags['--task-file']}: ${(err as Error).message}`);
     return 2;
killedBy: cli-run main parses flags, reads the task file, and prints the CheckpointResult as JSON on success
statusReason: expected "vi.fn()" to be called with arguments: [ '/tmp/task.md' ]

Number of calls: 0

[Killed] StringLiteral
packages/scbench-adapter/src/cli-run.ts:65:42
 
   let task: string;
   try {
-    task = await deps.readTaskFile(flags['--task-file']);
+    task = await deps.readTaskFile(flags[""]);
   } catch (err) {
     deps.logError(`could not read --task-file ${flags['--task-file']}: ${(err as Error).message}`);
killedBy: cli-run main parses flags, reads the task file, and prints the CheckpointResult as JSON on success
statusReason: expected "vi.fn()" to be called with arguments: [ '/tmp/task.md' ]

Received:

  1st vi.fn() call:

  [
-   "/tmp/task.md",

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:66:17
   let task: string;
   try {
     task = await deps.readTaskFile(flags['--task-file']);
-  } catch (err) {
-    deps.logError(`could not read --task-file ${flags['--task-file']}: ${(err as Error).message}`);
-    return 2;
-  }
+  } catch (err) {}
 
   const checkpoint: ScbenchCheckpoint = {
killedBy: cli-run main exits 2 when the task file cannot be read
statusReason: expected +0 to be 2 // Object.is equality

[Killed] CallExpression
packages/scbench-adapter/src/cli-run.ts:67:5
   try {
     task = await deps.readTaskFile(flags['--task-file']);
   } catch (err) {
-    deps.logError(`could not read --task-file ${flags['--task-file']}: ${(err as Error).message}`);
+    ;
     return 2;
   }
killedBy: cli-run main exits 2 when the task file cannot be read
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "ENOENT" ]

Number of calls: 0

[Survived] StringLiteral
packages/scbench-adapter/src/cli-run.ts:67:55
   try {
     task = await deps.readTaskFile(flags['--task-file']);
   } catch (err) {
-    deps.logError(`could not read --task-file ${flags['--task-file']}: ${(err as Error).message}`);
+    deps.logError(`could not read --task-file ${flags[""]}: ${(err as Error).message}`);
     return 2;
   }

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:74:12
   const checkpoint: ScbenchCheckpoint = {
     problemId: flags['--problem'],
     checkpointId: flags['--checkpoint'],
-    index: flags['--index'] !== undefined ? Number(flags['--index']) : 0,
+    index: true ? Number(flags['--index']) : 0,
     task,
   };
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"index": 0}, …(1) ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,11 @@
  [

[Killed] EqualityOperator
packages/scbench-adapter/src/cli-run.ts:74:12
   const checkpoint: ScbenchCheckpoint = {
     problemId: flags['--problem'],
     checkpointId: flags['--checkpoint'],
-    index: flags['--index'] !== undefined ? Number(flags['--index']) : 0,
+    index: flags['--index'] === undefined ? Number(flags['--index']) : 0,
     task,
   };
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"index": 0}, …(1) ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,11 @@
  [

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:78:7
     task,
   };
 
-  try {
-    const result = await deps.runCheckpoint(checkpoint, {
-      workspace: flags['--workspace'],
-      artifactsRoot: flags['--artifacts'],
-      factoryBin: flags['--factory-bin'],
-    });
-    deps.log(JSON.stringify(result));
-    return 0;
-  } catch (err) {
+  try {} catch (err) {
     if (err instanceof AdapterError) {
       deps.logError(err.message);
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected undefined to be +0 // Object.is equality

[Killed] StringLiteral
packages/scbench-adapter/src/cli-run.ts:80:24
 
   try {
     const result = await deps.runCheckpoint(checkpoint, {
-      workspace: flags['--workspace'],
+      workspace: flags[""],
       artifactsRoot: flags['--artifacts'],
       factoryBin: flags['--factory-bin'],
killedBy: cli-run main ignores stray non-flag tokens and a flag immediately followed by another flag
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"index": 0}, …(1) ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] CallExpression
packages/scbench-adapter/src/cli-run.ts:84:5
       artifactsRoot: flags['--artifacts'],
       factoryBin: flags['--factory-bin'],
     });
-    deps.log(JSON.stringify(result));
+    ;
     return 0;
   } catch (err) {
killedBy: cli-run main parses flags, reads the task file, and prints the CheckpointResult as JSON on success
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:86:17
     });
     deps.log(JSON.stringify(result));
     return 0;
-  } catch (err) {
-    if (err instanceof AdapterError) {
-      deps.logError(err.message);
-      return 2;
-    }
-    throw err;
-  }
+  } catch (err) {}
 }
 
killedBy: cli-run main exits 2 when runCheckpoint throws an AdapterError
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:87:9
     deps.log(JSON.stringify(result));
     return 0;
   } catch (err) {
-    if (err instanceof AdapterError) {
+    if (true) {
       deps.logError(err.message);
       return 2;
killedBy: cli-run main re-throws unexpected (non-AdapterError) errors
statusReason: promise resolved "2" instead of rejecting

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:87:38
     deps.log(JSON.stringify(result));
     return 0;
   } catch (err) {
-    if (err instanceof AdapterError) {
-      deps.logError(err.message);
-      return 2;
-    }
+    if (err instanceof AdapterError) {}
     throw err;
   }
killedBy: cli-run main exits 2 when runCheckpoint throws an AdapterError
statusReason: workspace unwritable

[Killed] CallExpression
packages/scbench-adapter/src/cli-run.ts:88:7
     return 0;
   } catch (err) {
     if (err instanceof AdapterError) {
-      deps.logError(err.message);
+      ;
       return 2;
     }
killedBy: cli-run main exits 2 when runCheckpoint throws an AdapterError
statusReason: expected "vi.fn()" to be called with arguments: [ 'workspace unwritable' ]

Number of calls: 0

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:102:67
  *  committed report.md hasn't drifted. */
 async function runBaselineReport(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
-  const missing = BASELINE_REPORT_REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
+  const missing = BASELINE_REPORT_REQUIRED_FLAGS.filter((flag) => false);
   if (missing.length > 0) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${BASELINE_REPORT_USAGE}`);
killedBy: baseline-report subcommand prints usage and exits 2 when called with no subcommand at all
statusReason: expected +0 to be 2 // Object.is equality

[Killed] MethodExpression
packages/scbench-adapter/src/cli-run.ts:102:19
  *  committed report.md hasn't drifted. */
 async function runBaselineReport(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
-  const missing = BASELINE_REPORT_REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
+  const missing = BASELINE_REPORT_REQUIRED_FLAGS;
   if (missing.length > 0) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${BASELINE_REPORT_USAGE}`);
killedBy: baseline-report subcommand exits 2 when required flags are missing
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "missing required flag(s): --runs, --out",

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:103:7
 async function runBaselineReport(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
   const missing = BASELINE_REPORT_REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
-  if (missing.length > 0) {
+  if (false) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${BASELINE_REPORT_USAGE}`);
     return 2;
killedBy: baseline-report subcommand prints usage and exits 2 when called with no subcommand at all
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:103:7
 async function runBaselineReport(rest: readonly string[], deps: CliDeps): Promise<number> {
   const flags = parseFlags(rest);
   const missing = BASELINE_REPORT_REQUIRED_FLAGS.filter((flag) => flags[flag] === undefined);
-  if (missing.length > 0) {
+  if (true) {
     deps.logError(`missing required flag(s): ${missing.join(', ')}\n${BASELINE_REPORT_USAGE}`);
     return 2;
killedBy: baseline-report subcommand reads the config, collects trials, writes the report, and exits 0 on success
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:109:7
   }
 
   let raw: string;
-  try {
-    raw = await deps.readBaselineConfig(flags['--config']);
-  } catch (err) {
+  try {} catch (err) {
     deps.logError(`could not read --config ${flags['--config']}: ${(err as Error).message}`);
     return 2;
killedBy: baseline-report subcommand reads the config, collects trials, writes the report, and exits 0 on success
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:111:17
   let raw: string;
   try {
     raw = await deps.readBaselineConfig(flags['--config']);
-  } catch (err) {
-    deps.logError(`could not read --config ${flags['--config']}: ${(err as Error).message}`);
-    return 2;
-  }
+  } catch (err) {}
 
   try {
killedBy: baseline-report subcommand exits 2 when --config cannot be read
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "ENOENT" ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "ENOENT",

[Killed] CallExpression
packages/scbench-adapter/src/cli-run.ts:112:5
   try {
     raw = await deps.readBaselineConfig(flags['--config']);
   } catch (err) {
-    deps.logError(`could not read --config ${flags['--config']}: ${(err as Error).message}`);
+    ;
     return 2;
   }
killedBy: baseline-report subcommand exits 2 when --config cannot be read
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "ENOENT" ]

Number of calls: 0

[Survived] StringLiteral
packages/scbench-adapter/src/cli-run.ts:112:52
   try {
     raw = await deps.readBaselineConfig(flags['--config']);
   } catch (err) {
-    deps.logError(`could not read --config ${flags['--config']}: ${(err as Error).message}`);
+    deps.logError(`could not read --config ${flags[""]}: ${(err as Error).message}`);
     return 2;
   }

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:116:7
     return 2;
   }
 
-  try {
-    const config = loadBaselineConfig(raw);
-    const trials = deps.collectBaselineTrials(flags['--runs']);
-    const report = generateBaselineReport(config, trials);
-    await deps.writeReport(flags['--out'], report);
-    deps.log(`wrote baseline report to ${flags['--out']}`);
-    return 0;
-  } catch (err) {
+  try {} catch (err) {
     if (err instanceof AdapterError) {
       deps.logError(err.message);
killedBy: baseline-report subcommand reads the config, collects trials, writes the report, and exits 0 on success
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
packages/scbench-adapter/src/cli-run.ts:134:104
 
 /** Hand-rolled argv parsing + dispatch across the `run-checkpoint` and
  *  `baseline-report` subcommands. */
-export async function main(argv: readonly string[], deps: CliDeps = defaultCliDeps()): Promise<number> {
-  const [subcommand, ...rest] = argv;
-  if (subcommand === 'run-checkpoint') return runRunCheckpoint(rest, deps);
-  if (subcommand === 'baseline-report') return runBaselineReport(rest, deps);
-
-  deps.logError(USAGE);
-  return 2;
-}
+export async function main(argv: readonly string[], deps: CliDeps = defaultCliDeps()): Promise<number> {}
 
killedBy: cli-run main prints usage and exits 2 for an unknown/missing subcommand
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:136:7
  *  `baseline-report` subcommands. */
 export async function main(argv: readonly string[], deps: CliDeps = defaultCliDeps()): Promise<number> {
   const [subcommand, ...rest] = argv;
-  if (subcommand === 'run-checkpoint') return runRunCheckpoint(rest, deps);
+  if (false) return runRunCheckpoint(rest, deps);
   if (subcommand === 'baseline-report') return runBaselineReport(rest, deps);
 
killedBy: cli-run main exits 2 when required flags are missing
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "missing required flag",

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:136:7
  *  `baseline-report` subcommands. */
 export async function main(argv: readonly string[], deps: CliDeps = defaultCliDeps()): Promise<number> {
   const [subcommand, ...rest] = argv;
-  if (subcommand === 'run-checkpoint') return runRunCheckpoint(rest, deps);
+  if (true) return runRunCheckpoint(rest, deps);
   if (subcommand === 'baseline-report') return runBaselineReport(rest, deps);
 
killedBy: baseline-report subcommand exits 2 when required flags are missing
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "missing required flag(s): --runs, --out",

[Killed] EqualityOperator
packages/scbench-adapter/src/cli-run.ts:137:7
 export async function main(argv: readonly string[], deps: CliDeps = defaultCliDeps()): Promise<number> {
   const [subcommand, ...rest] = argv;
   if (subcommand === 'run-checkpoint') return runRunCheckpoint(rest, deps);
-  if (subcommand === 'baseline-report') return runBaselineReport(rest, deps);
+  if (subcommand !== 'baseline-report') return runBaselineReport(rest, deps);
 
   deps.logError(USAGE);
killedBy: baseline-report subcommand prints usage and exits 2 when called with no subcommand at all
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "missing required flag",

[Killed] ConditionalExpression
packages/scbench-adapter/src/cli-run.ts:137:7
 export async function main(argv: readonly string[], deps: CliDeps = defaultCliDeps()): Promise<number> {
   const [subcommand, ...rest] = argv;
   if (subcommand === 'run-checkpoint') return runRunCheckpoint(rest, deps);
-  if (subcommand === 'baseline-report') return runBaselineReport(rest, deps);
+  if (false) return runBaselineReport(rest, deps);
 
   deps.logError(USAGE);
killedBy: baseline-report subcommand prints usage and exits 2 when called with no subcommand at all
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   StringContaining "missing required flag",

[Killed] CallExpression
packages/scbench-adapter/src/cli-run.ts:139:3
   if (subcommand === 'run-checkpoint') return runRunCheckpoint(rest, deps);
   if (subcommand === 'baseline-report') return runBaselineReport(rest, deps);
 
-  deps.logError(USAGE);
+  ;
   return 2;
 }
killedBy: cli-run main prints usage and exits 2 for an unknown/missing subcommand
statusReason: expected "vi.fn()" to be called with arguments: [ StringContaining "usage:" ]

Number of calls: 0
