[Killed] BlockStatement
packages/scbench-adapter/src/invoke.ts:11:77
 }
 
 /** Pure argv builder for `factory run-brief <brief> --workspace <ws> --artifacts <dir>`. */
-export function buildRunBriefArgs(opts: BuildRunBriefArgsOptions): string[] {
-  return ['run-brief', opts.briefPath, '--workspace', opts.workspace, '--artifacts', opts.artifactsDir];
-}
+export function buildRunBriefArgs(opts: BuildRunBriefArgsOptions): string[] {}
 
 export interface RunFactoryOptions {
killedBy: smoke checkpoint run twice (reproducibility) produces host-independent, comparable manifests across two independent trials
statusReason: args is not iterable

[Killed] BlockStatement
packages/scbench-adapter/src/invoke.ts:29:24
   args: readonly string[],
   opts: RunFactoryOptions,
   deps: { exec: ExecFn },
-): Promise<ExecResult> {
-  const bin = opts.factoryBin ?? process.env.FACTORY_BIN ?? 'factory';
-  return deps.exec([bin, ...args], { cwd: opts.cwd });
-}
+): Promise<ExecResult> {}
 
killedBy: smoke checkpoint run twice (reproducibility) produces host-independent, comparable manifests across two independent trials
statusReason: Cannot read properties of undefined (reading 'exitCode')

[Killed] LogicalOperator
packages/scbench-adapter/src/invoke.ts:30:15
   opts: RunFactoryOptions,
   deps: { exec: ExecFn },
 ): Promise<ExecResult> {
-  const bin = opts.factoryBin ?? process.env.FACTORY_BIN ?? 'factory';
+  const bin = opts.factoryBin && process.env.FACTORY_BIN ?? 'factory';
   return deps.exec([bin, ...args], { cwd: opts.cwd });
 }
killedBy: runCheckpoint (2-checkpoint smoke) reuses the workspace across checkpoints and writes isolated artifacts
statusReason: unexpected command: factory run-brief /Users/moltbot/.openclaw/tmp/scbench-run-artifacts-CnFqA2/calculator/1/brief.md --workspace /Users/moltbot/.openclaw/tmp/scbench-run-ws-9vb3X1 --artifacts /Users/moltbot/.openclaw/tmp/scbench-run-artifacts-CnFqA2/calculator/1

[Killed] LogicalOperator
packages/scbench-adapter/src/invoke.ts:30:15
   opts: RunFactoryOptions,
   deps: { exec: ExecFn },
 ): Promise<ExecResult> {
-  const bin = opts.factoryBin ?? process.env.FACTORY_BIN ?? 'factory';
+  const bin = (opts.factoryBin ?? process.env.FACTORY_BIN) && 'factory';
   return deps.exec([bin, ...args], { cwd: opts.cwd });
 }
killedBy: runFactory defaults to the bare "factory" binary and runs with cwd = workspace
statusReason: expected [ { argv: [ undefined, …(2) ], …(1) } ] to deeply equal [ { argv: [ 'factory', …(2) ], …(1) } ]
