[Killed] BlockStatement
packages/tui/src/dashboard.ts:27:52
   runDone: boolean;
 }
 
-export function initialDashboard(): DashboardState {
-  return { lanes: [], runDone: false };
-}
+export function initialDashboard(): DashboardState {}
 
 export function isLaneEvent(e: FactoryEvent): boolean {
killedBy: App shows a waiting message before any events arrive
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain 'waiting for factory events'

[Killed] BooleanLiteral
packages/tui/src/dashboard.ts:28:32
 }
 
 export function initialDashboard(): DashboardState {
-  return { lanes: [], runDone: false };
+  return { lanes: [], runDone: true };
 }
 
killedBy: reduceDashboard — global events non-lifecycle global events (triage, worktree-gc, watchdog, lane-done) create no lanes
statusReason: expected true to be false // Object.is equality

[Killed] ArrayDeclaration
packages/tui/src/dashboard.ts:28:19
 }
 
 export function initialDashboard(): DashboardState {
-  return { lanes: [], runDone: false };
+  return { lanes: ["Stryker was here"], runDone: false };
 }
 
killedBy: App shows a waiting message before any events arrive
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain 'waiting for factory events'

[Killed] BlockStatement
packages/tui/src/dashboard.ts:31:55
   return { lanes: [], runDone: false };
 }
 
-export function isLaneEvent(e: FactoryEvent): boolean {
-  return /^\d+$/.test(e.issue);
-}
+export function isLaneEvent(e: FactoryEvent): boolean {}
 
 function newLane(e: FactoryEvent): LaneState {
killedBy: App renders a single lane directly in detail view with no row list
statusReason: expected '[1 Dashboard] 2 Queue  3 Costs  4 Log…' to contain '#296'

[Killed] Regex
packages/tui/src/dashboard.ts:32:10
 }
 
 export function isLaneEvent(e: FactoryEvent): boolean {
-  return /^\d+$/.test(e.issue);
+  return /^\d$/.test(e.issue);
 }
 
killedBy: App renders a single lane directly in detail view with no row list
statusReason: expected '[1 Dashboard] 2 Queue  3 Costs  4 Log…' to contain '#296'

[Survived] Regex
packages/tui/src/dashboard.ts:32:10
 }
 
 export function isLaneEvent(e: FactoryEvent): boolean {
-  return /^\d+$/.test(e.issue);
+  return /^\d+/.test(e.issue);
 }
 

[Killed] BlockStatement
packages/tui/src/dashboard.ts:35:46
   return /^\d+$/.test(e.issue);
 }
 
-function newLane(e: FactoryEvent): LaneState {
-  return { issue: e.issue, run: initialState(), status: 'running', startedAt: e.ts };
-}
+function newLane(e: FactoryEvent): LaneState {}
 
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
killedBy: App renders a single lane directly in detail view with no row list
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain '#296'

[Survived] StringLiteral
packages/tui/src/dashboard.ts:36:57
 }
 
 function newLane(e: FactoryEvent): LaneState {
-  return { issue: e.issue, run: initialState(), status: 'running', startedAt: e.ts };
+  return { issue: e.issue, run: initialState(), status: "", startedAt: e.ts };
 }
 

[Killed] BooleanLiteral
packages/tui/src/dashboard.ts:40:7
 }
 
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
-  if (!isLaneEvent(e)) {
+  if (isLaneEvent(e)) {
     if (e.type === 'usage-stop') return { ...state, usageStop: e.msg };
     if (e.type === 'run-done') return { ...state, runDone: true };
killedBy: App renders a single lane directly in detail view with no row list
statusReason: expected '[1 Dashboard] 2 Queue  3 Costs  4 Log…' to contain '#296'

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:40:7
 }
 
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
-  if (!isLaneEvent(e)) {
+  if (true) {
     if (e.type === 'usage-stop') return { ...state, usageStop: e.msg };
     if (e.type === 'run-done') return { ...state, runDone: true };
killedBy: App renders a single lane directly in detail view with no row list
statusReason: expected '[1 Dashboard] 2 Queue  3 Costs  4 Log…' to contain '#296'

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:41:9
 
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
   if (!isLaneEvent(e)) {
-    if (e.type === 'usage-stop') return { ...state, usageStop: e.msg };
+    if (false) return { ...state, usageStop: e.msg };
     if (e.type === 'run-done') return { ...state, runDone: true };
     return state;
killedBy: reduceDashboard — global events usage-stop sets usageStop without creating a lane
statusReason: expected undefined to be 'daily cap reached' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:41:9
 
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
   if (!isLaneEvent(e)) {
-    if (e.type === 'usage-stop') return { ...state, usageStop: e.msg };
+    if (true) return { ...state, usageStop: e.msg };
     if (e.type === 'run-done') return { ...state, runDone: true };
     return state;
killedBy: reduceDashboard — global events run-done sets runDone without creating a lane
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:42:9
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
   if (!isLaneEvent(e)) {
     if (e.type === 'usage-stop') return { ...state, usageStop: e.msg };
-    if (e.type === 'run-done') return { ...state, runDone: true };
+    if (true) return { ...state, runDone: true };
     return state;
   }
killedBy: reduceDashboard — global events non-lifecycle global events (triage, worktree-gc, watchdog, lane-done) create no lanes
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:42:9
 export function reduceDashboard(state: DashboardState, e: FactoryEvent): DashboardState {
   if (!isLaneEvent(e)) {
     if (e.type === 'usage-stop') return { ...state, usageStop: e.msg };
-    if (e.type === 'run-done') return { ...state, runDone: true };
+    if (false) return { ...state, runDone: true };
     return state;
   }
killedBy: reduceDashboard — global events run-done sets runDone without creating a lane
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
packages/tui/src/dashboard.ts:46:44
     return state;
   }
 
-  const idx = state.lanes.findIndex((l) => l.issue === e.issue);
+  const idx = state.lanes.findIndex((l) => l.issue !== e.issue);
   const prevLane = idx === -1 ? newLane(e) : state.lanes[idx];
   const prevStatus = prevLane.status;
killedBy: reduceDashboard — lane creation and independence creates lanes in first-event order and advances each lane independently
statusReason: expected [ '296' ] to deeply equal [ '296', '301', '305' ]

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:46:44
     return state;
   }
 
-  const idx = state.lanes.findIndex((l) => l.issue === e.issue);
+  const idx = state.lanes.findIndex((l) => true);
   const prevLane = idx === -1 ? newLane(e) : state.lanes[idx];
   const prevStatus = prevLane.status;
killedBy: App renders independent rows for multiple lanes that update independently
statusReason: expected '[1 Dashboard] 2 Queue  3 Costs  4 Log…' to contain '2 lane(s)'

[Killed] UnaryOperator
packages/tui/src/dashboard.ts:47:28
   }
 
   const idx = state.lanes.findIndex((l) => l.issue === e.issue);
-  const prevLane = idx === -1 ? newLane(e) : state.lanes[idx];
+  const prevLane = idx === +1 ? newLane(e) : state.lanes[idx];
   const prevStatus = prevLane.status;
 
killedBy: reduceDashboard — lane creation and independence creates lanes in first-event order and advances each lane independently
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:47:20
   }
 
   const idx = state.lanes.findIndex((l) => l.issue === e.issue);
-  const prevLane = idx === -1 ? newLane(e) : state.lanes[idx];
+  const prevLane = false ? newLane(e) : state.lanes[idx];
   const prevStatus = prevLane.status;
 
killedBy: reduceDashboard — lane creation and independence creates lanes in first-event order and advances each lane independently
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ObjectLiteral
packages/tui/src/dashboard.ts:50:25
   const prevLane = idx === -1 ? newLane(e) : state.lanes[idx];
   const prevStatus = prevLane.status;
 
-  let lane: LaneState = { ...prevLane, run: reduceEvent(prevLane.run, e) };
+  let lane: LaneState = {};
 
   if (laneStatusOf(e.type) === 'running' && prevStatus !== 'running') {
killedBy: App renders a single lane directly in detail view with no row list
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain '#296'

[Killed] EqualityOperator
packages/tui/src/dashboard.ts:52:7
 
   let lane: LaneState = { ...prevLane, run: reduceEvent(prevLane.run, e) };
 
-  if (laneStatusOf(e.type) === 'running' && prevStatus !== 'running') {
+  if (laneStatusOf(e.type) !== 'running' && prevStatus !== 'running') {
     lane = {
       ...lane,
killedBy: reduceDashboard — lifecycle events await-merge sets waiting-merge and keeps the first waitingSince on repeat
statusReason: expected 'running' to be 'waiting-merge' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:52:7
 
   let lane: LaneState = { ...prevLane, run: reduceEvent(prevLane.run, e) };
 
-  if (laneStatusOf(e.type) === 'running' && prevStatus !== 'running') {
+  if (false) {
     lane = {
       ...lane,
killedBy: reduceDashboard — lifecycle events resets a failed lane to running when a phase event arrives again (re-run)
statusReason: expected 'failed' to be 'running' // Object.is equality

[Killed] ObjectLiteral
packages/tui/src/dashboard.ts:53:12
   let lane: LaneState = { ...prevLane, run: reduceEvent(prevLane.run, e) };
 
   if (laneStatusOf(e.type) === 'running' && prevStatus !== 'running') {
-    lane = {
-      ...lane,
-      status: 'running',
-      finishedAt: undefined,
-      failedPhase: undefined,
-      failReason: undefined,
-      waitingSince: undefined,
-    };
+    lane = {};
   } else if (e.type === 'issue-title') {
     lane = { ...lane, title: e.msg };
killedBy: reduceDashboard — lifecycle events resets a failed lane to running when a phase event arrives again (re-run)
statusReason: expected undefined to be 'running' // Object.is equality

[Killed] StringLiteral
packages/tui/src/dashboard.ts:55:15
   if (laneStatusOf(e.type) === 'running' && prevStatus !== 'running') {
     lane = {
       ...lane,
-      status: 'running',
+      status: "",
       finishedAt: undefined,
       failedPhase: undefined,
killedBy: reduceDashboard — lifecycle events resets a failed lane to running when a phase event arrives again (re-run)
statusReason: expected '' to be 'running' // Object.is equality

[Killed] BlockStatement
packages/tui/src/dashboard.ts:61:40
       failReason: undefined,
       waitingSince: undefined,
     };
-  } else if (e.type === 'issue-title') {
-    lane = { ...lane, title: e.msg };
-  } else if (e.type === 'worktree') {
+  } else if (e.type === 'issue-title') {} else if (e.type === 'worktree') {
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
killedBy: reduceDashboard — lifecycle events issue-title sets the lane title
statusReason: expected undefined to be 'Add multi-lane dashboard' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:61:14
       failReason: undefined,
       waitingSince: undefined,
     };
-  } else if (e.type === 'issue-title') {
+  } else if (false) {
     lane = { ...lane, title: e.msg };
   } else if (e.type === 'worktree') {
killedBy: reduceDashboard — lifecycle events issue-title sets the lane title
statusReason: expected undefined to be 'Add multi-lane dashboard' // Object.is equality

[Killed] ObjectLiteral
packages/tui/src/dashboard.ts:62:12
       waitingSince: undefined,
     };
   } else if (e.type === 'issue-title') {
-    lane = { ...lane, title: e.msg };
+    lane = {};
   } else if (e.type === 'worktree') {
     const prefix = 'Worktree ready at ';
killedBy: reduceDashboard — lifecycle events issue-title sets the lane title
statusReason: expected undefined to be 'Add multi-lane dashboard' // Object.is equality

[Killed] EqualityOperator
packages/tui/src/dashboard.ts:63:14
     };
   } else if (e.type === 'issue-title') {
     lane = { ...lane, title: e.msg };
-  } else if (e.type === 'worktree') {
+  } else if (e.type !== 'worktree') {
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
killedBy: reduceDashboard — lifecycle events worktree event sets the lane worktree path
statusReason: expected undefined to be '/tmp/wt' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:63:14
     };
   } else if (e.type === 'issue-title') {
     lane = { ...lane, title: e.msg };
-  } else if (e.type === 'worktree') {
+  } else if (false) {
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
killedBy: reduceDashboard — lifecycle events worktree event sets the lane worktree path
statusReason: expected undefined to be '/tmp/wt' // Object.is equality

[Killed] MethodExpression
packages/tui/src/dashboard.ts:65:60
     lane = { ...lane, title: e.msg };
   } else if (e.type === 'worktree') {
     const prefix = 'Worktree ready at ';
-    lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
+    lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg : lane.worktree };
   } else if (e.type === 'ready') {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
killedBy: reduceDashboard — lifecycle events worktree event sets the lane worktree path
statusReason: expected 'Worktree ready at /tmp/wt' to be '/tmp/wt' // Object.is equality

[Killed] MethodExpression
packages/tui/src/dashboard.ts:65:33
     lane = { ...lane, title: e.msg };
   } else if (e.type === 'worktree') {
     const prefix = 'Worktree ready at ';
-    lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
+    lane = { ...lane, worktree: e.msg.endsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
   } else if (e.type === 'ready') {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
killedBy: reduceDashboard — lifecycle events worktree event sets the lane worktree path
statusReason: expected undefined to be '/tmp/wt' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:66:14
   } else if (e.type === 'worktree') {
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
-  } else if (e.type === 'ready') {
+  } else if (true) {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
   } else if (e.type === 'await-merge') {
killedBy: reduceDashboard — lifecycle events await-merge sets waiting-merge and keeps the first waitingSince on repeat
statusReason: expected 'ready' to be 'waiting-merge' // Object.is equality

[Killed] BlockStatement
packages/tui/src/dashboard.ts:66:34
   } else if (e.type === 'worktree') {
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
-  } else if (e.type === 'ready') {
-    lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
-  } else if (e.type === 'await-merge') {
+  } else if (e.type === 'ready') {} else if (e.type === 'await-merge') {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
   } else if (e.type === 'landed') {
killedBy: reduceDashboard — lifecycle events ready sets status to ready and parses the PR number
statusReason: expected 'running' to be 'ready' // Object.is equality

[Killed] OptionalChaining
packages/tui/src/dashboard.ts:67:50
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
   } else if (e.type === 'ready') {
-    lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
+    lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)[1] ?? lane.prNumber };
   } else if (e.type === 'await-merge') {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
killedBy: reduceDashboard — lifecycle events ready without a parseable PR number leaves prNumber unset
statusReason: Cannot read properties of null (reading '1')

[Killed] LogicalOperator
packages/tui/src/dashboard.ts:67:50
     const prefix = 'Worktree ready at ';
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
   } else if (e.type === 'ready') {
-    lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
+    lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] && lane.prNumber };
   } else if (e.type === 'await-merge') {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
killedBy: reduceDashboard — lifecycle events ready sets status to ready and parses the PR number
statusReason: expected undefined to be '123' // Object.is equality

[Killed] EqualityOperator
packages/tui/src/dashboard.ts:68:14
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
   } else if (e.type === 'ready') {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
-  } else if (e.type === 'await-merge') {
+  } else if (e.type !== 'await-merge') {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
   } else if (e.type === 'landed') {
killedBy: reduceDashboard — lifecycle events await-merge sets waiting-merge and keeps the first waitingSince on repeat
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-01-01T00:05:00.000Z' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:68:14
     lane = { ...lane, worktree: e.msg.startsWith(prefix) ? e.msg.slice(prefix.length) : lane.worktree };
   } else if (e.type === 'ready') {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
-  } else if (e.type === 'await-merge') {
+  } else if (true) {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
   } else if (e.type === 'landed') {
killedBy: reduceDashboard — lifecycle events await-merge sets waiting-merge and keeps the first waitingSince on repeat
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-01-01T00:05:00.000Z' // Object.is equality

[Killed] LogicalOperator
packages/tui/src/dashboard.ts:69:62
   } else if (e.type === 'ready') {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
   } else if (e.type === 'await-merge') {
-    lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
+    lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince && e.ts };
   } else if (e.type === 'landed') {
     lane = { ...lane, status: 'merged', finishedAt: e.ts };
killedBy: reduceDashboard — lifecycle events await-merge sets waiting-merge and keeps the first waitingSince on repeat
statusReason: expected undefined to be '2026-01-01T00:05:00.000Z' // Object.is equality

[Killed] ObjectLiteral
packages/tui/src/dashboard.ts:69:12
   } else if (e.type === 'ready') {
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
   } else if (e.type === 'await-merge') {
-    lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
+    lane = {};
   } else if (e.type === 'landed') {
     lane = { ...lane, status: 'merged', finishedAt: e.ts };
killedBy: reduceDashboard — lifecycle events await-merge sets waiting-merge and keeps the first waitingSince on repeat
statusReason: expected undefined to be 'waiting-merge' // Object.is equality

[Killed] EqualityOperator
packages/tui/src/dashboard.ts:70:14
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
   } else if (e.type === 'await-merge') {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
-  } else if (e.type === 'landed') {
+  } else if (e.type !== 'landed') {
     lane = { ...lane, status: 'merged', finishedAt: e.ts };
   } else if (laneStatusOf(e.type) === 'failed') {
killedBy: reduceDashboard — lifecycle events landed sets status merged and freezes finishedAt
statusReason: expected '2026-01-01T00:00:00.000Z' to be '2026-01-01T00:10:00.000Z' // Object.is equality

[Killed] BlockStatement
packages/tui/src/dashboard.ts:70:35
     lane = { ...lane, status: 'ready', prNumber: e.msg.match(/PR #(\d+)/)?.[1] ?? lane.prNumber };
   } else if (e.type === 'await-merge') {
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
-  } else if (e.type === 'landed') {
-    lane = { ...lane, status: 'merged', finishedAt: e.ts };
-  } else if (laneStatusOf(e.type) === 'failed') {
+  } else if (e.type === 'landed') {} else if (laneStatusOf(e.type) === 'failed') {
     lane = {
       ...lane,
killedBy: reduceDashboard — lifecycle events landed sets status merged and freezes finishedAt
statusReason: expected 'running' to be 'merged' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:72:14
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
   } else if (e.type === 'landed') {
     lane = { ...lane, status: 'merged', finishedAt: e.ts };
-  } else if (laneStatusOf(e.type) === 'failed') {
+  } else if (true) {
     lane = {
       ...lane,
killedBy: reduceDashboard — lifecycle events does not overwrite failedPhase/failReason when a second failure event follows
statusReason: expected 'Starting plan phase' to be 'first failure' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:72:14
     lane = { ...lane, status: 'waiting-merge', waitingSince: lane.waitingSince ?? e.ts };
   } else if (e.type === 'landed') {
     lane = { ...lane, status: 'merged', finishedAt: e.ts };
-  } else if (laneStatusOf(e.type) === 'failed') {
+  } else if (false) {
     lane = {
       ...lane,
killedBy: reduceDashboard — lifecycle events fail sets status failed with the phase active at failure and preserves the reason
statusReason: expected 'running' to be 'failed' // Object.is equality

[Killed] LogicalOperator
packages/tui/src/dashboard.ts:76:20
     lane = {
       ...lane,
       status: 'failed',
-      failedPhase: lane.failedPhase ?? lane.run.activePhase,
+      failedPhase: lane.failedPhase && lane.run.activePhase,
       failReason: lane.failReason ?? e.msg,
       finishedAt: e.ts,
killedBy: reduceDashboard — lifecycle events fail sets status failed with the phase active at failure and preserves the reason
statusReason: expected undefined to be 'BUILD' // Object.is equality

[Killed] LogicalOperator
packages/tui/src/dashboard.ts:77:19
       ...lane,
       status: 'failed',
       failedPhase: lane.failedPhase ?? lane.run.activePhase,
-      failReason: lane.failReason ?? e.msg,
+      failReason: lane.failReason && e.msg,
       finishedAt: e.ts,
     };
killedBy: reduceDashboard — lifecycle events fail sets status failed with the phase active at failure and preserves the reason
statusReason: expected undefined to be 'boom' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:80:14
       failReason: lane.failReason ?? e.msg,
       finishedAt: e.ts,
     };
-  } else if (e.type === 'stopped') {
+  } else if (false) {
     lane = { ...lane, status: 'stopped', finishedAt: e.ts };
   }
killedBy: reduceDashboard — lifecycle events stopped sets status stopped and retains the last known run state
statusReason: expected 'running' to be 'stopped' // Object.is equality

[Killed] EqualityOperator
packages/tui/src/dashboard.ts:80:14
       failReason: lane.failReason ?? e.msg,
       finishedAt: e.ts,
     };
-  } else if (e.type === 'stopped') {
+  } else if (e.type !== 'stopped') {
     lane = { ...lane, status: 'stopped', finishedAt: e.ts };
   }
killedBy: reduceDashboard — lifecycle events stopped sets status stopped and retains the last known run state
statusReason: expected 'running' to be 'stopped' // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:84:82
     lane = { ...lane, status: 'stopped', finishedAt: e.ts };
   }
 
-  const lanes = idx === -1 ? [...state.lanes, lane] : state.lanes.map((l, i) => (i === idx ? lane : l));
+  const lanes = idx === -1 ? [...state.lanes, lane] : state.lanes.map((l, i) => (true ? lane : l));
   return { ...state, lanes };
 }
killedBy: reduceDashboard — lane creation and independence creates lanes in first-event order and advances each lane independently
statusReason: Cannot read properties of undefined (reading 'run')

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:84:82
     lane = { ...lane, status: 'stopped', finishedAt: e.ts };
   }
 
-  const lanes = idx === -1 ? [...state.lanes, lane] : state.lanes.map((l, i) => (i === idx ? lane : l));
+  const lanes = idx === -1 ? [...state.lanes, lane] : state.lanes.map((l, i) => (false ? lane : l));
   return { ...state, lanes };
 }
killedBy: reduceDashboard — lane creation and independence creates lanes in first-event order and advances each lane independently
statusReason: expected 'PLAN' to be 'BUILD' // Object.is equality

[Killed] BlockStatement
packages/tui/src/dashboard.ts:88:94
   return { ...state, lanes };
 }
 
-export function mergeTrainPosition(state: DashboardState, issue: string): number | undefined {
-  const waiting = state.lanes
-    .filter((l) => l.status === 'waiting-merge')
-    .sort((a, b) => {
-      const diff = Date.parse(a.waitingSince ?? '') - Date.parse(b.waitingSince ?? '');
-      return diff !== 0 ? diff : Number(a.issue) - Number(b.issue);
-    });
-  const idx = waiting.findIndex((l) => l.issue === issue);
-  return idx === -1 ? undefined : idx + 1;
-}
+export function mergeTrainPosition(state: DashboardState, issue: string): number | undefined {}
 
 export function laneElapsedMs(lane: LaneState, now: number): number {
killedBy: mergeTrainPosition orders waiting lanes by waitingSince, tiebreaking on issue number
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
packages/tui/src/dashboard.ts:89:19
 }
 
 export function mergeTrainPosition(state: DashboardState, issue: string): number | undefined {
-  const waiting = state.lanes
-    .filter((l) => l.status === 'waiting-merge')
+  const waiting = state.lanes
     .sort((a, b) => {
       const diff = Date.parse(a.waitingSince ?? '') - Date.parse(b.waitingSince ?? '');
killedBy: mergeTrainPosition returns undefined for lanes not currently waiting-merge
statusReason: expected 1 to be undefined

[Killed] MethodExpression
packages/tui/src/dashboard.ts:89:19
 }
 
 export function mergeTrainPosition(state: DashboardState, issue: string): number | undefined {
-  const waiting = state.lanes
-    .filter((l) => l.status === 'waiting-merge')
-    .sort((a, b) => {
-      const diff = Date.parse(a.waitingSince ?? '') - Date.parse(b.waitingSince ?? '');
-      return diff !== 0 ? diff : Number(a.issue) - Number(b.issue);
-    });
+  const waiting = state.lanes.filter(l => l.status === 'waiting-merge');
   const idx = waiting.findIndex((l) => l.issue === issue);
   return idx === -1 ? undefined : idx + 1;
killedBy: mergeTrainPosition orders waiting lanes by waitingSince, tiebreaking on issue number
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
packages/tui/src/dashboard.ts:90:20
 
 export function mergeTrainPosition(state: DashboardState, issue: string): number | undefined {
   const waiting = state.lanes
-    .filter((l) => l.status === 'waiting-merge')
+    .filter((l) => true)
     .sort((a, b) => {
       const diff = Date.parse(a.waitingSince ?? '') - Date.parse(b.waitingSince ?? '');
killedBy: mergeTrainPosition returns undefined for lanes not currently waiting-merge
statusReason: expected 1 to be undefined

[Killed] ArrowFunction
packages/tui/src/dashboard.ts:90:13
 
 export function mergeTrainPosition(state: DashboardState, issue: string): number | undefined {
   const waiting = state.lanes
-    .filter((l) => l.status === 'waiting-merge')
+    .filter(() => undefined)
     .sort((a, b) => {
       const diff = Date.parse(a.waitingSince ?? '') - Date.parse(b.waitingSince ?? '');
killedBy: mergeTrainPosition orders waiting lanes by waitingSince, tiebreaking on issue number
statusReason: expected undefined to be 1 // Object.is equality
