[Killed] BlockStatement
packages/tui/src/fallback.ts:13:15
   eventsFile: string,
   out: NodeJS.WritableStream = process.stdout,
   follow: typeof followEvents = followEvents,
-): () => void {
-  return follow(
-    eventsFile,
-    (e: FactoryEvent) => {
-      out.write(formatEventLine(e.type, e.issue, e.msg, { color: colorEnabled(out as { isTTY?: boolean }) }) + '\n');
-    },
-    { fromStart: true },
-  );
-}
+): () => void {}
 
killedBy: followPlain prints each event in the [factory] type #issue: msg format
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] BlockStatement
packages/tui/src/fallback.ts:16:26
 ): () => void {
   return follow(
     eventsFile,
-    (e: FactoryEvent) => {
-      out.write(formatEventLine(e.type, e.issue, e.msg, { color: colorEnabled(out as { isTTY?: boolean }) }) + '\n');
-    },
+    (e: FactoryEvent) => {},
     { fromStart: true },
   );
killedBy: followPlain prints each event in the [factory] type #issue: msg format
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] CallExpression
packages/tui/src/fallback.ts:17:7
   return follow(
     eventsFile,
     (e: FactoryEvent) => {
-      out.write(formatEventLine(e.type, e.issue, e.msg, { color: colorEnabled(out as { isTTY?: boolean }) }) + '\n');
+      ;
     },
     { fromStart: true },
killedBy: followPlain prints each event in the [factory] type #issue: msg format
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] StringLiteral
packages/tui/src/fallback.ts:17:112
   return follow(
     eventsFile,
     (e: FactoryEvent) => {
-      out.write(formatEventLine(e.type, e.issue, e.msg, { color: colorEnabled(out as { isTTY?: boolean }) }) + '\n');
+      out.write(formatEventLine(e.type, e.issue, e.msg, { color: colorEnabled(out as { isTTY?: boolean }) }) + "");
     },
     { fromStart: true },
killedBy: followPlain prints each event in the [factory] type #issue: msg format
statusReason: expected [ Array(1) ] to deeply equal [ Array(1) ]

[Killed] BooleanLiteral
packages/tui/src/fallback.ts:19:18
     (e: FactoryEvent) => {
       out.write(formatEventLine(e.type, e.issue, e.msg, { color: colorEnabled(out as { isTTY?: boolean }) }) + '\n');
     },
-    { fromStart: true },
+    { fromStart: false },
   );
 }
killedBy: followPlain prints each event in the [factory] type #issue: msg format
statusReason: expected "vi.fn()" to be called with arguments: [ Array(3) ]

Received:

  1st vi.fn() call:

  [
    "events.ndjson",
