[Killed] BlockStatement
tui/src/tabs/log-scroll.ts:9:52
   offset: number;
 }
 
-export function initialLogScroll(): LogScrollState {
-  return { follow: true, offset: 0 };
-}
+export function initialLogScroll(): LogScrollState {}
 
 export type LogScrollAction = 'up' | 'down' | 'pageUp' | 'pageDown' | 'toggleFollow';
killedBy: App cycles Dashboard -> Queue -> Costs -> Log -> Dashboard on Tab, and jumps directly on digit keys
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain '[4 Log]'

[Killed] BooleanLiteral
tui/src/tabs/log-scroll.ts:10:20
 }
 
 export function initialLogScroll(): LogScrollState {
-  return { follow: true, offset: 0 };
+  return { follow: false, offset: 0 };
 }
 
killedBy: App scrolls the Log tab with the up arrow and re-enables follow with f
statusReason: expected ' 1 Dashboard  2 Queue  3 Costs [4 Log…' to contain 'follow: on'

[Killed] BlockStatement
tui/src/tabs/log-scroll.ts:20:19
   a: LogScrollAction,
   pageSize: number,
   total: number,
-): LogScrollState {
-  const maxOffset = Math.max(0, total - pageSize);
-
-  switch (a) {
-    case 'up':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
-    case 'pageUp':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
-    case 'down':
-      return { ...s, offset: Math.max(0, s.offset - 1) };
-    case 'pageDown':
-      return { ...s, offset: Math.max(0, s.offset - pageSize) };
-    case 'toggleFollow': {
-      const follow = !s.follow;
-      return { follow, offset: follow ? 0 : s.offset };
-    }
-  }
-}
+): LogScrollState {}
 
 export interface VisibleSlice {
killedBy: App scrolls the Log tab with the up arrow and re-enables follow with f
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain 'follow: off'

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:21:33
   pageSize: number,
   total: number,
 ): LogScrollState {
-  const maxOffset = Math.max(0, total - pageSize);
+  const maxOffset = Math.max(0, total + pageSize);
 
   switch (a) {
killedBy: reduceLogScroll pageUp clamps offset at total - pageSize
statusReason: expected { follow: false, offset: 95 } to deeply equal { follow: false, offset: 90 }

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:21:21
   pageSize: number,
   total: number,
 ): LogScrollState {
-  const maxOffset = Math.max(0, total - pageSize);
+  const maxOffset = Math.min(0, total - pageSize);
 
   switch (a) {
killedBy: App scrolls the Log tab with the up arrow and re-enables follow with f
statusReason: expected ' 1 Dashboard  2 Queue  3 Costs [4 Log…' not to contain 'step 29'

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:24:5
   const maxOffset = Math.max(0, total - pageSize);
 
   switch (a) {
-    case 'up':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
+    case 'up':
     case 'pageUp':
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
killedBy: reduceLogScroll up increases offset and disables follow
statusReason: expected { follow: false, offset: 10 } to deeply equal { follow: false, offset: 1 }

[Killed] StringLiteral
tui/src/tabs/log-scroll.ts:24:10
   const maxOffset = Math.max(0, total - pageSize);
 
   switch (a) {
-    case 'up':
+    case "":
       return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
     case 'pageUp':
killedBy: App scrolls the Log tab with the up arrow and re-enables follow with f
statusReason: expected '\n  ERROR  Cannot read properties of …' to contain 'follow: off'

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:25:39
 
   switch (a) {
     case 'up':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
+      return { follow: false, offset: Math.max(maxOffset, s.offset + 1) };
     case 'pageUp':
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
killedBy: reduceLogScroll up increases offset and disables follow
statusReason: expected { follow: false, offset: 90 } to deeply equal { follow: false, offset: 1 }

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:25:59
 
   switch (a) {
     case 'up':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
+      return { follow: false, offset: Math.min(maxOffset, s.offset - 1) };
     case 'pageUp':
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
killedBy: App scrolls the Log tab with the up arrow and re-enables follow with f
statusReason: expected ' 1 Dashboard  2 Queue  3 Costs [4 Log…' not to contain 'step 29'

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:26:5
   switch (a) {
     case 'up':
       return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
-    case 'pageUp':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
+    case 'pageUp':
     case 'down':
       return { ...s, offset: Math.max(0, s.offset - 1) };
killedBy: reduceLogScroll pageUp increases offset by pageSize and disables follow
statusReason: expected { follow: true, offset: +0 } to deeply equal { follow: false, offset: 10 }

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:27:59
     case 'up':
       return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
     case 'pageUp':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
+      return { follow: false, offset: Math.min(maxOffset, s.offset - pageSize) };
     case 'down':
       return { ...s, offset: Math.max(0, s.offset - 1) };
killedBy: reduceLogScroll pageUp increases offset by pageSize and disables follow
statusReason: expected { follow: false, offset: -10 } to deeply equal { follow: false, offset: 10 }

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:27:39
     case 'up':
       return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
     case 'pageUp':
-      return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
+      return { follow: false, offset: Math.max(maxOffset, s.offset + pageSize) };
     case 'down':
       return { ...s, offset: Math.max(0, s.offset - 1) };
killedBy: reduceLogScroll pageUp increases offset by pageSize and disables follow
statusReason: expected { follow: false, offset: 90 } to deeply equal { follow: false, offset: 10 }

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:28:5
       return { follow: false, offset: Math.min(maxOffset, s.offset + 1) };
     case 'pageUp':
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
-    case 'down':
-      return { ...s, offset: Math.max(0, s.offset - 1) };
+    case 'down':
     case 'pageDown':
       return { ...s, offset: Math.max(0, s.offset - pageSize) };
killedBy: reduceLogScroll down decreases offset toward zero, preserving follow state
statusReason: expected { follow: false, offset: +0 } to deeply equal { follow: false, offset: 4 }

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:29:42
     case 'pageUp':
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
     case 'down':
-      return { ...s, offset: Math.max(0, s.offset - 1) };
+      return { ...s, offset: Math.max(0, s.offset + 1) };
     case 'pageDown':
       return { ...s, offset: Math.max(0, s.offset - pageSize) };
killedBy: reduceLogScroll down decreases offset toward zero, preserving follow state
statusReason: expected { follow: false, offset: 6 } to deeply equal { follow: false, offset: 4 }

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:29:30
     case 'pageUp':
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
     case 'down':
-      return { ...s, offset: Math.max(0, s.offset - 1) };
+      return { ...s, offset: Math.min(0, s.offset - 1) };
     case 'pageDown':
       return { ...s, offset: Math.max(0, s.offset - pageSize) };
killedBy: reduceLogScroll down decreases offset toward zero, preserving follow state
statusReason: expected { follow: false, offset: +0 } to deeply equal { follow: false, offset: 4 }

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:30:5
       return { follow: false, offset: Math.min(maxOffset, s.offset + pageSize) };
     case 'down':
       return { ...s, offset: Math.max(0, s.offset - 1) };
-    case 'pageDown':
-      return { ...s, offset: Math.max(0, s.offset - pageSize) };
+    case 'pageDown':
     case 'toggleFollow': {
       const follow = !s.follow;
killedBy: reduceLogScroll pageDown decreases offset by pageSize, clamped at zero
statusReason: expected { follow: true, offset: +0 } to deeply equal { follow: false, offset: +0 }

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:31:42
     case 'down':
       return { ...s, offset: Math.max(0, s.offset - 1) };
     case 'pageDown':
-      return { ...s, offset: Math.max(0, s.offset - pageSize) };
+      return { ...s, offset: Math.max(0, s.offset + pageSize) };
     case 'toggleFollow': {
       const follow = !s.follow;
killedBy: reduceLogScroll pageDown decreases offset by pageSize, clamped at zero
statusReason: expected { follow: false, offset: 15 } to deeply equal { follow: false, offset: +0 }

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:31:30
     case 'down':
       return { ...s, offset: Math.max(0, s.offset - 1) };
     case 'pageDown':
-      return { ...s, offset: Math.max(0, s.offset - pageSize) };
+      return { ...s, offset: Math.min(0, s.offset - pageSize) };
     case 'toggleFollow': {
       const follow = !s.follow;
killedBy: reduceLogScroll pageDown decreases offset by pageSize, clamped at zero
statusReason: expected { follow: false, offset: -5 } to deeply equal { follow: false, offset: +0 }

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:32:5
       return { ...s, offset: Math.max(0, s.offset - 1) };
     case 'pageDown':
       return { ...s, offset: Math.max(0, s.offset - pageSize) };
-    case 'toggleFollow': {
-      const follow = !s.follow;
-      return { follow, offset: follow ? 0 : s.offset };
-    }
+    case 'toggleFollow':
   }
 }
killedBy: reduceLogScroll toggleFollow flips follow and resets offset to 0 when turning on
statusReason: expected undefined to deeply equal { follow: true, offset: +0 }

[Killed] BlockStatement
tui/src/tabs/log-scroll.ts:32:26
       return { ...s, offset: Math.max(0, s.offset - 1) };
     case 'pageDown':
       return { ...s, offset: Math.max(0, s.offset - pageSize) };
-    case 'toggleFollow': {
-      const follow = !s.follow;
-      return { follow, offset: follow ? 0 : s.offset };
-    }
+    case 'toggleFollow': {}
   }
 }
killedBy: reduceLogScroll toggleFollow flips follow and resets offset to 0 when turning on
statusReason: expected undefined to deeply equal { follow: true, offset: +0 }

[Killed] BooleanLiteral
tui/src/tabs/log-scroll.ts:33:22
     case 'pageDown':
       return { ...s, offset: Math.max(0, s.offset - pageSize) };
     case 'toggleFollow': {
-      const follow = !s.follow;
+      const follow = s.follow;
       return { follow, offset: follow ? 0 : s.offset };
     }
killedBy: reduceLogScroll toggleFollow flips follow and resets offset to 0 when turning on
statusReason: expected { follow: false, offset: 42 } to deeply equal { follow: true, offset: +0 }

[Killed] BlockStatement
tui/src/tabs/log-scroll.ts:46:103
 }
 
 /** Windowed view of `events` for the given scroll state. 1-based first/last for display; total = events.length. */
-export function visibleSlice(events: FactoryEvent[], s: LogScrollState, height: number): VisibleSlice {
-  const total = events.length;
-  if (total === 0) return { slice: [], first: 0, last: 0 };
-
-  const maxOffset = Math.max(0, total - height);
-  const offset = Math.min(s.offset, maxOffset);
-  const end = total - offset;
-  const start = Math.max(0, end - height);
-
-  return { slice: events.slice(start, end), first: start + 1, last: end };
-}
+export function visibleSlice(events: FactoryEvent[], s: LogScrollState, height: number): VisibleSlice {}
 
killedBy: visibleSlice returns an empty slice for no events
statusReason: expected undefined to deeply equal { slice: [], first: +0, last: +0 }

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:48:7
 /** Windowed view of `events` for the given scroll state. 1-based first/last for display; total = events.length. */
 export function visibleSlice(events: FactoryEvent[], s: LogScrollState, height: number): VisibleSlice {
   const total = events.length;
-  if (total === 0) return { slice: [], first: 0, last: 0 };
+  if (false) return { slice: [], first: 0, last: 0 };
 
   const maxOffset = Math.max(0, total - height);
killedBy: visibleSlice returns an empty slice for no events
statusReason: expected { slice: [], first: 1, last: +0 } to deeply equal { slice: [], first: +0, last: +0 }

[Killed] ConditionalExpression
tui/src/tabs/log-scroll.ts:48:7
 /** Windowed view of `events` for the given scroll state. 1-based first/last for display; total = events.length. */
 export function visibleSlice(events: FactoryEvent[], s: LogScrollState, height: number): VisibleSlice {
   const total = events.length;
-  if (total === 0) return { slice: [], first: 0, last: 0 };
+  if (true) return { slice: [], first: 0, last: 0 };
 
   const maxOffset = Math.max(0, total - height);
killedBy: visibleSlice shows all events with correct bounds when fewer events than height
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:50:33
   const total = events.length;
   if (total === 0) return { slice: [], first: 0, last: 0 };
 
-  const maxOffset = Math.max(0, total - height);
+  const maxOffset = Math.max(0, total + height);
   const offset = Math.min(s.offset, maxOffset);
   const end = total - offset;
killedBy: visibleSlice clamps the offset to the oldest possible window
statusReason: expected [ 'msg 0', 'msg 1', 'msg 2', …(12) ] to deeply equal [ 'msg 0', 'msg 1', 'msg 2', …(2) ]

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:50:21
   const total = events.length;
   if (total === 0) return { slice: [], first: 0, last: 0 };
 
-  const maxOffset = Math.max(0, total - height);
+  const maxOffset = Math.min(0, total - height);
   const offset = Math.min(s.offset, maxOffset);
   const end = total - offset;
killedBy: visibleSlice shows all events with correct bounds when fewer events than height
statusReason: expected 10 to be 3 // Object.is equality

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:51:18
   if (total === 0) return { slice: [], first: 0, last: 0 };
 
   const maxOffset = Math.max(0, total - height);
-  const offset = Math.min(s.offset, maxOffset);
+  const offset = Math.max(s.offset, maxOffset);
   const end = total - offset;
   const start = Math.max(0, end - height);
killedBy: visibleSlice shows the newest window when offset is 0 (follow)
statusReason: expected [ 'msg 0', 'msg 1', 'msg 2', …(2) ] to deeply equal [ 'msg 15', 'msg 16', 'msg 17', …(2) ]

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:52:15
 
   const maxOffset = Math.max(0, total - height);
   const offset = Math.min(s.offset, maxOffset);
-  const end = total - offset;
+  const end = total + offset;
   const start = Math.max(0, end - height);
 
killedBy: visibleSlice shows an older window when scrolled up by offset
statusReason: expected [] to deeply equal [ 'msg 10', 'msg 11', 'msg 12', …(2) ]

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:53:17
   const maxOffset = Math.max(0, total - height);
   const offset = Math.min(s.offset, maxOffset);
   const end = total - offset;
-  const start = Math.max(0, end - height);
+  const start = Math.min(0, end - height);
 
   return { slice: events.slice(start, end), first: start + 1, last: end };
killedBy: visibleSlice shows all events with correct bounds when fewer events than height
statusReason: expected -6 to be 1 // Object.is equality

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:53:29
   const maxOffset = Math.max(0, total - height);
   const offset = Math.min(s.offset, maxOffset);
   const end = total - offset;
-  const start = Math.max(0, end - height);
+  const start = Math.max(0, end + height);
 
   return { slice: events.slice(start, end), first: start + 1, last: end };
killedBy: visibleSlice shows all events with correct bounds when fewer events than height
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] MethodExpression
tui/src/tabs/log-scroll.ts:55:19
   const end = total - offset;
   const start = Math.max(0, end - height);
 
-  return { slice: events.slice(start, end), first: start + 1, last: end };
+  return { slice: events, first: start + 1, last: end };
 }
 
killedBy: visibleSlice shows the newest window when offset is 0 (follow)
statusReason: expected [ 'msg 0', 'msg 1', 'msg 2', …(17) ] to deeply equal [ 'msg 15', 'msg 16', 'msg 17', …(2) ]

[Killed] ArithmeticOperator
tui/src/tabs/log-scroll.ts:55:52
   const end = total - offset;
   const start = Math.max(0, end - height);
 
-  return { slice: events.slice(start, end), first: start + 1, last: end };
+  return { slice: events.slice(start, end), first: start - 1, last: end };
 }
 
killedBy: visibleSlice shows all events with correct bounds when fewer events than height
statusReason: expected -1 to be 1 // Object.is equality
