[Killed] StringLiteral
tui/src/tabs/types.ts:3:51
 export type TabName = 'dashboard' | 'queue' | 'costs' | 'log';
 
-export const TAB_ORDER: TabName[] = ['dashboard', 'queue', 'costs', 'log'];
+export const TAB_ORDER: TabName[] = ['dashboard', "", 'costs', 'log'];
 
 export const TAB_LABELS: Record<TabName, string> = {
killedBy: App cycles Dashboard -> Queue -> Costs -> Log -> Dashboard on Tab, and jumps directly on digit keys
statusReason: expected ' 1 Dashboard [2 ] 3 Costs  4 Log  Tab…' to contain '[2 Queue]'

[Killed] ArrayDeclaration
tui/src/tabs/types.ts:3:37
 export type TabName = 'dashboard' | 'queue' | 'costs' | 'log';
 
-export const TAB_ORDER: TabName[] = ['dashboard', 'queue', 'costs', 'log'];
+export const TAB_ORDER: TabName[] = [];
 
 export const TAB_LABELS: Record<TabName, string> = {
killedBy: App cycles Dashboard -> Queue -> Costs -> Log -> Dashboard on Tab, and jumps directly on digit keys
statusReason: expected ' Tab/1-4 switch · q quit' to contain '[2 Queue]'
